{"title":"[SoM]Colpo Vincente[DvdRip-Xvid-Ita-Mp3]","uid":4411723,"size":735000576,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:006908f48d22482bf9ef240f5396b60952f8ac33&amp;dn=%5BSoM%5DColpo+Vincente%5BDvdRip-Xvid-Ita-Mp3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mitimex","files":1,"time":1222286240,"description":"L&amp;#039;anziano Norman Dale accetta l&amp;#039;offerta di un amico, preside del college di Hickory, una cittadina dell&amp;#039;Indiana, per riabilitarsi. Dale, ex-allenatore di pallacanestro, a suo tempo radiato per aver usato modi maneschi, vuole rientrare nel giro. Pieno di talento, Norman ama questo lavoro, che per lui ÃƒÂ¨ sinonimo di sacrificio e disciplina, sia per sÃƒÂ© che per la squadra. L&amp;#039;ambiente in cui si trova, perÃƒÂ², ÃƒÂ¨ scettico e diffidente e, a cominciare dall&amp;#039;allenatore che lo ha preceduto, moltissimi sono contro i suoi metodi poco ortodossi. Soprattutto una giovane maestra, Myra Fleener, gli si schiera contro. Poco a poco, tuttavia, Norman vince le resistenze; i genitori ne approvano a maggioranza la riconferma e le invidie cadono. Jimmy, un ragazzo ombrose e instabile, entra a far parte della squadra e dÃƒÂ  subito prova della sua bravura, mentre gli altri ragazzi, ora disciplinati, cominciano a vincere le prime partite di campionato. Perfino Myra ha ceduto e tra lei e Norman sembra nascere qualcosa. L&amp;#039;allenatore nomina &quot;Colpoincanna&quot;, padre di uno dei suoi ragazzi, che sa tutto del basket, suo assistente in campo e lo aiuta a smettere di bere. Tenendo duro, lottando contro arbitri prevaricatori, sbraitando e caricando i suoi ragazzi al massimo, Dale porta di partita in partita la squadra a vincere addirittura il campionato regionale alla presenza di ventimila spettatori.","torrent":{"xt":"urn:btih:006908f48d22482bf9ef240f5396b60952f8ac33","amp;dn":"%5BSoM%5DColpo+Vincente%5BDvdRip-Xvid-Ita-Mp3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"006908f48d22482bf9ef240f5396b60952f8ac33","infoHashBuffer":{"type":"Buffer","data":[0,105,8,244,141,34,72,43,249,239,36,15,83,150,182,9,82,248,172,51]},"announce":[],"urlList":[]}}