{"title":"Cibo Matto - Viva! La Woman [1996]","uid":7130952,"size":272735280,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0218d687001e5a5fdcd1cc73dd8630633a59703d&amp;dn=Cibo+Matto+-+Viva%21+La+Woman+%5B1996%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GenXRock","files":-1,"time":1332706902,"description":"Fresh and funky, female and Japanese, the trip-hop/rap duo Cibo Matto has been the recipient of a lot of hype. Fortunately, it's well-founded; all trendiness aside, Viva! La Woman is an innovative and catchy mix of eclectic samples and stream-of-consciousness lyrics. The likes of Paul Weller, Ennio Morricone, and Duke Ellington combine with observations like &quot;My weight is three hundred pounds/My favorite is beef jerky&quot; (from &quot;Beef Jerky&quot;) and &quot;Shut up and eat! You know my love is sweet!&quot; from (&quot;Birthday Cake&quot;) in a fun and refreshing way. The tone of the album varies with each song; on tracks like &quot;Sugar Water&quot; and &quot;Artichoke,&quot; Cibo Matto plays it spooky and ethereal, while &quot;Birthday Cake&quot; and the single &quot;Know Your Chicken&quot; find them as a couple of cryptic Beastie Girls, tossing off wacky non sequiturs over found soundscapes. Cibo Matto cooks up a tasty appetizer of their talent with Viva! La Woman. Like their tongue-in-cheek cover of &quot;The Candy Man,&quot; Cibo Matto makes everything they bake satisfying and delicious. A diverse and entertaining album, Viva! La Woman leaves the listener hungry for more of their crazy food for thought.","torrent":{"xt":"urn:btih:0218d687001e5a5fdcd1cc73dd8630633a59703d","amp;dn":"Cibo+Matto+-+Viva%21+La+Woman+%5B1996%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0218d687001e5a5fdcd1cc73dd8630633a59703d","infoHashBuffer":{"type":"Buffer","data":[2,24,214,135,0,30,90,95,220,209,204,115,221,134,48,99,58,89,112,61]},"announce":[],"urlList":[]}}