{"title":"A Smoky Mountain Christmas (1986) DvD-Rip XviD","uid":4576074,"size":737434445,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0250c9d058aa99b582a66e40ca6e9c10590c5d9f&amp;dn=A+Smoky+Mountain+Christmas+%281986%29+DvD-Rip+XviD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dukesfan84","files":4,"time":1229232855,"description":".: A Smoky Mountain Christmas (1986) DvD-Rip XviD :.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0091975&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0091975&lt;/a&gt;\n\n.:File Details:.\n\nVideo Codec : Xvid (MPEG-4) (XVID)\nPlayback Time : 01:34:44\nImage Size : 512 x 384 ( 1.33 : 1 )\nVideo Bit Rate : 905 kb/s\nFrames/sec : 23.976 Frames/Sec\nAudio Codec : MPEG-1 Audio Layer 3 (Mp3)\nBit Rate : 128.00 KBits/Sec\nSample ratio : 48,000 Hz\nChannel count : 2 Channels (STEREO)\n\n.:Plot:.\n\nCountry music superstar Lorna Davis (Dolly Parton) is overwhelmed\nand disillusioned by her career and loneliness. She plans a trip\nto a friend's cabin in Tennessee's Smoky Mountains to escape and\nrecuperate during the Christmas season.\n\nUpon arriving at the cabin, Lorna finds it has become the impromptu\nhome of seven orphans who are hiding from the orphanage in town.\nThe children actually discover her sleeping in one of the beds,\n(an allusion to the Seven Dwarfs finding Snow White) to which\nthe youngest girl proclaims: &quot;I know who she is. She's the Angel.&quot;\n\nBecause they both have secrets to keep - the orphans don't want\nto be found by the orphanage and Lorna doesn't want to be found\nby anyone from LA - they agree to keep each other's presence at\nthe cabin a secret. Lorna then quickly builds strong friendships\nwith the children, although it takes a while to win over cautious\nJake, the eldest brother in the family.\n\nLittle does she know, Lorna has been followed to the cabin by a\nsleazy and enterprising paparazzo (Dan Hedaya), who is determined\nto reveal her hidden location. In addition to the paparazzo,\nLorna faces a mountain &quot;witch woman,&quot; Jezebel, who is determined\nto kill her for attracting the eye of her lover, the sheriff of\nthe nearby town. Lorna is saved from Jezebel's first attempt on\nher life by Mountain Dan, a wandering mountain man who is wise\nto the ways of &quot;mountain folk.&quot;\n\nAfter the paparazzo reveals Lorna's identity to the sheriff, she\nis arrested and the children are taken back to the orphanage.\nJezebel, disguised as an old woman, delivers a poisoned pie to\nLorna in prison, but is tricked into eating it herself and falls\ninto an endless sleep. Lorna is freed from prison by Jake, Dan\nand the paparazzo and they formulate a plan to free the children\nfrom the orphanage.\n\nDressed as Santa Claus and a helper Elf, Dan and Lorna are able\nto get into the orphanage and free the children, only to be\nstopped by the sheriff while trying to escape.\n\nThey are taken before an extremely disinterested Judge (John Ritter)\nwho eventually dismisses all charges against Lorna and Dan and grants\ncustody of the children to Lorna.","torrent":{"xt":"urn:btih:0250c9d058aa99b582a66e40ca6e9c10590c5d9f","amp;dn":"A+Smoky+Mountain+Christmas+%281986%29+DvD-Rip+XviD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0250c9d058aa99b582a66e40ca6e9c10590c5d9f","infoHashBuffer":{"type":"Buffer","data":[2,80,201,208,88,170,153,181,130,166,110,64,202,110,156,16,89,12,93,159]},"announce":[],"urlList":[]}}