{"title":"Poker Movies - The Collection","uid":4879433,"size":5542287238,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:04227bec2a2b1657b9ea19eb240c8124b2a7c075&amp;dn=Poker+Movies+-+The+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"drcheney","files":7,"time":1241300417,"description":"This is a collection of various poker movies.  Rounders is the best movie out of this list, and Maverick is just a classic.  Yonkers Joe is pretty good.  Deal is horrible.  Yeah, anyway, some are good, some not so good.  The list includes the following:\n\nDEAL (2008)\nMaverick (1994)\nPt. 1 - Rounders (1998)\nPt. 2 - Rounders (1998)\nSmart Money (1931)\nThe Cincinnati Kid (1965)\nYonkers Joe (2008)\n\nEnjoy, bitches!\n\n\n\n\n\n\n\n\nDEAL (2008)\n\nDeal (2008 film)\nFrom Wikipedia, the free encyclopedia\nJump to: navigation, search\nDeal \n\nTheatrical release poster \nDirected by Gil Cates Jr \nProduced by Michael Arata\nSteve Austin\nAlbert J. Salzer \nWritten by Gil Cates Jr\nMark Weinstock \nStarring Bret Harrison\nBurt Reynolds\nCharles Durning\nVincent Van Patten\nMichael Sexton\nwith Jennifer Tilly\nand Shannon Elizabeth \nMusic by Peter Rafelson \nCinematography Tom Harting \nEditing by Jonathan Cates \nDistributed by MGM Pictures (USA)\nSeven Arts Pictures (non-USA) \nRelease date(s) 2008 \nRunning time 85 min \nCountry United States \nLanguage English \nDeal is a 2008 drama film starring film actor Burt Reynolds, with Bret Harrison, and Shannon Elizabeth. It tells the story of a former poker player (Reynolds) who tutors a younger player (Harrison). The film's climax is a fictional World Poker Tour championship.\n\nWorld Poker Tour commentators Mike Sexton, Vince Van Patten and Courtney Friel play themselves. A number of other professional poker players and poker-playing celebrities, including Phil Laak, Antonio Esfandiari, Greg Raymer, Chris Moneymaker and Isabelle Mercier are in the cast.\n\n\nMaverick (1994)\n\nMaverick (film)\nFrom Wikipedia, the free encyclopedia\nJump to: navigation, search\nMaverick \n \nDirected by Richard Donner \nProduced by Bruce Davey\nRichard Donner\nJim Van Wyck\nAlexander B. Collett (associate producer) \nWritten by Roy Huggins (television series &quot;Maverick&quot;)\nWilliam Goldman \nStarring Mel Gibson\nJodie Foster\nJames Garner\nGraham Greene\nAlfred Molina\nJames Coburn\nDub Taylor\nDan Hedaya\nPaul Smith\nGeoffrey Lewis \nMusic by Randy Newman \nCinematography Vilmos Zsigmond \nEditing by Stuart Baird\nMike Kelly \nDistributed by Warner Bros. \nRelease date(s) May 20, 1994 (USA) \nRunning time 127 min. \nCountry United States \nLanguage English \nGross revenue Worldwide:\n$183,031,272[1] \nPreceded by Maverick\nThe New Maverick\nYoung Maverick\nBret Maverick \nMaverick is an Academy Award-nominated 1994 Western comedy film based on the 1950s television series of the same name, created by Roy Huggins. The film was directed by Richard Donner from a screenplay by William Goldman and features Mel Gibson, Jodie Foster, and James Garner. The film was nominated for an Academy Award for Best Costume Design.\n\n\nRounders (1998)\n\nRounders (1998 film)\nFrom Wikipedia, the free encyclopedia\n  (Redirected from Rounders (film))\nJump to: navigation, search\nRounders \n\nRounders Movie Poster \nDirected by John Dahl \nProduced by Ted Demme\nJoel Stillerman \nWritten by David Levien\nBrian Koppelman \nStarring Matt Damon\nEdward Norton\nJohn Turturro\nFamke Janssen\nGretchen Mol\nwith John Malkovich\nand Martin Landau \nMusic by Christopher Young \nCinematography Jean-Yves Escoffier \nEditing by Scott Chestnut \nDistributed by Miramax Films \nRelease date(s) September 11, 1998 \nRunning time 121 minutes \nLanguage English\nFrench \nBudget $12,000,000 USD \nRounders is a 1998 film about the underground world of high-stakes poker. Directed by John Dahl and starring Matt Damon and Edward Norton, the movie follows two friends who need to quickly earn enough cash playing poker to pay off a huge debt. The term &quot;rounder&quot; refers to a person whose sole means of earning a living is by playing cards.\n\nThe movie opened to mixed reviews and made only a modest amount of money. However, with the growing popularity of Texas hold 'em and other poker games, Rounders has become a cult hit.\n\n\nSmart Money (1931)\n\nSmart Money (film)\nFrom Wikipedia, the free encyclopedia\nJump to: navigation, search\nSmart Money \n \nDirected by Alfred E. Green \nStarring Edward G. Robinson\nJames Cagney \nCinematography Robert Kurrie \nEditing by Jack Killifer \nRelease date(s) 1931 \nRunning time 81 min. \nCountry  United States \nLanguage English \nFor other uses, see: Smart Money (disambiguation).\n\nSmart Money is a 1931 film starring Edward G. Robinson and James Cagney, the only time Robinson and Cagney made a movie together, despite being the two leading gangster actors at Warner Brothers studios all through the 1930s. Smart Money was shot after Robinson's signature film Little Caesar had been released and while Cagney's breakthrough masterpiece The Public Enemy was also being filmed. The Public Enemy had not been released and so Smart Money is the only film in which Cagney played the kind of supporting role usually done by Humphrey Bogart later in the '30s. Robinson plays a barber who goes to the big city to become a gambler but finds himself rooked by a blonde and a gang of thugs, whereupon he vows to take revenge, with the help of his own henchman in the formidable form of Cagney. The movie was directed by Alfred E. Green.\n\nA gentle-spirited film, Smart Money features some intriguing Cagney sequences, particularly a pre-Code pantomime of cunnilingus. Critics noted how well Robinson and Cagney played off each other but this was their only screen pairing (some cinema aficionados refer to this dilemma as the &quot;Gene Autry-Roy Rogers effect&quot; or the &quot;John Wayne-Gary Cooper effect&quot; or the &quot;Cary Grant-any other commensurately important actor effect;&quot; it's rather like Wild West gunslingers reluctant to go up against each other).\n\nBoris Karloff, not yet the icon he would soon become following his performance in Frankenstein that same year, has a brief role early in this film.\n\nMargaret Livingston, who plays the District Attorney's girlfriend, had portrayed the &quot;Woman from the City&quot; in F. W. Murnau's 1927 masterpiece Sunrise.\n\n\nThe Cincinnati Kid (1965)\n\nThe Cincinnati Kid\nFrom Wikipedia, the free encyclopedia\nJump to: navigation, search\nThe Cincinnati Kid \n \nDirected by Norman Jewison \nProduced by Martin Ransohoff \nWritten by Richard Jessup (novel)\nRing Lardner Jr. and Terry Southern (screenplay) \nStarring Steve McQueen\nEdward G. Robinson\nAnn-Margret\nKarl Malden\nTuesday Weld\nJoan Blondell\nRip Torn\nJack Weston\nCab Calloway \nMusic by Lalo Schifrin \nCinematography Philip H. Lathrop \nEditing by Hal Ashby \nDistributed by Metro-Goldwyn-Mayer \nRelease date(s) October 15, 1965 \nRunning time 102 min. \nLanguage English \nThe Cincinnati Kid is a 1965 film. It tells the story of Eric &quot;The Kid&quot; Stoner, a young Depression-era poker player, as he seeks to establish his reputation as the best. This quest leads him to challenge Lancey &quot;The Man&quot; Howard, an older player widely considered to be the best, culminating in a climactic final poker hand between the two.\n\nThe script, adapted from Richard Jessup's novel, was written by Ring Lardner Jr. and Terry Southern; it was Lardner's first major studio work since his 1947 blacklisting as one of The Hollywood Ten.[1] The film was directed by Norman Jewison and stars Steve McQueen in the title role and Edward G. Robinson as Howard. Jewison, who replaced original director Sam Peckinpah shortly after filming began[1], describes The Cincinnati Kid as his &quot;ugly duckling&quot; film. He considers it the film that allowed him to transition from the lighter comedic films he had previously been making and take on more serious films and subjects.[2]\n\nThe film garnered mixed reviews from critics on its initial release; supporting actors Robinson and Joan Blondell earned award nominations for their performances.\n\n\nYonkers Joe (2008)\n\nYonkers Joe (2008)T-Meter Critics Top Critics RT Community My Critics My Friends DVD 57 % Tomatometer\n \nHow does the Tomatometer work \nReviews Counted: 21\n\nFresh: 12\nRotten:9\nAverage Rating: 5.4/10\nConsensus: A solid cast adds subtlety to this otherwise schmaltzy and sometimes awkward gambling-flick-cum-family-drama.\n\nRated: R [See Full Rating] for language including sexual references. \n\nRuntime: 1 hr 42 mins\n\nGenre: Dramas\nTheatrical Release:Jan 9, 2009 Limited\nSynopsis: Yonkers Joe is an exciting, high-stakes con film and moving family drama written and directed by Robert Celestino, and starring Academy Award-nominee Chazz Palminteri, Academy Award-winner... Yonkers Joe is an exciting, high-stakes con film and moving family drama written and directed by Robert Celestino, and starring Academy Award-nominee Chazz Palminteri, Academy Award-winner Christine Lahti, Tom Guiry (The Black Donnellys), Golden Globe-nominee Linus Roache, and Academy Award-nominee Michael Lerner. An ode to old time gamblers, now outdated in an age of powerful upscale casinos, Yonkers Joe tells the story of a dice hustler (Palminteri) whose determination to make one last grab for a big score in Vegas is complicated by the reappearance of his estranged, mentally challenged son into his life. --Ã‚Â© Magnolia Pictures [More] \n\nStarring: Chazz Palminteri, Christine Lahti, Tom Guiry, Linus Roache\n\nStarring: Chazz Palminteri, Christine Lahti, Tom Guiry, Linus Roache, Michael Lerner, Frank John Hughes, Roma Maffia, Michael Rispoli\n\nDirector: Robert Celestino\n\nDirector: Robert Celestino\nScreenwriter: Robert Celestino\nProducer: Trent Othick\nComposer: Chris Hajian\nStudio: Magnolia Pictures \n\n[See More Credits]\n","torrent":{"xt":"urn:btih:04227bec2a2b1657b9ea19eb240c8124b2a7c075","amp;dn":"Poker+Movies+-+The+Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"04227bec2a2b1657b9ea19eb240c8124b2a7c075","infoHashBuffer":{"type":"Buffer","data":[4,34,123,236,42,43,22,87,185,234,25,235,36,12,129,36,178,167,192,117]},"announce":[],"urlList":[]}}