{"title":"Viruses and Nanotechnology - M. Manchester, N.F. Steinmetz","uid":15506254,"size":21419213,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:045affeaaba34d62c07f0e0d405c997b7fef7256&amp;dn=Viruses+and+Nanotechnology+-+M.+Manchester%2C+N.F.+Steinmetz&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1470588904,"description":"Viruses and Nanotechnology - M. Manchester, N.F. Steinmetz (Springer, 2009).pdf\r\n\r\nNanotechnology is a collective term describing a broad range of relatively novel topics. Scale is the main unifying theme, with nanotechnology being concerned with matter on the nanometer scale. A quintessential tenet of nanotechnology is the precise self-assembly of nanometer-sized components into ordered devices. Nanotechnology seeks to mimic what nature has achieved, with precision at the nanometer level down to the atomic level. Nanobiotechnology, a division of nanotechnology, involves the exploitation of biomaterials, devices or methodologies in the nanoscale. In recent years a set of b- molecules has been studied and utilized. Virus particles are natural nanomaterials and have recently received attention for their tremendous potential in this field. The extensive study of viruses as pathogens has yielded detailed knowledge about their biological, genetic, and physical properties. Bacterial viruses (bacte- ophages), plant and animal eukaryotic viruses, and viruses of archaea have all been characterized in this manner. The knowledge of their replicative cycles allows manipulation and tailoring of particles, relying on the principles of self-assembly in infected hosts to build the base materials. The atomic resolution of the virion structure reveals ways in which to tailor particles for higher-order functions and assemblies","torrent":{"xt":"urn:btih:045affeaaba34d62c07f0e0d405c997b7fef7256","amp;dn":"Viruses+and+Nanotechnology+-+M.+Manchester%2C+N.F.+Steinmetz","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"045affeaaba34d62c07f0e0d405c997b7fef7256","infoHashBuffer":{"type":"Buffer","data":[4,90,255,234,171,163,77,98,192,127,14,13,64,92,153,123,127,239,114,86]},"announce":[],"urlList":[]}}