{"title":"Raptor - Call of the Shadows","uid":3409484,"size":12441600,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:045bdd8a19a786e67ab0a3ca5da41a22c22299d2&amp;dn=Raptor+-+Call+of+the+Shadows&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Addley","files":1,"time":1132028677,"description":"Raptor - Call of the Shadows\n-----------------------------\nThis is an old awesome Dos game, Works in any windows OS\n-----------------------------\n\nIt's the BEST IBM shooter yet! A fast paced slugfest, with a pulse-pounding sound track, and jaw-dropping VGA animation &amp; cinematics. In the future as a mercenary flying the super-tech Raptor, you'll be sent on interplanetary missions to knock off top competitors of MegaCorp. Battle against hordes of relentless enemies. Spend the bounty you receive from their demise to expand your devastating arsenal, which can be upgraded with 14 hard core weapons!\n\n&quot;Raptor has some of the hottest graphics ever seen in a shareware game, and blows away most commercial games, too! The graphics will amaze you and the sound will astound you. It's a super star!&quot; -- Interactive Entertainment \n\nRaptor sets the new standard for PC shooters. This game will do for shooters what Wolfenstein did for 3D games. Incredibly smooth VGA graphics and animation are only half the story. The heart-pounding music in Raptor will leave you breathless, especially if you have a high-end sound card like the Roland or Wave Blaster. (Raptor supports the Midi music format, which provides very high quality music for PC games.) All other major sound cards are also supported!\n\nThe addictive quality and replay value of this game is unreal. Discover secrets, find the bonuses, and battle the boss ships that appear at the end of EVERY WAVE! With each ship and ground target you destroy, you'll earn more cash to increase your ship's technology for the next wave. You'll be driven to kill and destroy--but then, it's in your blood.\n\nSTUNNING FEATURES\n\n- Ultra-detailed, smooth scrolling VGA graphics. \n- Up to 16 ship upgrades can be bought from Harold's Emporium between waves. \n- Explosive cinematics. \n- 27 killer levels, each with at least one unique boss ship to destroy. \n- Four insane skill levels--higher skill levels introduce new opponents! \n- Huge variety of graphics, locations, enemy ships, sound effects, etc. \n- Built-in context sensitive help, plus a self-running demo. \n- Killing for cash was never so much fun!","torrent":{"xt":"urn:btih:045bdd8a19a786e67ab0a3ca5da41a22c22299d2","amp;dn":"Raptor+-+Call+of+the+Shadows","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"045bdd8a19a786e67ab0a3ca5da41a22c22299d2","infoHashBuffer":{"type":"Buffer","data":[4,91,221,138,25,167,134,230,122,176,163,202,93,164,26,34,194,34,153,210]},"announce":[],"urlList":[]}}