{"title":"The Book of Ebenezer Le Page (2007, NYRB Classics)","uid":10691654,"size":539680,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:046f59c72df79b625228fde57d1206d801122b0b&amp;dn=The+Book+of+Ebenezer+Le+Page+%282007%2C+NYRB+Classics%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"nepalifiction","files":-1,"time":1407129204,"description":"Gerald Basil Edwards (1899-1976) was born in Vale Parish on the Channel Island of Guernsey and lived there until joining the Royal Guernsey Light Infantry in 1917. He attended Bristol University for several years, though he does not seem to have graduated. By the late 1920s Edwards was living in London, where he taught literature and drama at a number of institutions, including Toynbee Hall. He became acquainted with the writers J.S. Collis, Stephen Potter, and Middleton Murry, who recruited him to write for The Adelphi. All three considered Edwards a genius and expected him to become a new D.H. Lawrence. In 1928, Edwards was commissioned by Jonathan Cape to write a biography of Lawrence, with whom he briefly corresponded. Lawrence then died and the biography was never completed. Although he continued to write, Edwards published very little from that point on, eventually earning his living as a civil servant. He retired to Dorset, where in 1972 he met the art student Edward Chaney, who encouraged him to complete The Book of Ebenezer Le Page. Edwards bequeathed the typescript to his young friend, who eventually succeeded in having it published. It was hailed as a great novel in England and America and has since been published in French and Italian.\n\nThe Book of Ebenezer Le Page, cantankerous, opinionated, and charming, is one of the most compelling literary creations of the late twentieth century. Eighty years old, Ebenezer has lived his whole life on the Channel Island of Guernsey, a stony speck of a place caught between the coasts of England and France yet a world apart from either. Ebenezer himself is fiercely independent, but as he reaches the end of his life he is determined to tell his own story and the stories of those he has known. He writes of family secrets and feuds, unforgettable friendships and friendships betrayed, love glimpsed and lost. The Book of Ebenezer Le Page is a beautifully detailed chronicle of a life, but it is equally an oblique reckoning with the traumas of the twentieth century, as Ebenezer recalls both the men lost to the Great War and the German Occupation of Guernsey during World War II, and looks with despair at the encroachments of commerce and tourism on his beloved island.\n\n===================================================================================\n\nThe torrent contains following book:\n\n* G.B. Edwards - The Book of Ebenezer Le Page, Introduction by John Fowles (2007, NYRB Classics) -- ePUB\n\n===================================================================================\n\nRead the following articles, and SEED the torrent, and don't forget to give FEEDBACK!!!\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Gerald_Basil_Edwards&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Gerald_Basil_Edwards&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.nybooks.com/books/imprints/classics/the-book-of-ebenezer-le-page/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.nybooks.com/books/imprints/classics/the-book-of-ebenezer-le-page/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.nytimes.com/1981/04/19/books/a-novel-of-life-in-a-small-world.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.nytimes.com/1981/04/19/books/a-novel-of-life-in-a-small-world.html&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:046f59c72df79b625228fde57d1206d801122b0b","amp;dn":"The+Book+of+Ebenezer+Le+Page+%282007%2C+NYRB+Classics%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"046f59c72df79b625228fde57d1206d801122b0b","infoHashBuffer":{"type":"Buffer","data":[4,111,89,199,45,247,155,98,82,40,253,229,125,18,6,216,1,18,43,11]},"announce":[],"urlList":[]}}