{"title":"Materials Characterization Using Nondestructive Evaluation (NDE)","uid":15365194,"size":13436603,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:055be58186af02ed74a55772dae62d12b671d2e9&amp;dn=Materials+Characterization+Using+Nondestructive+Evaluation+%28NDE%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1469061442,"description":"Materials Characterization Using Nondestructive Evaluation (NDE) Methods - Gerhard Hubschen et al. (WP, 2016).pdf\r\n\r\nMaterials Characterization Using Nondestructive Evaluation (NDE) Methods discusses NDT methods and how they are highly desirable for both long-term monitoring and short-term assessment of materials, providing crucial early warning that the fatigue life of a material has elapsed, thus helping to prevent service failures.\r\n\r\nMaterials Characterization Using Nondestructive Evaluation (NDE) Methods gives an overview of established and new NDT techniques for the characterization of materials, with a focus on materials used in the automotive, aerospace, power plants, and infrastructure construction industries.\r\n\r\nEach chapter focuses on a different NDT technique and indicates the potential of the method by selected examples of applications. Methods covered include scanning and transmission electron microscopy, X-ray microtomography and diffraction, ultrasonic, electromagnetic, microwave, and hybrid techniques. The authors review both the determination of microstructure properties, including phase content and grain size, and the determination of mechanical properties, such as hardness, toughness, yield strength, texture, and residual stress.\r\n\r\n\r\n\r\nGives an overview of established and new NDT techniques, including scanning and transmission electron microscopy, X-ray microtomography and diffraction, ultrasonic, electromagnetic, microwave, and hybrid techniques\r\nReviews the determination of microstructural and mechanical properties\r\nFocuses on materials used in the automotive, aerospace, power plants, and infrastructure construction industries\r\nServes as a highly desirable resource for both long-term monitoring and short-term assessment of materials","torrent":{"xt":"urn:btih:055be58186af02ed74a55772dae62d12b671d2e9","amp;dn":"Materials+Characterization+Using+Nondestructive+Evaluation+%28NDE%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"055be58186af02ed74a55772dae62d12b671d2e9","infoHashBuffer":{"type":"Buffer","data":[5,91,229,129,134,175,2,237,116,165,87,114,218,230,45,18,182,113,210,233]},"announce":[],"urlList":[]}}