{"title":"The Concise Book of Muscles 2nd ed. - epub","uid":9983311,"size":45873864,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0597b4a55b39eb6f0bec76ef71c537ae5294464a&amp;dn=The+Concise+Book+of+Muscles+2nd+ed.+-+epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Thot_htp","files":-1,"time":1397760373,"description":"A clear, simple guide for students of anatomy as well as an excellent resource for athletes, massage therapists, and anyone interested in the workings of the human body, this user-friendly book is organized around six muscle groups. They include muscles of the face head, and neck; the trunk; the shoulder and upper arm; the forearm and hand; the hip and thigh; and the leg and foot. Each of the groups is given a distinctive color to make it easy to identify, and each muscle is shown in its relationship to the skeleton. Each gets a complete profile, including origin/insertion, action of the muscle, which nerve controls it, movements that use it, and exercises and stretches that strengthen it. The Concise Book of Muscles shows students exactly how to locate and identify specific muscles, highlighting those that are heavily used and therefore subject to injury in a variety of sports and activities. This expanded edition of a leading anatomy reference book includes 20 muscles not previously covered, adding greater depth to the original edition while remaining accessible and affordable.","torrent":{"xt":"urn:btih:0597b4a55b39eb6f0bec76ef71c537ae5294464a","amp;dn":"The+Concise+Book+of+Muscles+2nd+ed.+-+epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0597b4a55b39eb6f0bec76ef71c537ae5294464a","infoHashBuffer":{"type":"Buffer","data":[5,151,180,165,91,57,235,111,11,236,118,239,113,197,55,174,82,148,70,74]},"announce":[],"urlList":[]}}