{"title":"Orang-Utan - Orang-Utan (1971/2005) [FLAC]","uid":6460743,"size":285734522,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:05bfc640e2d99e477f3737571a99099015487286&amp;dn=Orang-Utan+-+Orang-Utan+%281971%2F2005%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zibbik","files":17,"time":1307753405,"description":"\nBand: Orang-utan\nAlbum: Orang-utan\nYear: 1971/2005\nCountry: UK\nGenre: Heavy/Hard Psychedelic\n\nTrack list:\n\n01. I Can See Inside Your Head\n02. Slipping Away\n03. Love Queen\n04. Chocolate Piano\n05. If You Leave\n06. Fly Me High\n07. Country Hike\n08. Magic Playground\n\nOrang-Utan:\n*Jeff Seopardie - drums\n*Paul Roberts - bass guitar\n*Sid Fairman - guitar\n*Mick Clarke - guitar\n*Terry &quot;Nobby&quot; Clark - vocals\n\n\nThe group Orang-Utan consisted of an amalgamation of talent.\n\nThe best musicians from several other notable dissolving bands, that had been playing in the North of London in the late 60s, were to be the contributors in combination.\nThe story behind this group is just as interesting as the music they played itself. This group of musicians recorded their album's worth of material at what was then a 16 track &quot;state of the art&quot; studio facility in London.\nFor somewhat unique and intriguing starters, this British band's only s/t album was released on the US Bell Records label in 1970.\nThe odd thing about the whole thing being that until the group found out quite by accident, they had zero knowledge of their own release! Adrian Miller was the person that claimed the producer's title on the Bell album release in the United States.\nUnfortunately, he was also the person responsible for stealing this material from the musicians and getting it released without the group's consent or knowledge.\nAdrian even secretly convinced the group's unsuspecting manager at the time, to suggest to the band to change their name to Orang-Utan.\nAt the time the band were still going by their original name &quot;Hunter&quot; which they had taken from the famous Albert King song. It's a real shame that it all went down this way in the history books because this group really showed promise.\nHad they been managed with any real degree of integrity &amp; professionalism, they quite possibly would have went on to do bigger &amp; better things as a group.\nThe music itself consists of well played and diversely crafted heavy guitar oriented rock. It is not of a Psychedelic nature, or Acid Rock based as some have claimed.\nThere was only one member that even smoked hash regularly. Several of the songs are nothing short of brilliant and serve to show what incredible talent these young 19-20 year old musicians possessed.\nMost all of the music was written and composed by Jeff Seopardie who was the drummer, with the majority of the guitar &amp; bass riffs being developed and played by Mick Clarke &amp; Paul Roberts respectively.\nThere actually was a second guitarist that played on the album, but unfortunately he was sacked for personal reasons right after the material was recorded.\nTherefore with so little actual band member involvement within the album's US release, he was lost to obscurity and never credited. Although, I do know his first name to have been Sid.\nAnother large added benefit to the group's impressive efforts are the powerful and well suited vocals.\nFor having such a seriously strong singing voice with excellent pitch, the vocalist Nobby Clark (NOT to be confused with the vocalist from the Bay City Rollers with the same name!) only had one lung! It certainly didn't stop him belting out his excellent &amp; energetic voice like the best of the other vocalists that he was in league with at the time.\nNobby was actually the second vocalist for the band &amp; demos do indeed exist from the band line up that proceeded him.\nI have to comment on this remarkable group and their case history in retrospect: It's pretty damn sad that after having paid for the then &quot;State of The Art&quot; recorded studio time that went into making up their excellent early Heavy Rock album, with zero credit whatsoever at the time and now having several subsequent CD reissues since, that these same actual band members of which som\n\n","torrent":{"xt":"urn:btih:05bfc640e2d99e477f3737571a99099015487286","amp;dn":"Orang-Utan+-+Orang-Utan+%281971%2F2005%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05bfc640e2d99e477f3737571a99099015487286","infoHashBuffer":{"type":"Buffer","data":[5,191,198,64,226,217,158,71,127,55,55,87,26,153,9,144,21,72,114,134]},"announce":[],"urlList":[]}}