{"title":"[SoM]Prime[DvdRip-Divx-Ita-PCM]","uid":4897357,"size":1756588032,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:06e77131262269c7543972b01ec9bdba4d2783ad&amp;dn=%5BSoM%5DPrime%5BDvdRip-Divx-Ita-PCM%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mitimex","files":1,"time":1242417861,"description":"\nAmbientata nello sfondo molto colorato e movimentato della moderna Manhattan di oggi, Prime ÃƒÂ¨ una commedia romantica e spiritosa sulle prove e tribolazioni di due amanti scombinati. Uma Thurman che interpreta Rafi, una produttrice fotografica trentasettenne ferita da un recente divorzio, incontra David, un pittore di ventitre anni appena uscito dal college. Prime ci mostra cosa succede, quando l'amore a prima vista si scontra con le realtÃƒÂ  giornaliere di una relazione adulta. Meryl Streep interpreta il ruolo della terapista di Rafi, la Dottoressa Lisa Metzger. Lisa, sta lavorando per aiutare Rafi a superare le paure del suo intimo e scopre che il nuovo amante di Rafi ÃƒÂ¨, sfortunatamente per lei, il suo unico figlio, David. David e Rafi hanno a loro discapito una differenza d'etÃƒÂ  di 14 anni, differenti esperienze di vita e le aspettative della mamma tradizionalista di David. Con uno sguardo molto franco nei riguardi dell' amore moderno e metropolitano, questo film candidamente e con molto humour esplora la gioia di innamorarsi follemente di qualcuno ed i problemi che inevitabilmente ne seguono. \n","torrent":{"xt":"urn:btih:06e77131262269c7543972b01ec9bdba4d2783ad","amp;dn":"%5BSoM%5DPrime%5BDvdRip-Divx-Ita-PCM%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"06e77131262269c7543972b01ec9bdba4d2783ad","infoHashBuffer":{"type":"Buffer","data":[6,231,113,49,38,34,105,199,84,57,114,176,30,201,189,186,77,39,131,173]},"announce":[],"urlList":[]}}