{"title":"The Pretenders - Kid [promo].VOB","uid":9758797,"size":203776000,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:06edc37c46c6f8efde987f5ab33b5132eb13b6ee&amp;dn=The+Pretenders+-+Kid+%5Bpromo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1394780735,"description":"The Pretenders - Kid [promo].VOB\n\n\nVery HQ rare promo music video from a promo DVD. &quot;Kid&quot; is a song from  Pretenders, the debut studio album by the British-American new wave band The Pretenders, released on 27 December 1979 under Real Records (Sire Records in the United States). A combination of rock, punk, and pop music, this album made the band famous. The album features the singles &quot;Stop Your Sobbing&quot; &quot;Kid&quot; and &quot;Brass in Pocket&quot;.\n\nNick Lowe produced the Pretenders' first single, &quot;Stop Your Sobbing&quot;, but decided not to work with them again as he thought the band &quot;wasn't going anywhere&quot;. Chris Thomas took over on the subsequent recording sessions.\n\nPretenders debuted at number 1 on the UK Albums Chart in the week of its release and stayed there for four consecutive weeks. It also made the top 10 on the Billboard 200 and was certified Platinum during 1982 by the RIAA. Pretenders has been named one of the best albums of all time by VH1 (#52). In 2003, Rolling Stone magazine ranked the album number 155 on its list of the 500 greatest albums of all time, and, in 1989, ranked it the 20th best album of 1980s. The track &quot;Private Life&quot; was covered that same year by Grace Jones, on her album Warm Leatherette. In 2012, Slant Magazine listed the album at #64 on its list, &quot;Best Albums of the 1980s&quot;.\n\nThe band's first single, a cover of The Kinks song &quot;Stop Your Sobbing&quot; (produced by Nick Lowe and recorded at the July Regents Park sessions) was released in January 1979 and gained critical attention. It was followed in June with &quot;Kid,&quot; and then in January 1980 the band got to No. 1 in the UK with &quot;Brass in Pocket,&quot; which was also successful in the US, reaching No. 14 on the Billboard Hot 100.\n\nThe Pretenders are an English-American rock band formed in Hereford, England, in March 1978. The original band comprised initiator and main songwriter Chrissie Hynde (lead vocals, rhythm guitar), James Honeyman-Scott (lead guitar, backing vocals, keyboards), Pete Farndon (bass guitar, backing vocals), and Martin Chambers (drums, backing vocals, percussion). Following the drug-related deaths of Honeyman-Scott and Farndon, the band has experienced numerous subsequent personnel changes, with Hynde as the only consistent member, and Chambers returning after an absence of several years.\n(video does not have any logos)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Pretenders_(album)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Pretenders_(album)&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/faLfLAafK&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/faLfLAafK&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic:     \n   Video: MPEG2 Video 720x576 (4:3) 25fps 7000kbps\n   Audio: LPCM 48000Hz stereo 1536kbps [DVD, 16 bit]\n   Duration: 00:03:11\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.7.3\n\n*Media Player Classic Home Cinema*         &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\nSgtRlee (Sgt.R.Lee) \n\t","torrent":{"xt":"urn:btih:06edc37c46c6f8efde987f5ab33b5132eb13b6ee","amp;dn":"The+Pretenders+-+Kid+%5Bpromo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"06edc37c46c6f8efde987f5ab33b5132eb13b6ee","infoHashBuffer":{"type":"Buffer","data":[6,237,195,124,70,198,248,239,222,152,127,90,179,59,81,50,235,19,182,238]},"announce":[],"urlList":[]}}