{"title":"Sexually Broken--Skin Diamond turned into a mouth pussy Matt Wil","uid":9190473,"size":1015702322,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:0881b4168046098b46b61a05b545ee0502319828&amp;dn=Sexually+Broken--Skin+Diamond+turned+into+a+mouth+pussy+Matt+Wil&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"merzedes","files":-1,"time":1384378357,"description":"Sexual Superstar Skin Diamond turned into a mouth pussy, metal bondage and epic BJs! | Skin Diamond | Matt Williams\n\nNovember 13, 2013\n\n\nMP4 only.\n\n\nSkin is a multiple nominated performer, and with very good reason. She is a sexual athlete at the top of her game. Most girls as pretty as she is don't bothering challenging themselves and simply coast by on their looks-pillow princesses that don't want their makeup smudged. Not Skin. She wants to be completely destroyed and broken down. We aim to oblige here at Sexuallybroken. Broken down is exactly what she is going to get.\n\nShackled down in a kneeling position and her arms firmly bound behind her in unforgiving metal restraints with a ring gag lodged in her well-used mouthhole, Skin is ready for use. We walk right up and slide home. The ring gag prevents her from closing her jaws, it is the perfect tool for training. She is wearing too much clothing for our taste however, and as 10 inches of BBC reshape her throat, we cut off that pesky dress.\n\nOnce she is naked and already starting her spiral into subspace, we run a train on her throat. One cock and then another steps up to own her meat. While the dick is controlling her airflow, a vibrator rips multiple orgasms out of her exposed pussy. Just to really drive the point home, nipple clamps are applied and bolted to the floor. The arms pull her one way, the nipples pull her another, and all the while the cock keeps drilling.\n\nOnce we have her completely destroyed, a wrecked shell of the perky porn star that had bounced onto our stage this morning, we simply walk away. We have had our fill. She languishes there, her pink tongue out and panting, waiting to see if we want anymore. What a well-trained pet. \n\nScreens &lt;a href=&quot;\nhttp://sexuallybroken.com/sexual/bondage/2013/11_13sdiamond4/SexuallyBroken-Skin-Diamond-Matt-Williams-Sexual-Superstar-Skin-Diamond-turned-into-a-mouth-pussy-metal-bondage-and-epic-BJs.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://sexuallybroken.com/sexual/bondage/2013/11_13sdiamond4/SexuallyBroken-Skin-Diamond-Matt-Williams-Sexual-Superstar-Skin-Diamond-turned-into-a-mouth-pussy-metal-bondage-and-epic-BJs.php&lt;/a&gt;\n\n12 000 uploads and counting, 13k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n\n","torrent":{"xt":"urn:btih:0881b4168046098b46b61a05b545ee0502319828","amp;dn":"Sexually+Broken--Skin+Diamond+turned+into+a+mouth+pussy+Matt+Wil","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0881b4168046098b46b61a05b545ee0502319828","infoHashBuffer":{"type":"Buffer","data":[8,129,180,22,128,70,9,139,70,182,26,5,181,69,238,5,2,49,152,40]},"announce":[],"urlList":[]}}