{"title":"Appleseed - English Version","uid":4436805,"size":730505216,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:09857526e3c07a4fbfeb72c7d3b4321bc6bf6d29&amp;dn=Appleseed+-+English+Version&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"starfyre98204","files":1,"time":1223598198,"description":"This is the English version of the film in .avi format and is really clean. \n\nPLOT QUICKY:\n====================================================================================\nSet in 2131 AD, Appleseed stars Deunan Knute, a young, legendary female soldier and a survivor of the Third World War, which brought Earth to the brink of destruction. While fighting a number of unknown figures, a platoon of tall, white-armoured soldiers comes up and shoots them. As she tries to run away, they tranquilize her. Deunan later wakes up attached to a scanning device. Alarmed, she breaks free and takes a woman hostage while she attempts to escape, only to be stopped by the voice of her former lover and comrade Briareos, who is now a cyborg. Deunan soon learns that the war had ended months before while she continued fighting unknowing of this, and she is now in a Utopian city called Olympus. Its population is half human and half clone, a genetically-engineered species called Bioroids made from the best technical components. Olympus is governed by three factions: Prime Minister Athena (whom Deunan seems to know), General Edward Uranus III, head of the Olympus Regular Army; and the Council of Elders -- seven old men hooked up to life support and anti-gravity chairs. Yet everything in the city is observed by an artificial intelligence named Gaia, which resides in a building called Tartarus. Here, Deunan integrates into the prestigious ESWAT organization to serve as the city&amp;#039;s guardian and befriends a Second Generation Bioroid named Hitomi.\n====================================================================================\n","torrent":{"xt":"urn:btih:09857526e3c07a4fbfeb72c7d3b4321bc6bf6d29","amp;dn":"Appleseed+-+English+Version","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"09857526e3c07a4fbfeb72c7d3b4321bc6bf6d29","infoHashBuffer":{"type":"Buffer","data":[9,133,117,38,227,192,122,79,191,235,114,199,211,180,50,27,198,191,109,41]},"announce":[],"urlList":[]}}