{"title":"James Mann - The Obamians (ePub/mobi) [2012]","uid":7655501,"size":2926189,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0a7bfc6c4b2925c9f543c7a500d3b6bc813c1e1e&amp;dn=James+Mann+-+The+Obamians+%28ePub%2Fmobi%29+%5B2012%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xemius","files":-1,"time":1348141734,"description":"Source: mobilism\n\nSummary\nPublication Date: June 14, 2012\nThe definitive analysis of the events, ideas, personalities, and conflicts that have defined Obama's foreign policy.\nWhen Barack Obama took office, he brought with him a new group of foreign policy advisors intent on carving out a new global role for America in the wake of the Bush administration's war in Iraq. Now the acclaimed author of Rise of the Vulcans offers a definitive, evenhanded account of the messier realities they've faced in implementing their policies.\nIn The Obamians, acclaimed author James Mann tells the compelling story of the administration's struggle to enact a coherent and effective set of policies in a time of global turmoil. At the heart of this struggle are the generational conflicts between the Democratic establishment -- including Robert Gates, Hillary Clinton, and Joseph Biden -- and Obama and his inner circle of largely unknown, remarkably youthful advisors, who came of age after the Cold War had ended.\nWritten by a proven master at elucidating political underpinnings, even to the politicians themselves, The Obamians is a pivotal reckoning of this historic president and his inner circle and of how their policies may or may not continue to shape America and the world.\n\nFormats provided are:\n.ePub -\nCompatible with most eReaders including the Apple iPad. If you wish to read .ePub doucuments on a Mac/PC I would recommend downloading Adobe Digital Editions. (Just google it and follow the instructions on the Adobe website.)\n.mobi -\nFor the Amazon kindle. Kindle for PC may also be available depending on your region.\n\nIf you like the book, support the author and buy it!","torrent":{"xt":"urn:btih:0a7bfc6c4b2925c9f543c7a500d3b6bc813c1e1e","amp;dn":"James+Mann+-+The+Obamians+%28ePub%2Fmobi%29+%5B2012%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a7bfc6c4b2925c9f543c7a500d3b6bc813c1e1e","infoHashBuffer":{"type":"Buffer","data":[10,123,252,108,75,41,37,201,245,67,199,165,0,211,182,188,129,60,30,30]},"announce":[],"urlList":[]}}