{"title":"Kim Newman - Cry Babies (BBC)","uid":6573893,"size":41857031,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:0adc737109e21056432db642434c7f72cc3c9ef4&amp;dn=Kim+Newman+-+Cry+Babies+%28BBC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"fakeplastictrousers2","files":2,"time":1312103612,"description":"Cry Babies\n\nFrom BBC Radio 4. Written by Kim Newman; Full-cast dramatisation.\n\nBarty and Angela Flitcroft are having a baby, by the popular method of delayed obligation parenthood, based on the science of cryo-genesis which everyone thought would be used for freezing sick old rich people until cures for their ills were developed, but instead it is being used by busy, professional couples who no longer have to put off having children. These couples can conceive their child and leave the Polish surrogate mother to take over and carry them to term. Then, they put the new-borns on ice until they're ready to make space in their lives to become parents!\n\nIn Kim Newman's science-fiction afternoon play 'Cry Babies', we follow the life of one of these cryo-children, Joy Flitcroft, and experience what it is like to be revived and then forced back into stasis every few years. As Joy ages at a much reduced rate while in the cryo-machine, she is also educated by the voice of the SleepLearn programme. This advanced education, coupled with the slow growth rate, marks Joy, and her fellow 'cry-babies' out from the 'normal' children, and they experience cultural bias, bullying and different laws, all while coping with the sudden 'jumps' from one period of freedom to the next.\n\nCry Babies' is a science fiction satire, extrapolating from current trends in medical science and society in general to look at the way family ties may change in the future. The structure, scenes set years apart, allows us to have a sweeping view of future history, and make observations about the way current obsessions might alter. But at heart it's a story about irresponsible, self-absorbed parents and a child who suffers from an economically privileged but emotionally sterile upbringing.\n\nCast:\nDr Rossiter ..... Alex Jennings\nAngela Flitcroft ..... Natasha Little\nBarty Flitcroft ..... Rupert Degas\nSleepLearn Machine ..... Sarah Douglas\nJoy ..... Sia Alexander\nRoger ..... Colin Morgan\nJeff ..... Sam Alexander\nAruna ..... Emma Darwall-Smith\nDaisy ..... Kirsty Stuart\nAri ..... Rob Kendrick\nMarketa/Girl ..... Emma Handy\n\nMusic Composed by Jeremy Paul Carroll\nExecutive Produced by Dirk Maggs\n\nProducer/Director: Neil Gardner\nA Ladbroke production for BBC Radio 4.","torrent":{"xt":"urn:btih:0adc737109e21056432db642434c7f72cc3c9ef4","amp;dn":"Kim+Newman+-+Cry+Babies+%28BBC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0adc737109e21056432db642434c7f72cc3c9ef4","infoHashBuffer":{"type":"Buffer","data":[10,220,115,113,9,226,16,86,67,45,182,66,67,76,127,114,204,60,158,244]},"announce":[],"urlList":[]}}