{"title":"Flower And Snake 2 (Hana to hebi 2)","uid":3778123,"size":733992448,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0e15fdc5d7493a1ed315617cba136e70556cea12&amp;dn=Flower+And+Snake+2+%28Hana+to+hebi+2%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Fa_Lao","files":1,"time":1187530566,"description":"Aya Sugimoto is one of the most courageous and interesting actresses in the world today, a female volcano of carnality and rebellion. In FLOWER AND SNAKE 2 - Paris/SHIZOKU, a sequel that lacks the original's sexual anarchy, she returns to the role that elevated her star two years ago by playing the wife of a wealthy art critic who subjects herself to various forms of masochism for the sake of her partner. Naturally, she begins to &quot;enjoy&quot; her treatment at the hands of sadistic men and, therefore, gets to express her &quot;true nature&quot;. Takahi Ishii's sequel, which is set in Paris, rehashes some of the original, but also navigates new avenues. Produced and distributed by Toei, one of Japan's leading film studios, this series is extraordinary for its audacious approach to subject matter no studio in any other country in the world would touch. This installment echoes some of Wakamatsu's best work, and even recalls aspects of the French New Wave. The S &amp; M scenarios, though quite explicit and cruel (relatively speaking), are beautifully shot and highly erotic. There is an exciting thread of incest here, in addition to mild golden games, bondage and suspension, and gorgeously photographed and staged &quot;rape&quot;. Kenichi Endo, who appeared as a different character in the original, acquits himself well as Sugimoto's abuser, an artist whose genius she is sent to determine. The original, which was Ishii's version of what &quot;Eyes Wide Shut&quot; should have been, is a stronger pic, recreating for me the vibe of 80's Nikkatsu shockers such as &quot;Captured For Sex&quot;. This follow-up, which boasts a sensational and appropriate climax, has a few slow moments, but it is still a deliciously transgressive piece of dark art.\n(imdb)\n\ninfo:\n699.99 MiB\n1:52:44\n640 x 368\nDivX 6.6.1\nLame MP3 3.97 128 kb/s 41 KHz 16 Bits Q5\njapanese audio\nchinese traditional hardsubs (learn foreign languages or translate it yourself, i don't have time)","torrent":{"xt":"urn:btih:0e15fdc5d7493a1ed315617cba136e70556cea12","amp;dn":"Flower+And+Snake+2+%28Hana+to+hebi+2%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e15fdc5d7493a1ed315617cba136e70556cea12","infoHashBuffer":{"type":"Buffer","data":[14,21,253,197,215,73,58,30,211,21,97,124,186,19,110,112,85,108,234,18]},"announce":[],"urlList":[]}}