{"title":"The Dionysiac World View - Friedrich Nietzsche.rar","uid":6497095,"size":55433,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0e1c2621c77705066d8dd089035d399a42055f2d&amp;dn=The+Dionysiac+World+View+-+Friedrich+Nietzsche.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"floyd151","files":1,"time":1309112603,"description":"The Dionysiac World View - 1870\n\nThe Dionysiac World View is one of Nietzsche's earliest works. Nietzsche is always difficult, and there is no question that Nietzsche's pursuit of a proper audience deliberately excludes readers in broad strokes. The Dionysiac World View requires no less literary background than Homer, Sophocles, Plato, and Ovid. It is heavily influenced, or perhaps almost wholly derived, from both Wagner, whom Nietzsche admired highly at least for the time being, and Schopenhauer, from whom Nietzsche starts his transformation of &quot;the Will&quot; as the force which founds the human tragedy. The Dionysiac World View runs concurrent to the larger work, The Birth of Tragedy, and likely was the precursor to most of its themes. Ostensibly, The Dionysiac World View is merely a treatise on the Hellenistic Period in Ancient Greece as the highest point in human culture. This is Nietzsche's investigation of Hellenistic artistry in the terms of two forces that he attributes to Apollo and Dionysus. However, this examination of art, music, and literature is nothing less than Nietzsche's early outlook on the state of humanity and its proper function. This is Nietzsche's founding attempt at themes he would later revisit from countless persona in creating a fundamental insight into his pursuit for the salvation of humanity in the face of Socrates, reason, asceticism, Christianity, morality, science, and finally nihilism. Here Nietzsche discovers them through an examination of the goals of art and an inversion of his contemporaries' scholastic outlook on Ancient Greece. \n\nfrom: http://www.firenewt.net/dracul/philosophy/nietzschelit.html","torrent":{"xt":"urn:btih:0e1c2621c77705066d8dd089035d399a42055f2d","amp;dn":"The+Dionysiac+World+View+-+Friedrich+Nietzsche.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e1c2621c77705066d8dd089035d399a42055f2d","infoHashBuffer":{"type":"Buffer","data":[14,28,38,33,199,119,5,6,109,141,208,137,3,93,57,154,66,5,95,45]},"announce":[],"urlList":[]}}