{"title":"[PS2] Ratchet: Deadlocked","uid":11075658,"size":4356898816,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:0ec6cb1edd99c23af24d39af911461a078bb58ff&amp;dn=%5BPS2%5D+Ratchet%3A+Deadlocked&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mas6545","files":1,"time":1411330733,"description":"[Wikipedia] Following the events of Ratchet &amp; Clank: Up Your Arsenal, Ratchet, Clank and Al have been given the job of running the Starship Phoenix. After the crew are informed that many heroes have disappeared,[4] robots overrun the Phoenix, taking Ratchet, Clank, and Al captive.\n\nThey are transported to the Shadow Sector, a lawless region of the Solana Galaxy. Ratchet meets Gleeman Vox, the creator of Dreadzone, a barbaric game show in which contestants try to kill each other. Ratchet is being forced to compete in Dreadzone,[5] and is now wearing a &quot;DeadLock&quot; collar which will explode if he becomes uncooperative or boring.[6] Collectively referred to as &quot;Team DarkStar&quot;, Ratchet and crew must fight for their lives. Al serves as the mechanic for Ratchet's new combat bots, Merc and Green, while Clank serves as his &quot;Mission Engineer&quot;.[7] Ratchet and the combat bots (or a second player) compete across a series of battle courses and tournaments on different planets, clearing challenge after challenge, while Ratchet becomes Dreadzone's most popular contestant.\n\nRatchet gains victories against the Dreadzone Exterminators, a group of contestants who serve as bosses. Eventually, Gleeman Vox offers to make Ratchet the head of the Exterminators.[8] Ratchet, disgusted by Dreadzone, flatly refuses the offer.[9] Enraged, Vox orders that Ratchet be sent to the &quot;Gauntlet of Doom&quot;, a course thought to be unbeatable.[10] After Ratchet successfully completes the Gauntlet of Doom, he returns to his DreadZone containment area, where Clank has found a way to shut down the containment fields holding the other heroes prisoner. Ratchet travels to Dreadzone Station's control level to destroy the central computer.\n\nUpon his arrival at the control level, Ratchet discovers that Vox has wired the station to explode, and if Ratchet cannot deactivate the explosives, everyone there will die, including the fans. Running a massive gauntlet of enemies and destroying three power generators, Ratchet deactivates the containment fields and unlocks the station's escape shuttles. Ratchet's final battle with Vox follows. After his defeat, Vox reactivates the self-destruct sequence via remote control, planning to kill both himself and Ratchet to gain &quot;the best ratings I've ever had!&quot;[11]\n\nThe last shuttle, however, piloted by Al, swoops in to rescue Ratchet. Ratchet leaps aboard with Merc, Green, and Vox's pet, where Clank removes his DeadLock collar. Dreadzone Station explodes soon afterwards, blowing Vox apart and leaving his robotic arm the only thing left of him. After the credits, Doctor Nefarious and Lawrence make a cameo appearance, still trapped on the asteroid. Nefarious states that they were supposed to be coming in range of a space station, to which Lawrence retorts he had no idea it was going to explode. Nefarious gets angry and short-circuits, and we hear a clip from Lance and Janice as the game ends.","torrent":{"xt":"urn:btih:0ec6cb1edd99c23af24d39af911461a078bb58ff","amp;dn":"%5BPS2%5D+Ratchet%3A+Deadlocked","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ec6cb1edd99c23af24d39af911461a078bb58ff","infoHashBuffer":{"type":"Buffer","data":[14,198,203,30,221,153,194,58,242,77,57,175,145,20,97,160,120,187,88,255]},"announce":[],"urlList":[]}}