{"title":"MAFiA.2.2010.REGION.FREE.XBOX360 ","uid":5794887,"size":7838700279,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:0ed4dccd644358c36acacc51e536d73afbbca92d&amp;dn=MAFiA.2.2010.REGION.FREE.XBOX360+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Morck22","files":3,"time":1283001952,"description":"Region Free! Multi 7 EspaÃƒÂ±ol incluido Textos y voces Confirmado\n\n\n\n\nVito, hijo de un inmigrante pobre, es un italoamericano abatido que intenta escapar de la vida de pobreza que consumiÃƒÂ³ su infancia. Fue en las calles donde Vito aprendiÃƒÂ³ que unirse a la mafia es el ÃƒÂºnico camino hacia la riqueza y el respeto de la gente de su categorÃƒÂ­a. SueÃƒÂ±a con convertirse en miembro de la mafia para huir de la dura vida que le tocÃƒÂ³ vivir a su padre. Vito, criminal de poca monta toda su vida, y Joe, su amigo de la infancia, se adentrarÃƒÂ¡n en el mundo del crimen organizado. Juntos trabajarÃƒÂ¡n para demostrar que son dignos de la mafia, mientras intentan labrarse una reputaciÃƒÂ³n en las calles. Desde trabajos de poca importancia, como atracos y robos de coches, Vito y Joe ascienden rÃƒÂ¡pidamente en el escalafÃƒÂ³n de la mafia? pero la vida en familia no es tan glamorosa como parece.\n\nCaracterÃƒÂ­sticas:\nExperiencia de gÃƒÂ¡ngsteres inmersiva : mediante una caracterizaciÃƒÂ³n intensa y autÃƒÂ©ntica, una narraciÃƒÂ³n atractiva y una presentaciÃƒÂ³n impactante, la historia adulta harÃƒÂ¡ que los jugadores comprendan el gancho de la mafia y la imposibilidad de escapar de ella.\nJuego lleno de acciÃƒÂ³n: participa en persecuciones automovilÃƒÂ­sticas de infarto, en viscerales peleas cuerpo a cuerpo y en intensos tiroteos que, en conjunto, ofrecen una experiencia de juego elaborada y fascinante.\nIllusion Engine: el motor Illusion Engine, creado por 2k Czech, permite a los jugadores explorar los 26 Km. cuadrados de Empire Bay y pasar perfectamente de preciosos exteriores a interiores diseÃƒÂ±ados minuciosamente, sin necesidad de tiempos de carga.\nRetrato autÃƒÂ©ntico de los Estados Unidos de mediados del siglo XX: disfruta de una historia ÃƒÂ©pica que abarca dos dÃƒÂ©cadas y en la que la ropa, los coches y los anuncios han sido creados meticulosamente para reproducir el aspecto de una ciudad estadounidense en las dÃƒÂ©cadas de 1940-50. Al avanzar en el tiempo, la ciudad y sus elementos cambiarÃƒÂ¡n para reflejar el paso del tiempo.\nBanda sonora acorde a la ÃƒÂ©poca: los jugadores se verÃƒÂ¡n inmersos en la ÃƒÂ©poca dorada de los Estados Unidos ya que Mafia II cuenta con canciones de los artistas mÃƒÂ¡s famosos de aquel momento.","torrent":{"xt":"urn:btih:0ed4dccd644358c36acacc51e536d73afbbca92d","amp;dn":"MAFiA.2.2010.REGION.FREE.XBOX360+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ed4dccd644358c36acacc51e536d73afbbca92d","infoHashBuffer":{"type":"Buffer","data":[14,212,220,205,100,67,88,195,106,202,204,81,229,54,215,58,251,188,169,45]},"announce":[],"urlList":[]}}