{"title":"Merchants_of_Magic_Evolution_of_the_Atlantean_Meme_By_The_Sane_T","uid":7194955,"size":2245248,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1033d3f0ee342577bae9339f8ffdcbbb8e43dd72&amp;dn=Merchants_of_Magic_Evolution_of_the_Atlantean_Meme_By_The_Sane_T&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":null,"files":-1,"time":1334757154,"description":"Follow the clues left behind by the Atlanteans in language, culture, religion, archaeological sites, science, the arts, mysticism, and current day politics. What we find together may shock and amaze you. \n\n0. Social structure of prehistoric tribal man\nI. Technological advances of the Gravettian Culture\nII. Ecclectic trends and technological synergy during Ice Age demic compression in the Anatolian refuge zone\nIII. Genesis of the Dragon Cult\nIV. Gobekli Tepe and Tyrhe: Standing Stones and High Priests of Eden\nV. Minos and the Labrys Culture\nVI. The Turian Expansion in the Mediterranean\nVII. Outpost Morocco: Uranus, the Az-Tula, the Garden of the Hesperides and the Pillars of Herakles\nVIII. Astronomy and the first transoceanic voyages of the Turians\nIX. Xibalba in South America: Sechin Bajo, Caral, and Az-Tulan\nX. Missions of magic: culture creation and mercantile expansion in the old world fertile valleys\nXI. Colonial schisms in the east mediterranean and Harappa\nXII. Turian hegemony in decline: Ramses III, the Sea Peoples, and the Athenian defeat of Troy\nXIII. Natural disaster as a political decline allegory\nXIV. Turian Tektons: Tul-Tecas and the Turian colonization of North America\nXV. Atlantean cults in the Old World take a life of their own\nXVI. Neo-Atlanteans in China, Micronesia, Polynesia: Last stand of the Meme\nXV. Vows of Vengeance: Mayan prophecies in Tulum\nXVI. From Rama to Roma: Resurgence of the Meme\nXV. The Secret Brotherhood takes permanent root\nXVI. Cultic networkers: the role of the Phoenicians\nXVII. Sabians, Nazoreans, and the Old Man of the Mountain\nXVIII. Kohanim, Templars, and the new trade routes\nXIX. Pirates, pirates, everywhere\nXX. The Bacons and the New Atlantis\nXXI. Conspiracy as you thought you knew it\nXXII. Solutions and Next Steps","torrent":{"xt":"urn:btih:1033d3f0ee342577bae9339f8ffdcbbb8e43dd72","amp;dn":"Merchants_of_Magic_Evolution_of_the_Atlantean_Meme_By_The_Sane_T","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1033d3f0ee342577bae9339f8ffdcbbb8e43dd72","infoHashBuffer":{"type":"Buffer","data":[16,51,211,240,238,52,37,119,186,233,51,159,143,253,203,187,142,67,221,114]},"announce":[],"urlList":[]}}