{"title":"Cannonball Adderley - Money In The Pocket (1966) [Jazz][mp3 320]","uid":5766221,"size":151126092,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:115efd1d9a261883314588f66e9e895d7756a37e&amp;dn=Cannonball+Adderley+-+Money+In+The+Pocket+%281966%29+%5BJazz%5D%5Bmp3+320%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"schon55","files":13,"time":1281915215,"description":"Cannonball Adderley - Money In The Pocket \nOriginal: 1966\nAudio CD: August 16, 2005 \nLabel: Blue Note Records \nQuality: mp3 320 kbps CBR\n\nRecorded Live at THE CLUB in Chicago March 1966\n\nFor years jazz aficionados have enjoyed revealing the great secret that Cannonball Adderley's &quot;Mercy Mercy Mercy&quot; was not recorded &quot;Live At The Club&quot; as advertised on the cover, but was instead made &quot;live&quot; in the studio. Well as it turns out that original claim had some foundation. Cannonball did in fact record his band at &quot;The Club&quot; in Chicago, but earlier that year in March 1966. Those sessions see their first ever release on this CD as &quot;Money in the Pocket.&quot; Cannonball's band at this time was one of the steadiest and most popular touring groups in jazz. Brother Nat and Joe Zawinul had been playing with him since the early 1960s, and Roy McCurdy was the group's regular drummer at this time. (Only bassist Herbie Lewis was in the group for a short period, with this his only recording with the quintet.) The result is incredible chemistry, even if the material leans a bit too much towards the funky/soulful crossover jazz of the day for my taste. Overall though, this is an enjoyable disc with good sound and great crowd presence, and it should be in every Cannonball collection. ~ Michael B. Richman\n\nCannonball Adderley's music had always been &quot;populist&quot;, with a strong influence from African-American popular music. In the late 60s, that meant funk, soul and rock influences, to the alarm of some purists. \n\nYou won't hear much of that here, though. The electric piano is nowhere to be heard. There's one tune here - &quot;Money in the Pocket&quot; - that you could characterize as &quot;mid-60s soul jazz/crossover&quot;, and unfortunately it's not a top-tier example (but not bad either). The rest is comfortably in the mainstream of straight-ahead hard-bop and post-bop jazz. &quot;Hear Me Talkin' to Ya&quot; is a classic Cannonball blues from the 50s. &quot;Stardust&quot; gets a beautiful ballad performance. &quot;Introduction to a Samba&quot; is a bossa nova. Not a hint of rock to be heard on those. \n\nThe two &quot;surprises&quot; are &quot;Requiem for a Jazz Musician&quot;, a beautiful enigmatic composition by Joe Zawinul (evocative of Mingus), and an intense, Coltrane-ish take on &quot;Fiddler on the Roof&quot; (much faster than the original studio version). Both showcase the progressive side of Cannonball's music, not afraid of new ideas or challenging his audience. \n\nIf you're looking for (or afraid of) late 60s &quot;commercial&quot; Cannonball, you won't find it on Money in the Pocket. Instead, you'll hear a no-BS, intense live post-bebop performance by a band that could do this kind of stuff in their sleep. They're not asleep here, though. ~ G B\n\nPersonnel:\nCannonball Adderley (alto saxophone)\nNat Adderley (cornet)\nJoe Zawinul (piano)\nHerbie Lewis (bass)\nRoy McCurdy (drums)\n\nCannonball Adderley - Money In The Pocket Tracks:\n01  Money In The Pocket\n02  Stardust\n03  Introduction To A Samba\n04  Hear Me Talkin' To Ya\n05  Requiem For A Jazz Musician\n06  Cannon's Theme (aka Unit 7)\n07  The Sticks\n08  Fiddler On The Roof","torrent":{"xt":"urn:btih:115efd1d9a261883314588f66e9e895d7756a37e","amp;dn":"Cannonball+Adderley+-+Money+In+The+Pocket+%281966%29+%5BJazz%5D%5Bmp3+320%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"115efd1d9a261883314588f66e9e895d7756a37e","infoHashBuffer":{"type":"Buffer","data":[17,94,253,29,154,38,24,131,49,69,136,246,110,158,137,93,119,86,163,126]},"announce":[],"urlList":[]}}