{"title":"Avenged Sevenfold &quot;Live In The LBC&quot; On HDNet Concert","uid":7062602,"size":1856704465,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:1199672bf70190e178a36a32abcc2b19753aabb7&amp;dn=Avenged+Sevenfold+%26quot%3BLive+In+The+LBC%26quot%3B+On+HDNet+Concert&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"djHamzta","files":1,"time":1330401441,"description":"From Wikipedia, the free encyclopedia\n\nAvenged Sevenfold (often abbreviated A7X) is an American heavy metal band from Huntington Beach, California. Formed in 1999, the group consists of M. Shadows (vocalist), Synyster Gates (lead guitarist), Zacky Vengeance (rhythm guitarist), &amp; Johnny Christ (bassist).\n\nThey are known for their diverse rock sound, dramatic imagery in album covers and t-shirts.[1][2][3][4] Avenged Sevenfold emerged with a metalcore sound on their debut Sounding the Seventh Trumpet but their style had evolved by their third album and first major label release, City of Evil into a hard rock/heavy metal sound. The band continued to explore new sounds with their self-titled release and enjoyed continued mainstream success before their drummer, James &quot;The Rev&quot; Sullivan, died in 2009. Despite his death, the band continued on with help of now-former Dream Theater drummer Mike Portnoy and released and toured in support of their fifth album Nightmare in 2010 which debuted on the top spot of the Billboard 200, their first number one debut.[5]\n\nTo date, Avenged Sevenfold has released five studio albums, one live album/compilation/DVD, and eighteen singles and sold more than four million albums worldwide.[6] The band has received much credit for their worldwide mainstream success and were featured as second place on Ultimate Guitar's Top Ten Bands of the Decade.","torrent":{"xt":"urn:btih:1199672bf70190e178a36a32abcc2b19753aabb7","amp;dn":"Avenged+Sevenfold+%26quot%3BLive+In+The+LBC%26quot%3B+On+HDNet+Concert","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1199672bf70190e178a36a32abcc2b19753aabb7","infoHashBuffer":{"type":"Buffer","data":[17,153,103,43,247,1,144,225,120,163,106,50,171,204,43,25,117,58,171,183]},"announce":[],"urlList":[]}}