{"title":"Chicago - Christmas: What's It Gonna Be Santa? [REMASTERED]","uid":6026826,"size":533838897,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:11cb89aa552db3b48510347e4118e2c72cc513ad&amp;dn=Chicago+-+Christmas%3A+What%5C%27s+It+Gonna+Be+Santa%3F+%5BREMASTERED%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ddawg","files":-1,"time":1291954391,"description":" &lt;a href=&quot;\nhttp://g-ecx.images-amazon.com/images/G/01/ciu/62/6e/533853a09da03c8fb6cc6110.L.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://g-ecx.images-amazon.com/images/G/01/ciu/62/6e/533853a09da03c8fb6cc6110.L.jpg&lt;/a&gt;\n\n\nTitle: Christmas: What's It Gonna Be Santa? [ORIGINAL RECORDING REISSUED, REMASTERED] \nArtist: Chicago\nAudio CD (October 14, 2003)\nOriginal Release Date: October 14, 2003\nNumber of Discs: 1\nGenre: Christmas\nFormat: Free Lossless Audio Codec\n\n\nTrack Listing:\n\n01. Winter Wonderland (LP Version)\n02. Let It Snow! Let It Snow! Let It Snow! (LP Version)\n03. Jolly Old St. Nicholas (LP Version) \n04. Little Drummer Boy (LP Version)\n05. This Christmas (LP Version)\n06. Fleiz Navidad (LP Version)\n07. Bethlehem (LP Version)\n08. The Christmas Song (LP Version)\n09. O Come All Ye Faithful (LP Version)\n10. Rudolph, The Red-Nosed Reindeer (LP Version)\n11. Have Yourself A Merry Little Christmas (LP Version)\n12. Sleigh Ride (LP Version)\n13. Silent Night (LP Version)\n14. What Child Is This (LP Version)\n15. Christmas Time Is Here (LP Version)\n16. God Rest Ye Merry, Gentlemen (LP Version)\n17. Santa Claus Is Coming To Town (LP Version)\n18. Child's Prayer (LP Version)\n19. One Little Candle (LP Version)\n20. White Christmas (LP Version) \n\n\nAllmusic Review:\nChicago Christmas: What's It Gonna Be, Santa? is actually a retitled reissue of Chicago's 1998 album Chicago 25: The Christmas Album with six newly recorded extra tracks, bringing the running time up near 75 minutes. Chicago 25 was a gold record seller, and after the band sold its catalog to Rhino Records in 2002 and that label began releasing expanded reissues of the back catalog, the idea of adding to the holiday album came up. It wasn't a bad record to begin with, one on which the Chicago style was applied to seasonal standards. As ever, the group was a cooperative unit, with the three lead singers -- Robert Lamm, Bill Champlin, and Jason Scheff -- taking turns on the different songs, arranged by various bandmembers and always allowing for generous contributions by the horn players Lee Loughnane, James Pankow, and Walt Parazaider. The songs were all old favorites except for Loughnane and John Durrill's &quot;Child's Prayer,&quot; featuring a choir dominated by the musicians' children, which sounded so much like a Middle Ages English hymn that it fit right in. Highlights included a particularly moving vocal on &quot;Have Yourself a Merry Little Christmas&quot; by the gruff-voiced Champlin, a wonderful doubled flute passage by Parazaider on &quot;O Come All Ye Faithful,&quot; and a rare lead vocal by Loughnane on &quot;Let It Snow! Let It Snow! Let It Snow!&quot; But the whole album, pristinely produced by E Street Band pianist Roy Bittan, was well performed. It sounded exactly like you would expect a Chicago Christmas album to sound, and if you liked the band and holiday music, you'd like the record, too. Now, there's just a little more of it, including a rocking version of &quot;Jolly Old St. Nicholas&quot; with new lyrics referring to the bandmembers; two more Loughnane lead vocals on &quot;Bethlehem&quot; and &quot;Sleigh Ride&quot;; and Champlin turning &quot;Rudolph, the Red-Nosed Reindeer&quot; into an R&amp;B tour de force. Bittan may not have been available for the new sessions, but drafting in Phil Ramone as producer wasn't too shabby as replacements go. \n\n","torrent":{"xt":"urn:btih:11cb89aa552db3b48510347e4118e2c72cc513ad","amp;dn":"Chicago+-+Christmas%3A+What%5C%27s+It+Gonna+Be+Santa%3F+%5BREMASTERED%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"11cb89aa552db3b48510347e4118e2c72cc513ad","infoHashBuffer":{"type":"Buffer","data":[17,203,137,170,85,45,179,180,133,16,52,126,65,24,226,199,44,197,19,173]},"announce":[],"urlList":[]}}