{"title":"Dungeon Hunter Alliance 1.0.0 (Mac App Store) Mac OsX","uid":7131469,"size":643372538,"categoryP":"games","categoryS":"mac","magnet":"?xt=urn:btih:11da1cab0e33aefe88734ad31cdacd1f24dd0022&amp;dn=Dungeon+Hunter+Alliance+1.0.0+%28Mac+App+Store%29+Mac+OsX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"muffbuffer69er","files":2,"time":1332721177,"description":"Description\nThe most popular hack-and-slash RPG for PlayStationÂ®Network finally comes to Mac! Delve into this treasure of a game that every serious fan of the genre needs to own.\n*** GAMING-AGE: &quot;I like the dungeon crawling. I like the character customization. I like the loot. But most of all I like the multiplayer. With four players going at it, the battles become pandemonium and I love it. Dungeon Hunter: Alliance has everything I look for in a downloadable title.&quot; (85% - Great) ***\n\nPLEASE CHECK SYSTEM REQUIREMENTS PRIOR TO PURCHASE\nThis game is not supported by iMac and MacBook Pro devices equipped with the following video cards:\nRadeon X1600\nIntel GMA 950/GMA 3100\n\nImmerse yourself in the heart of a unique online multiplayer experience. Face the world of Gothicus and its hordes of creatures alone or in teams of up to 4 heroes. The main quest, side quests, and the innumerable items to collect offer hours of play in a superbly modeled gothic universe. Push evil back to the depths of hell and squash the destructive ambitions of a tyrannical Queen... who was once your beloved!\n\n- A unique multiplayer experience on the Mac App Store: team up online with players across the globe! Do your training and climb the ranks in the online leaderboards.\n- A real quest to complete solo or with others, spanning over 30 levels with an immense world of dungeons, villages and forests to explore, including areas that are randomly generated. \n- A level of production rarely achieved on the Mac App Store: graphics and special effects rivaling classic games (console), smooth animation even during multiplayer sessions, and an immersive dark gothic ambiance. \n- All the ingredients for a great role-playing game: choose your class, optimize your hero's development by assigning experience points to the attributes of your choice, and equip your hero with the best armor. \n- Enjoy classic and addictive hack 'n' slash gameplay with intuitive and accessible controls for instant fun and intense action.\n\nSystem requirements:\nOSX: 10.6.6\nMemory: 2 GB [4 GB recommended]\nCPU: Intel Core 2 Duo with 1.86 GHz [Intel Core i3 with 3 GHz recommended]\nHDD: 2 GB of free space [10 GB recommended]\nOnline: Ethernet or Wi-Fi","torrent":{"xt":"urn:btih:11da1cab0e33aefe88734ad31cdacd1f24dd0022","amp;dn":"Dungeon+Hunter+Alliance+1.0.0+%28Mac+App+Store%29+Mac+OsX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"11da1cab0e33aefe88734ad31cdacd1f24dd0022","infoHashBuffer":{"type":"Buffer","data":[17,218,28,171,14,51,174,254,136,115,74,211,28,218,205,31,36,221,0,34]},"announce":[],"urlList":[]}}