{"title":"Alex Jones Fall of the Republic DVD 4.5GB","uid":5152843,"size":4682657792,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:11e23e900ec55e0530ab2088e2bf209ac064cda7&amp;dn=Alex+Jones+Fall+of+the+Republic+DVD+4.5GB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SilverHare","files":-1,"time":1257670367,"description":"This is a 4.5gb DVD iso that contains the documentary film Fall of the Republic.\n\nThis disc has been shrunk from the actual Fall of the Republic DVD down to DVD-R size. This is not an upconvert from a WMV file. \n\nIn order to preserve the quality of the main film, the Oathkeepers extra feature has been cut, but all of the other features of the original DVD are intact. \n\nPlease enjoy and spread it around. \n\nThank you for seeding.\n\n\n\nFall Of The Republic documents how an offshore corporate cartel is bankrupting the US economy by design. Leaders are now declaring that world government has arrived and that the dollar will be replaced by a new global currency.\n\nPresident Obama has brazenly violated Article 1 Section 9 of the US Constitution by seating himself at the head of United Nations' Security Council, thus becoming the first US president to chair the world body.\n\nA scientific dictatorship is in its final stages of completion, and laws protecting basic human rights are being abolished worldwide; an iron curtain of high-tech tyranny is now descending over the planet.\n\nA worldwide regime controlled by an unelected corporate elite is implementing a planetary carbon tax system that will dominate all human activity and establish a system of neo-feudal slavery.\n\nThe image makers have carefully packaged Obama as the world's savior; he is the Trojan Horse manufactured to pacify the people just long enough for the globalists to complete their master plan.\n\nThis film reveals the architecture of the New World Order and what the power elite have in store for humanity. More importantly it communicates how We The People can retake control of our government, turn the criminal tide and bring the tyrants to justice.\n\n\nFeel free to comment!","torrent":{"xt":"urn:btih:11e23e900ec55e0530ab2088e2bf209ac064cda7","amp;dn":"Alex+Jones+Fall+of+the+Republic+DVD+4.5GB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"11e23e900ec55e0530ab2088e2bf209ac064cda7","infoHashBuffer":{"type":"Buffer","data":[17,226,62,144,14,197,94,5,48,171,32,136,226,191,32,154,192,100,205,167]},"announce":[],"urlList":[]}}