{"title":"Dangerous (Bette Davis) {Alien} [1935] .avi","uid":4515150,"size":497398806,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:12687f3e4d45114c2d25f3d4c8820e3bb1f2a4a8&amp;dn=Dangerous+%28Bette+Davis%29+%7BAlien%7D+%5B1935%5D+.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"alien99","files":1,"time":1226943710,"description":"Bette Davis began appearing in films in 1931 at the age of 23. She was an extremely hard working actor, and by the time she made this film in 1935, she had appeared in 27 films including `Of Human Bondage&amp;#039; for which she received her first Oscar nomination the year before.\n\nThe story is compelling. Don Bellows (Franchot Tone) is an architect who claims that his life was changed forever by a theater performance by a young actress named Joyce Heath (Bette Davis) who came to prominence quickly and vanished almost as fast. He was so moved by her performance that he re-evaluated his life and took on a new direction, moving from being a stockbroker to indulge his more creative side by studying architecture. One day he comes upon Joyce Bellows who is stinking drunk. He recognizes her and attempts to engage her in conversation, but she is cruel and derisive. When she passes out, he takes her back to his place to sober her up and care for her. Despite her decrepit condition, he is captivated by her and falls madly in love with her, breaking off his engagement to Gail (Margaret Lindsay).\n\nDon begins the process of rehabilitating Joyce and though she is resentful and bitter at first, she is won over by his devotion to her and agrees to take a part in a play that she always wanted, a play that he used all his money to back. However, Joyce has a secret that dooms the relationship. She is a dangerous woman who ruins the men who love her. The world comes crashing down on her and on the men in her life.\n\nThis is a well-crafted story that keeps the viewer intrigued from beginning to end. Davis is electrifying in the role. I consider this and her performance in `All About Eve&amp;#039; (where she also played a bitter actress) to be her best. She throws herself into the role and delivers a performance that ranges from the highest of highs to the lowest of lows. She won her first of two Academy Awards for this film and went on to be nominated a total of 13 times.\n\nThis film is a must for anyone interested in Ms. Davis body of work and for the classic film buff in general. I rated it a 10. It is a terrific story that is enhanced by a riveting performance by one of the legends of film. \n\n640 X 480\n1:18:23\n160kbps\nMPEG Layer-3\nDivX TV12","torrent":{"xt":"urn:btih:12687f3e4d45114c2d25f3d4c8820e3bb1f2a4a8","amp;dn":"Dangerous+%28Bette+Davis%29+%7BAlien%7D+%5B1935%5D+.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12687f3e4d45114c2d25f3d4c8820e3bb1f2a4a8","infoHashBuffer":{"type":"Buffer","data":[18,104,127,62,77,69,17,76,45,37,243,212,200,130,14,59,177,242,164,168]},"announce":[],"urlList":[]}}