{"title":"The Sorcerer's Companion A Guide to the Magical World of Harry P","uid":9848654,"size":12742687,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1284ea8cf5600059b3e5fd54cddba71ec4681460&amp;dn=The+Sorcerer%27s+Companion+A+Guide+to+the+Magical+World+of+Harry+P&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Sbromier","files":1,"time":1396117226,"description":"Guide to the Magical World of Harry Potter - Allan Zola Kronzek|\n\nSize : 12.15 MB\n\nWho was the real Nicholas Flamel? How did the Sorcerers Stone get its power? Did J. K. Rowling dream up the terrifying basilisk, the seductive veela, or the vicious grindylow? And if she didnt, who did? Millions of readers around the world have been enchanted by the magical world of wizardry, spells, and mythical beasts inhabited by Harry Potter and his friends. But what most readers dont know is that there is a centuries-old trove of true history, folklore, and mythology behind Harrys fantastic universe. Now, with The Sorcerers Companion, those without access to the Hogwarts Library can school themselves in the fascinating reality behind J. K. Rowlings world of magic. Newly updated to include Harry Potter and the Order of the Phoenix, The Sorcerers Companion allows curious readers to look up anything magical from the Harry Potter books and discover a wealth of entertaining, unexpected information. Wands and wizards, boggarts and broomsticks, hippogriffs and herbology, all have astonishing histories rooted in legend, literature, or real-life events dating back hundreds or even thousands of years. Magic wands, like those sold in Rowlings Diagon Alley, were once fashioned by Druid sorcerers out of their sacred yew trees. Love potions were first concocted in ancient Greece and Egypt. And books of spells and curses were highly popular during the Middle Ages. From Amulets to Zombies, youll also learn: how to read tea leaves where to find a basilisk today how King Frederick II of Denmark financed a war with a unicorn horn who the real Merlin was how to safely harvest mandrake root who wore the first invisibility cloak how to get rid of a goblin why owls were feared in the ancient world what really lies beyond the Veil the origins of our modern-day bogeyman, and more. ","torrent":{"xt":"urn:btih:1284ea8cf5600059b3e5fd54cddba71ec4681460","amp;dn":"The+Sorcerer%27s+Companion+A+Guide+to+the+Magical+World+of+Harry+P","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1284ea8cf5600059b3e5fd54cddba71ec4681460","infoHashBuffer":{"type":"Buffer","data":[18,132,234,140,245,96,0,89,179,229,253,84,205,219,167,30,196,104,20,96]},"announce":[],"urlList":[]}}