{"title":"Coast to Coast AM March 20 2013","uid":8282186,"size":55151808,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:12877940de77ad4c42fdd4b3b1c713bcb971ca3f&amp;dn=Coast+to+Coast+AM+March+20+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"runcdfirst","files":5,"time":1363825041,"description":"#we.are.some.of.the.leaders.on.the.motherpla.net\n\nDate: \t03-20-13\nHost: \tGeorge Noory\nGuests: \tJonathan Cahn, Rosemary Ellen Guiley\n\nHistorian and expert in ancient mysteries, Jonathan Cahn, discussed how omens from the Bible's oracle of Isaiah are reappearing in the U.S. with eerie similarities to the events which foretold the destruction and fall of ancient Israel. He cited nine harbingers that have happened on American soil, or are yet to come, starting with the breach in security that led to the 9-11 terrorist attacks. This mirrors what happened to Israel in 732 BC, he said. The harbingers point to America losing its status as the head of nations, and moving to an economic collapse, he cautioned.\n\nGeorge Washington gave a prophetic warning on his first day as President, saying that if America ever turns away from God and the ways of righteousness, blessings will be removed from the land, Cahn detailed. &quot;We're actually seeing this warning come true,&quot; he continued, adding that after Washington made this proclamation, he went to pray and dedicate America to God at St. Paul's Chapel. At the time, New York was America's capital, and fascinatingly, the site of St. Paul's Chapel is at Ground Zero, and it was one of the only buildings to survive the Twin Towers attacks.\n\nDuring 9-11, &quot;we didn't realize the nation was drawn back...to the place of consecration, where America was dedicated to God. The same biblical principle,&quot; he commented. There was also hidden scripture at Ground Zero-- a Bible that was blown apart, with only one page left was subsequently captured by a photographer. The photographer was surprised to see the phrase &quot;come let us build for ourselves a tower&quot; on the page, which relates to the Tower of Babel, and Isaiah 9:10, Cahn remarked.\nHistory of Ouija\n\nFirst hour guest, expert on the paranormal Rosemary Ellen Guiley spoke about the history of the Ouija board, as well as strange cases associated with it. Based on ancient divination systems, the &quot;talking board&quot; was patented in 1891 when it was combined with the planchette. The idea, she explained, was for people to become their own spirit communicators rather than rely on mediums. The patent holders had a session with the board one night, and asked it what it should be called, and reportedly it spelled out O-U-I-J-A, and that it meant good luck. Guiley noted that the board is neutral, but mischievous or negative entities can sometimes come through, such as one known as ZOZO.\n\nNews segment guests: Capt. Kelly Sweeney, Joyce Riley, Steve Kates 'Dr.Sky'\nWebsite(s):\n\n    theharbinger...com\n    visionaryliving.com\n\nBook(s):\n\n    The Harbinger\n    The Encyclopedia of Demons and Demonology\n    The Encyclopedia of Ghosts and Spirits\n    Talking to the Dead\n\n","torrent":{"xt":"urn:btih:12877940de77ad4c42fdd4b3b1c713bcb971ca3f","amp;dn":"Coast+to+Coast+AM+March+20+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12877940de77ad4c42fdd4b3b1c713bcb971ca3f","infoHashBuffer":{"type":"Buffer","data":[18,135,121,64,222,119,173,76,66,253,212,179,177,199,19,188,185,113,202,63]},"announce":[],"urlList":[]}}