{"title":"HISTORY OF POP AND ROCK MUSIC - part 541","uid":9383502,"size":376703580,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:12d6f8dc8d72cb70948e7591657d87c46bb61530&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+541&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zlatkopupovac","files":-1,"time":1387753351,"description":"\n\n                         PART  541\n\n\n\n        JOAN BAEZ    -  The Night They Drove Old Dixie Down  (1971)\n        CURVED AIR  -   Melinda More Or Less  (1972)\n\n\n               &quot;The Night They Drove Old Dixie Down&quot; is a song by The Band, recorded in 1969 and released on their self-titled second album. The most successful cover of the song was a version by Joan Baez released in 1971, which peaked at number three on the Billboard Hot 100 chart in the US in October that year and spent five weeks atop the easy listening chart. The version was also well received in the UK, reaching number six in the pop charts in October 1971. Baez's version made some changes to the song lyric; The second line &quot;Till Stoneman's cavalry came&quot;. Baez sings &quot;Till so much cavalry came&quot;. She also changed &quot;May the tenth&quot; to &quot;I took the train&quot;. In addition, the line &quot;like my father before me, I will work the land&quot; was changed to &quot;like my father before me, I'm a working man&quot;, changing the narrator from a farmer to a laborer. In the last verse she changed &quot;the mud below my feet&quot; to &quot;the blood below my feet&quot;. She also changed the words &quot;there goes Robert E Lee&quot; to &quot;there goes the Robert E Lee,&quot; changing the reference from the general to the steamboat. Baez later told Rolling Stone's Kurt Loder that she initially learned the song by listening to the recording on the Band's album, and had never seen the printed lyrics at the time she recorded it, and thus sang the lyrics as she'd (mis)heard them. In more recent years in her concerts, Baez has performed the song as originally written by Robertson. The song became the highest charting U.S. single of Baez' career, and has remained a staple of her concert set list, from that point forward.\n\n          &quot;Melinda More Or Less&quot; is a song by Curved Air, from their 1972 album  &quot;Phantasmagoria&quot;.  It reached No. 20 in the UK Charts and is notable for its early use of the EMS Synthi 100 synthesizer to process lead singer Sonja Kristina's voice on the second side. Unavailable for many years, the album was reissued on CD in April 2007. Allmusic called Phantasmagoria &quot;the culmination of all that Curved Air promised over the course of its predecessors&quot; and &quot;the band's grandest hour by far&quot;. Their review praised the vast majority of the individual tracks, especially complimenting the blending of musical styles and absence of pretentiousness. \n              Curved Air are a pioneering British progressive rock group formed in 1970 by musicians from mixed artistic backgrounds, including classical, folk, and electronic sound. ","torrent":{"xt":"urn:btih:12d6f8dc8d72cb70948e7591657d87c46bb61530","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+541","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12d6f8dc8d72cb70948e7591657d87c46bb61530","infoHashBuffer":{"type":"Buffer","data":[18,214,248,220,141,114,203,112,148,142,117,145,101,125,135,196,107,182,21,48]},"announce":[],"urlList":[]}}