{"title":"EnigmaT Set Rips { Cuts } - November 20th, 2013","uid":9221710,"size":1006601990,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:142adf77934c02ac542c783db2742c5dbf94ca34&amp;dn=EnigmaT+Set+Rips+%7B+Cuts+%7D+-+November+20th%2C+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EnigmaT","files":125,"time":1384907228,"description":"4 Strings - Lights Out (Cut From W&amp;W Set)-enTc.mp3\n4 Strings - This Heart Is Yours (Original Mix) (Cut From Del Mar Set)-enTc.mp3\n8 Mirrors - Breeze (Original Mix) (Cut From Shah Set)-enTc.mp3\nAbandoned Rainbow - Ethereal (Outflow Remix) (Cut From El Jay Set)-enTc.mp3\nAdam Szabo &amp; Johan Vilborg feat. Johnny Norberg - Two To One (Matt Fax Vocal Mix) (Cut From Del Mar Set)-enTc.mp3\nAlex Shevchenko - Dancing In The Rain (Allen Ma's Emotional Remix) (Cut From tranzLift Set)-enTc.mp3\nAlpha Duo &amp; Light &amp; Wave - Interstate (Original Mix) (Cut From Alpha Duo Set)-enTc.mp3\nAndrew Bayer &amp; Norin &amp; Rad pres. Artificial - Prototype (ABGT 053 Rip)-enTc.mp3\nAndybody - Sometimes I Even Amaze Myself (Cut From Page Set)-enTc.mp3\nAran - The Spruce (Original Mix) (Cut From Aran Set)-enTc.mp3\nAraya &amp; Mark Dreamer - Go On! (Cut From Graham Set)-enTc.mp3\nArias - Vrigo (Cut From W&amp;W Set)-enTc.mp3\nArmin van Buuren feat. Miri Ben-Ari - Intense (Dannic Remix) (Cut From W&amp;W Set)-enTc.mp3\nArmin van Buuren feat. Richard Bedford - Love Never Came (W&amp;W &amp; Armin Van Buuren Remix) (Cut From W&amp;W Set)-enTc.mp3\nAron H - Entrance (ABGT 053 Rip)-enTc.mp3\nAtragun &amp; Transport - Distant Reality (Original Mix) (Cut From El Jay Set)-enTc.mp3\nBlasterjaxx &amp; Fans - Our Soldiers (Cut From W&amp;W Set)-enTc.mp3\nBlasterjaxx &amp; Fans - Our Soldiers (Original Mix) (Cut From Vegas Set)-enTc.mp3\nBlood Groove &amp; Kikis - Without You (ABGT 053 Rip)-enTc.mp3\nBobby Burns &amp; Ansol - More Than You'll Ever Know (Extended Club Mix) (Cut From Vegas Set)-enTc.mp3\nBoomriSe - Dizor (Cut From BoomriSe Set)-enTc.mp3\nBruce Cullen - 4 Sheets To The Wind (Danilo Ercole Remix) (Cut From GO Set)-enTc.mp3\nCarnage - Mara (Original Mix) (Cut From R3HAB Set)-enTc.mp3\nChase &amp; West - Nearly Blind (Original Mix) (Cut From Saux Set)-enTc.mp3\nCraig London - Drop Zone (Original Mix) (Set Rip)-enTc.mp3\nCraig London feat. Lokka - Falling Down (Original Mix) (Set Rip)-enTc.mp3\nCurtis Young - Activation (ID Remix) (Cut From Summerville Set)-enTc.mp3\nDaft Punk - Harder, Better, Faster, Stronger (Aerofoil Bootleg) (Cut From Vale Set)-enTc.mp3\nDamian Wasse vs Rank 1 - Symsonic (Damian Wasse Remix) (Cut From Sty Set)-enTc.mp3\nDarragh Burke - Meet You There (Witness45 Remix) (Cut From Shah Set)-enTc.mp3\nDauwd - Heat Division (Lulu Rouge Remix) (ABGT 053 Rip)-enTc.mp3\nDave Till &amp; Arda Diri - Grenade (Original Mix) (Cut From Vegas Set)-enTc.mp3\nDenny Berland - Finale (Original Mix) (Cut From Tempo Set)-enTc.mp3\nDiamandi &amp; Michael Tsukerman - Dysnomia (Cut From O'Neil Set)-enTc.mp3\nDreamy - Unforgettable Memories (Ahmed Romel Remix) (Cut From Amitacek Set)-enTc.mp3\nDriftwood - Drifter (Cut From Ellis Set)-enTc.mp3\nEd Lynam - Adrenalin (Cut From Lynam Set)-enTc.mp3\nEdu Padilla - Lisban (Hypaethrame Remix) (Cut From Del Mar Set)-enTc.mp3\nEstigma - Nymeria (Original Mix) (Cut From Amitacek Set)-enTc.mp3\nEthillas - Oslo (Original Mix) (Cut From Del Mar Set)-enTc.mp3\nFilterheadz - Seductive (Cut From Graham Set)-enTc.mp3\nGareth Weston - Oceans Apart (Amitacek Remix) (Cut From Amitacek Set)-enTc.mp3\nGi.U. - Beyond The Clouds (Diego.Morrill pres. TDM Remix) (Cut From El Jay Set)-enTc.mp3\nGina Star &amp; Poet Feat. Golden Phoenix - Electric Love (Cut From Tydi Set)-enTc.mp3\nGuy Mantzur - How Long Is Now (Cut From Graham Set)-enTc.mp3\nHadouken - Levitate (Starkillers Remix) (-Short- Cut From Page Set)-enTc.mp3\nHadouken - Levitate (Starkillers Remix) (Cut From Emery Set)-enTc.mp3\nHanski - Repress (Original Mix) (Cut From C-Systems Set)-enTc.mp3\nHesham Watany vs. ProShifo - The Sacrifices (Cesar Lugo Remix) (Cut From A&amp;F Set)-enTc.mp3\nHypaethrame - Saviour (Original Mix) (Cut From Saux Set)-enTc.mp3\nInpetto &amp; Patric La Funk - Bobcat (Original Mix) (Cut From R3HAB Set)-enTc.mp3\nIvan Gough, Walden &amp; Jebu feat. Penelope Austin - Home (Original Mix) (Cut From R3HAB Set)-enTc.mp3\nJaco - Changes (Original Mix) (Cut From Tritonal Set)-enTc.mp3\nJan Miller - Firefox (Cut From Rosnki Set)-enTc.mp3\nJay Cosmic - To The Rhythm (Cut From W&amp;W Set)-enTc.mp3\nJonas Stenberg - Mugshot (Cut From O'Neil Set)-enTc.mp3\nJosef Belani - Travel (Cut From W&amp;W Set)-enTc.mp3\nJoze - Sorted Pipes (Original Mix) (Cut From Summerville Set)-enTc.mp3\nKerry Leva - Proud (Oliver Smith Remix) (Cut From Oliver Smith Set)-enTc.mp3\nKrewella with Gareth Emery - Lights &amp; Thunder (Original Mix) (Cut From Bobina Set)-enTc.mp3\nLDK - Blip Dist (Original Mix) (Cut From DJ Leon Set)-enTc.mp3\nLee Miller - Fusion (Original Mix) (Cut From Dave Cold Set)-enTc.mp3\nLiquid Soul - Adrenaline (Zen Mechanics Remix) (Cut From Patterson Set)-enTc.mp3\nLiquid Soul - Nirvana (Activa Synthetic Elements Mix) (Cut From Patterson Set)-enTc.mp3\nLostly - More Lost Than Found (Original Mix) (Cut From A&amp;F Set)-enTc.mp3\nM3R-T - I Live Fast, Die A Legend (Shango V Remix) (Cut From Vale Set)-enTc.mp3\nManida - The Last Sunrise (Akku Remix) (Cut From Dave Cold Set)-enTc.mp3\nMarc Simz - My World (Cut From Simz Set)-enTc.mp3\nMarcel van Eyck, DJ T.H. &amp; Three Faces - Afterglow (Original Dub Mix) (Cut From C-Systems Set)-enTc.mp3\nMarcel van Eyck, DJ T.H. &amp; Three Faces - Afterglow (Original Vocal Mix) (Cut From Del Mar Set)-enTc.mp3\nMarsh - Sleeping Now (Rodrigo Deem &amp; Vitodito Remix) (ABGT 053 Rip)-enTc.mp3\nMartin Garrix - Animals (Gram Remix) (Cut From Emery Set)-enTc.mp3\nMassive Ditto &amp; Jeanxk - Deux (Original Mix) (Cut From Del Mar Set)-enTc.mp3\nMatt Fax - Hidden Feelings (Cut From Graham Set)-enTc.mp3\nMerk &amp; Kermont - Zunami (Original Mix) (Cut From R3HAB Set)-enTc.mp3\nMerk &amp; Kremont - Zumani (Cut From Emery Set)-enTc.mp3\nMichael &amp; Levan and Stiven Rivic - Topless (Dale Middleton Remix) (Cut From Graham Set)-enTc.mp3\nMichael Retouch - Eternal Sky (C-Systems Remix) (Cut From C-Systems Set)-enTc.mp3\nMimax - Liberty Heights (REZarin Remix) (Cut From Colonial One Set)-enTc.mp3\nMindset - Home (Cut From Graham Set)-enTc.mp3\nNaderia - Invincible Comeback (Original Comeback Mix) (Cut From Fabio XB Set)-enTc.mp3\nNERVO &amp; Ivan Gough feat. Beverley Knight - Not Taking This No More (MAKJ Remix) (Cut From W&amp;W Set)-enTc.mp3\nNervous Testpilot - Holding Fire (Cut From GO Set)-enTc.mp3\nNianaro - In The Beginning (Original Mix) (-Short- Cut From GO Set)-enTc.mp3\nOceanLab - On a Good Day (Allen &amp; Envy Rework) (Cut From Lynam Set)-enTc.mp3\nOliver Smith - Evermore (Cut From Oliver Smith Set)-enTc.mp3\nOmnia Feat. Everything by Electricity - Bones  (ASOT 637 Rip)-enTc.mp3\nPaul Oakenfold &amp; Disfunktion feat. Spitfire - Beautiful World (StadiumX Remix) (Cut From Del Mar Set)-enTc.mp3\nPaul Thomas - Slo Bibble (Cut From O'Neil Set)-enTc.mp3\nQuantize - Dimethyltryptamine (LOUD Remix) (Cut From Patterson Set)-enTc.mp3\nRinkadink vs. Mental Broadcast - Hosh Of Bass (Cut From Patterson Set)-enTc.mp3\nRobby East &amp; Oliver Heldens - Panther (Original Mix) (Cut From Vegas Set)-enTc.mp3\nRobert Lyttle &amp; Billy Gillies - Distant Realm (Cut From A&amp;F Set)-enTc.mp3\nRobert Lyttle vs. Billy Gillies - Distant Realm (Original Mix) (Cut From Photographer Set)-enTc.mp3\nRonny K &amp; Michael Flint - La Luna (Original Mix) (Cut From Del Mar Set)-enTc.mp3\nRudimental feat. Emeli Sande - Free (Ivan Gough &amp; Jebu Remix) (Cut From Del Mar Set)-enTc.mp3\nSander Van Doorn - Neon (Ummet Ozcan Remix) (Cut From Vegas Set)-enTc.mp3\nSerenade - Out of My Life (Aiera Remix) (Cut From Nelson Set)-enTc.mp3\nShermanology - Revolution Of Love (Cut From W&amp;W Set)-enTc.mp3\nSneijder - Silent Treatment (Cut From A&amp;F Set)-enTc.mp3\nSomna feat. Ash Richards - Wherever You Go (Eloquentia Remix) (Cut From Sty Set)-enTc.mp3\nSpektre - Steel City Sunrise (Cut From Graham Set)-enTc.mp3\nSpencer Tarring - Come On Now (Original Mix) (Cut From Vegas Set)-enTc.mp3\nStardogz - Start Up (Cut From Divini Set)-enTc.mp3\nSteve Aoki &amp; Flux Pavilion - Steve French (Cut From W&amp;W Set)-enTc.mp3\nSunset - I Believe (Amitacek Remix) (Cut From Amitacek Set)-enTc.mp3\nSvenson &amp; Gielen - The Beauty of Silence (Artento Divini Remix) (Cut From Divini Set)-enTc.mp3\nTangle &amp; Tristand - Till The End (Original Mix) (Cut From Tritonal Set)-enTc.mp3\nTasso feat. Ben Brookes - Somewhere Around 8 (Original Dub Mix) (Cut From Saux Set)-enTc.mp3\nTechnasia feat. Bension - Aries (ABGT 053 Rip)-enTc.mp3\nTeeqo - Children Of The Tides (Original Mix) (Cut From Solarstone Set)-enTc.mp3\nTempo Giusto - ID -November 2013-  (Cut From Tempo Set)-enTc.mp3\nThe Killers - Shot At The Night (Cazzette Remix) (Cut From Emery Set)-enTc.mp3\nThe Partysquad &amp; Billy The Kit - Sunset (Extended Mix) (Cut From Vegas Set)-enTc.mp3\nThunderwolf feat. Elizabeth Tseng - Fly Away (Craig London Remix) (Set Rip)-enTc.mp3\nTim Besamusca - Hyperscape (Diffract Remix) (Cut From A&amp;F Set)-enTc.mp3\nTommy Trash - Fuckwind (Original Mix) (Cut From R3HAB Set)-enTc.mp3\nTony Junior feat. Mr Wilson - Escapade (Original Mix) (Cut From R3HAB Set)-enTc.mp3\nTristan Armes - Elatum (Original Mix) (Cut From MORPH Set)-enTc.mp3\nTritonal feat. Phoebe Ryan - Now Or Never (Pierre Fulton Remix) (Cut From O'Neil Set)-enTc.mp3\nTuneflux - Brink Of Time (The Cloudy Day Remix) (Cut From Vale Set)-enTc.mp3\ntyDi Feat. Carmen Kiegans - Gravity (Cut From Tydi Set)-enTc.mp3\nWalden - First Day (Gorgon City Remix) (Cut From Oliver Smith Set)-enTc.mp3\nWill Atkinson pres. Darkboy - Damage (Steve Haines Remix) (Cut From Ekman Set)-enTc.mp3\nZak Moya - The Shard (Original Mix) (Cut From Tempo Set)-enTc.mp3\n","torrent":{"xt":"urn:btih:142adf77934c02ac542c783db2742c5dbf94ca34","amp;dn":"EnigmaT+Set+Rips+%7B+Cuts+%7D+-+November+20th%2C+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"142adf77934c02ac542c783db2742c5dbf94ca34","infoHashBuffer":{"type":"Buffer","data":[20,42,223,119,147,76,2,172,84,44,120,61,178,116,44,93,191,148,202,52]},"announce":[],"urlList":[]}}