{"title":"Infernal Restraints--On Display Amber Nevada High","uid":14241608,"size":2292839514,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:14d90cb3aa514ad7c12a577bf0bcc9ff37c7fd36&amp;dn=Infernal+Restraints--On+Display+Amber+Nevada+High&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"merzedes","files":1,"time":1460150709,"description":"On Display | Amber Nevada\r\n\r\nApril 8, 2016\r\n\r\n\r\nHigh MP4 only.\r\n\r\n\r\nNothing but the best make it into our dungeons. Amber Nevada is new here, a sexy piece of ass that doesn't have a lot of experience in the world of BDSM. So how did this newbie end up locked in metal bondage, crawling on the floor for our pleasure? Because she is dedicated to serving the sexual satisfaction of her superiors. She knows that being on the ground, languishing in bondage until a strong man wants to use her is the highest station she can aspire to in life. Today she is getting used for the first time by a true master. \r\n\r\nMetal pipes are locked around her neck, framing her pretty face and putting it on display. Later, another set around her ankles will do the same for her feet. It divides her into three sections, each one easily targeted for a different type of torment. Her feet are sitting there, exposed in case O.T. decides to torment them. Her face is how he will humiliate her, slapping her and making her drink from a dog bowl, reminding her that she will always be less than him. And in between is how he will train her for her new life. Perky tits and tight twat are there for him to play with, and as he gropes her and fucks her with a dildo, she learns how best to use her body to satisfy a man. She learns to love the feeling of being violated as he vibrates her pussy to incredible orgasms. And once she has had one, she won't want to get off any other way.  \r\n\r\nAmber Nevada face down on the floor in metal bondage Amber Nevada on the floor licking O.T.'s dirty boot cle Amber Nevada feet held in place by metal bondage shackles \r\n\r\nScreens \nhttp://www.infernalrestraints.com/device/bondage/trailer.php?y=2016&amp;p=04_08anevada&amp;u=InfernalRestraints-Amber-Nevada-On-Display\r\n\r\nUploaded by Merzedes and Shallow2\r\n\r\n21 000 Femdom/BDSM/Fetish torrentuploads since 2004, including almost everything from Kink/Intersect.\r\n\r\nJust keep on leaving us nice comments below and we are happy for the next 20k:)\r\n\r\nAlso, a huge thanks to Kink.com for making the videos we all love (and Intersect and all the others too ofcourse). Keep up the awesome work!!!\r\n\r\nAny Questions ?? Read our FAQ!!\r\n \nhttps://yuq.me/users/23/079/W2kwa6hEeP.png\r\n \nhttp://s16.postimg.org/rxyfmji7p/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg\r\n\r\nCheers :-)","torrent":{"xt":"urn:btih:14d90cb3aa514ad7c12a577bf0bcc9ff37c7fd36","amp;dn":"Infernal+Restraints--On+Display+Amber+Nevada+High","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"14d90cb3aa514ad7c12a577bf0bcc9ff37c7fd36","infoHashBuffer":{"type":"Buffer","data":[20,217,12,179,170,81,74,215,193,42,87,123,240,188,201,255,55,199,253,54]},"announce":[],"urlList":[]}}