{"title":"Rifftrax - Firewall","uid":7637581,"size":838179970,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:15c196d88378835e19a8902eed85be669264db31&amp;dn=Rifftrax+-+Firewall&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jose1337","files":1,"time":1347691361,"description":"As with all Rifftrax movies if you want the original theatrical, or DVD version's of this movie then this is not the torrent you are looking for...\n*******************************************************************************\nThe thrilling world of banking explodes across the silver screen! Harrison Ford is a bank security manager who gets more than he bargained for when a cold-blooded thief (Paul Bettany) breaks the little chain and steals the pen that belongs to the desk where most customers fill out their deposit slips! And as if that weren't enough, he ups the ante, nearly emptying the entire pot of complimentary coffee into his giant, one-liter travel mug that he got from the Tom Thumb!\n\nHis reign of terror continues as he gets in line for the teller and begins to fill out his deposit slip only after he gets to the counter! Oh, there are gunfights and fisticuffs and intrigue and Virginia Madsen playing put-upon wives and whatnot, but mostly, this is thrilling, non-stop, ink-spilling banking at its best!\n\nThe bottom line on this ledger shows an aggregate surplus of laughs, as Mike is joined by Kevin Murphy for one fiscally sound RiffTrax!\n\n*******************************************************************************\nAs always donate or purchase the MP3's from Rifftrax. com to keep these coming..","torrent":{"xt":"urn:btih:15c196d88378835e19a8902eed85be669264db31","amp;dn":"Rifftrax+-+Firewall","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"15c196d88378835e19a8902eed85be669264db31","infoHashBuffer":{"type":"Buffer","data":[21,193,150,216,131,120,131,94,25,168,144,46,237,133,190,102,146,100,219,49]},"announce":[],"urlList":[]}}