{"title":"The Knife - Shaking the Habitual (2013) [FLAC]","uid":8372046,"size":542180730,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:16090a4f81ce04dfa787421ab397497cfc0f4516&amp;dn=The+Knife+-+Shaking+the+Habitual+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1365946304,"description":"\n  The Knife - Shaking the Habitual (2013) [FLAC]\n\n  Released: 2013\n  Duration: 77:14\n  Genre: Electronic\n  Style: Indie Electronic, Alternative\n  Source: Retail 2CD (log + cue)\n  Codec: FLAC\n  Bit Rate: ~ 950 kbps\n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz\n\n  01 A Tooth For An Eye\n  02 Full Of Fire\n  03 A Cherry On Top\n  04 Without You My Life Would Be Boring\n  05 Wrap Your Arms Around Me\n  06 Crake\n  07 Old Dreams Waiting To Be Realized\n\n  01 Raging Lung\n  02 Networking\n  03 Oryx\n  04 Stay Out Here\n  05 Fracking Fluid Injection\n  06 Ready To Lose\n  \n  On their fourth studio album, the Knife don't change their habits as much as they push themselves to the extreme. Despite its 100-minute length and political overtones, musically Shaking the Habitual isn't as radical a change as Silent Shout's sustained dread was from its predecessor, the relatively cheery Deep Cuts. The DNA of &quot;Like a Pen,&quot; &quot;From Off to On,&quot; and &quot;We Share Our Mothers' Health&quot; remains, albeit in heavily mutated forms, in the album's double-jointed beats, writhing textures, and deep tones. Rather, the album's title describes the Knife's mindset, which is restless and swarming with ideas; they're challenging their audience with these songs, but first and foremost, they're challenging themselves. \n\n  There is nothing comforting about this album, something suggested by the two songs issued before its release. &quot;A Tooth for an Eye&quot; turns the steel drums the Knife have used since the beginning into something anguished and alien as Karin Dreijer howls &quot;ice, ice, ice.&quot; &quot;Full of Fire&quot; ratchets this tension up several notches, starting with distorted beats that sound like they're burning, then (d)evolving into mangled electronics while Dreijer insistently hectors and interrogates her listeners and herself: &quot;What's the story?/What's my opinion?&quot; Yet there's much more to Shaking the Habitual than even those singles could have suggested. It's more like a performance art piece than a collection of pop songs, underscoring how important their work on the Darwinian opera Tomorrow, in a Year was to their artistic growth. Dreijer is as much of an actress as she is a singer on these tracks, particularly on &quot;Networking,&quot; where her chittering, echoing vocals evoke the spread of a virus or a hive mind turning on itself. Meanwhile, &quot;Fracking Fluid Injection&quot;'s juxtaposition of her cawing cries and increasingly violent, slicing percussion is far subtler -- and more nightmarish -- than merely expressing the earth's suffering as oil is pulled from it. \n\n  Shaking the Habitual is often more scary than it is dark, a distinction that only a group like the Knife could make. Even &quot;Old Dreams Waiting to Be Realized,&quot; which taunts listeners with nearly 20 minutes of slow-building drones, doesn't just set an eerie mood; it's unabashedly confrontational, even if the Knife aren't as direct about it as they are elsewhere on the album. When they are direct about it, it makes for some of their most striking music, whether it's &quot;Without You My Life Would Be Boring&quot;'s pagan pop, the ferociously tribal &quot;Raging Lung,&quot; or &quot;Stay Out Here,&quot; a spine-tingling duet with Light Asylum's Shannon Funchess. Shaking the Habitual isn't as cohesive or accessible as Silent Shout, and after experiencing the whole thing, fans may not return to it often, but it's hard to deny that it's an often stunning work of art. Rawer yet more sophisticated than any of their previous music, it sounds like a skin being shed, and it's a testament to the Knife's skill that they make such formidable sounds so compelling for so long.","torrent":{"xt":"urn:btih:16090a4f81ce04dfa787421ab397497cfc0f4516","amp;dn":"The+Knife+-+Shaking+the+Habitual+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16090a4f81ce04dfa787421ab397497cfc0f4516","infoHashBuffer":{"type":"Buffer","data":[22,9,10,79,129,206,4,223,167,135,66,26,179,151,73,124,252,15,69,22]},"announce":[],"urlList":[]}}