{"title":"Jay-Z - Career Defining Collection (by WiShBone)","uid":8637511,"size":900935567,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:17ce1cd1402c0ca0cb602d27d8a80cbcc5f77659&amp;dn=Jay-Z+-+Career+Defining+Collection+%28by+WiShBone%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"wsbone","files":186,"time":1372797418,"description":"Jay-Z is one of the most successful rappers of our time. This collection is dedicated to attempting to demonstrate why that is (since it is not apparent in the music he makes today).\n\nThis is a collection that spans his career with certain exclusions. For one, the studio albums through Blueprint 2 have been condensed into two full-length custom made albums cutting out what I think was a lot of filler. (If you are looking for Brooklyn's Finest, download my Biggie Torrent). Also, the Black Album, Grey Album, Blue Album, etc. have all been left out because they are readily accessible. All albums after the black album have been omitted as well.\n\nSo what is in this collection? Well, I personally have the opinion that some of Jay-Z's best performances have shown up on other peoples' albums, mixtapes, compilations, soundtracks, etc. So, I arranged 7 albums denoted &quot;Jay-Z Rarities&quot; in what I feel is a tactful order based on time of original release, quality, and listenability. The time period it spans is from 1986-2008. While it is packed with a few laughables, if you are looking for &quot;Umbrella&quot; or &quot;Bonnie &amp; Clyde&quot;, this may not be the torrent for you. However, if you want to hear some great and rare jams where the hungry Jay-Z kills it on a track or where the older, wiser successful Jay-Z still comes off street enough...check this out. I hope you enjoy it. A lot of this is what I choose to listen to when I want to hear the Jigga-man.\n\n\n-WiShBone","torrent":{"xt":"urn:btih:17ce1cd1402c0ca0cb602d27d8a80cbcc5f77659","amp;dn":"Jay-Z+-+Career+Defining+Collection+%28by+WiShBone%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17ce1cd1402c0ca0cb602d27d8a80cbcc5f77659","infoHashBuffer":{"type":"Buffer","data":[23,206,28,209,64,44,12,160,203,96,45,39,216,168,12,188,197,247,118,89]},"announce":[],"urlList":[]}}