{"title":"Ali Lohan - Christmas Magic   (2nafish)","uid":5199695,"size":140097540,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:17cf632d90c8b7303fa57162d4da5a0821531420&amp;dn=Ali+Lohan+-+Christmas+Magic+++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"2nafish","files":-1,"time":1260099235,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nAliana Dee &quot;Ali&quot; Lohan (born December 22, 1993) is an American singer, television personality, model, and actress. She is the sister of actress and pop singer Lindsay Lohan. Following in the foot steps of Lindsay she began her career as a Ford Model, exposing her image to the public since age three. Ali has been in print campaigns for magazines such as Vogue Bambini, Teen Vogue and Rave Girl.\n\nAli Lohan's musical career began when she released her first single, &quot;Rockin' Around The Christmas Tree&quot;, which was featured on the YMC Records' Totally Awesome Christmas in 2005. She shared the bill with musical artists such as Aly &amp; AJ, Jesse McCartney and Hilary Duff. Ali then released her Christmas album, Lohan Holiday, in late 2006 under YMC Records. The album had three singles &quot;Rockin' Around The Christmas Tree&quot;, &quot;I Like Christmas&quot; and &quot;Lohan Holiday&quot; featuring Lindsay Lohan, all of which were critically panned.\n\nDuring 2008, Lohan worked on her second album, Interpersonal, for Maloof Music, a venture of Maloof Productions and Interscope Records. Lohan recorded several tracks for the album at the Palms, Las Vegas. On July 9, 2008, Lohan premiered the first single off her Maloof-produced album to People magazine. Lohan's reality show, Living Lohan, chronicled her journey through recording this track. The single titled &quot;All The Way Around&quot; was released digitally on July 14, 2008. As of November 2009, no release date has yet been announced for this album.\n\nFrom May 26 - July 27, 2008, Lohan starred in the reality television series Living Lohan alongside her mother Dina Lohan. The show focused mostly on the recording of her second album in Las Vegas.\n\nAli made her acting debut as an extra in her sister's film The Parent Trap in 1998.\n\nIn 2008 Lohan appeared in the film version of the R.L. Stine horror/fantasy novel Mostly Ghostly: Who Let the Ghosts Out? as Traci Walker. The film was released directly to DVD on September 30, 2008.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:17cf632d90c8b7303fa57162d4da5a0821531420","amp;dn":"Ali+Lohan+-+Christmas+Magic+++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17cf632d90c8b7303fa57162d4da5a0821531420","infoHashBuffer":{"type":"Buffer","data":[23,207,99,45,144,200,183,48,63,165,113,98,212,218,90,8,33,83,20,32]},"announce":[],"urlList":[]}}