{"title":"Band of Brothers season 01-disc 06","uid":8269133,"size":4681433088,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1940774eefdaff2bf988ec61d2f845e4650c303a&amp;dn=Band+of+Brothers+season+01-disc+06&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"marciohu","files":1,"time":1363565818,"description":"Band of Brothers is a ten-part, 11-hour television World War II miniseries, originally produced and broadcast in 2001, based on historian and biographer Stephen E. Ambrose's book of the same title. The executive producers were Steven Spielberg and Tom Hanks, who had collaborated on the 1998 World War II film Saving Private Ryan.[1] The episodes first aired in 2001 on HBO and are still run frequently on various TV networks around the world.[2][3]\n\nThe series fictionalizes the history of &quot;Easy&quot; Company (part of the 506th Parachute Infantry Regiment, 101st Airborne Division) from jump training in the U.S. to Japan's capitulation and the war's end. The events portrayed are based on Ambrose's research and recorded interviews with actual Easy Company veterans. A large amount of literary license was taken with the episodes, with several differences between recorded history and the film version.[4][5][6] All of the characters portrayed are based on actual members of Easy Company; some of them are recorded in interviews as preludes to each episode (their identities, however, are not revealed until the close of the finale).\n\nThe title for the book and the series comes from the famous St. Crispin's Day Speech delivered by the character of Henry V of England before the Battle of Agincourt in William Shakespeare's Henry V; Act IV, Scene 3. A passage from the speech is quoted on the book's first page, and is also quoted by Carwood Lipton in the final episode.","torrent":{"xt":"urn:btih:1940774eefdaff2bf988ec61d2f845e4650c303a","amp;dn":"Band+of+Brothers+season+01-disc+06","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1940774eefdaff2bf988ec61d2f845e4650c303a","infoHashBuffer":{"type":"Buffer","data":[25,64,119,78,239,218,255,43,249,136,236,97,210,248,69,228,101,12,48,58]},"announce":[],"urlList":[]}}