{"title":"Angola Prison Worksongs (Arhoolie) [FLAC] {MKOP}","uid":7549256,"size":322028810,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:19d81e7ea0b52452a06f96f2e53901319ebc6a9b&amp;dn=Angola+Prison+Worksongs+%28Arhoolie%29+%5BFLAC%5D+%7BMKOP%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mudmashers","files":20,"time":1345430472,"description":"Angola Prison Worksongs (Arhoolie) [FLAC] {MKOP}\n\n''Mournful, soulful classic blues''\n\nAngola Prison Worksongs is a harrowing disc to listen to, not so much for the music as because of the circumstances of the recording. These field recordings from Angola prison, circa 1959, are more valuable as a social-historical document than for purely musical value. These work songs are sung by prisoners to the accompaniment of jackhammers, axes, gravel rakes, shovels, and washboards, while the liner notes give a first-person account of a particularly shameful epoch in American penal history. Not exactly &quot;whistle while you work.&quot;\n\nThe liner notes' attempt to connect these songs with the current crop of prison inmate rap discs seems a bit of a stretch, though, but you do learn the historical context of songs like &quot;John Henry,&quot; and &quot;Stewball&quot; (which showed up on a Willie Dixon-Memphis Slim disc). The obvious connection is with blues, and it does fit. There are two adaptations of Eddie Boyd's &quot;Five Long Years&quot; here, with one by Odea Matthews as she scrubs clothes on a washboard, while the other has more local color -- it's not a great leap to hear echoes of Mardi Gras Indian chants in &quot;I Got A Hurtin',&quot; and especially &quot;Let Your Hammer Ring.&quot;\n\nThere are a cappella vocal exchanges, call-and-response group efforts, the moans on &quot;Alberta Let Your Bangs Grow Long,&quot; but it's a disc that pretty much renders musical judgments superfluous. You could say Matthews is the best singer, since her &quot;Something Within Me&quot; is also very nice. The most jarring piece is Murray Macon singing &quot;Jesus Cares,&quot; in a light, sweet voice with a stamping press metallically clattering behind him like the forerunner of industrial gospel (if that sound exists; and if it doesn't, here's a roots source to invent it from), or the assembly line hammer-down of Captain Beefheart's &quot;Hard Workin' Man&quot; from the Blue Collar soundtrack. But what does saying that mean in this context?\n\nThe four CD-bonus tracks are anti-climactic, and listening to Prison Worksongs will bring you down in the sense that it makes you reflect on ugly, unpleasant truths about aspects of U.S. history. It'll certainly cure any cavalier attitude towards blues lyrics, or apparently innocent Americana imagery, because you'll start thinking twice about how, and where, and why those phrases may have originated.~Don Snowden (Allmusic)\n\n01. Berta - Roosevelt Charles\n02. Take This Hammer - Hogman Maxey\n03. Stewball - Big Louisiana\n04. Five Long Years For One Man - Odea Mathews\n05. Alberta Let Your Bangs Grow Long - Hogman Maxey\n06. I Had Five Long Years - James Russell\n07. Early In The Mornin' - Johnny Butler\n08. All Teamed Up In Angola's Mule Lot - Big Louisiana\n09. I Got A Hurtin' In My Right Side - Willy Rafus\n10. Let Your Hammer Ring - Big Louisiana\n11. Cleaning This Highway - Johnny Butler\n12. John Henry - Robert Pete Williams\n13. Something Within Me - Odea Mathews\n14. Jesus Cares - Murray Macon\n15. Working On The Levee Part 1 (Good Morning Captain) - Emanuel Dunn\n16. Working On The Levee part 2 - Emanuel Dunn\n17. Take This Hammer - Big Louisiana\n18. Pickin' Cotton All Day Long - Creola\n19. My Mule 'Grey' (A Plowing Song) - Emanuel Dunn\n\nMusic Keep On Playing  * Thank You Seeders!","torrent":{"xt":"urn:btih:19d81e7ea0b52452a06f96f2e53901319ebc6a9b","amp;dn":"Angola+Prison+Worksongs+%28Arhoolie%29+%5BFLAC%5D+%7BMKOP%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"19d81e7ea0b52452a06f96f2e53901319ebc6a9b","infoHashBuffer":{"type":"Buffer","data":[25,216,30,126,160,181,36,82,160,111,150,242,229,57,1,49,158,188,106,155]},"announce":[],"urlList":[]}}