{"title":"Fury3 and F!Zone-SX","uid":3668296,"size":444793044,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:1a7cc701e0a8bb8f8c67a3ce20ac02ca207ae4c1&amp;dn=Fury3+and+F%21Zone-SX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"IcySon55","files":13,"time":1177029720,"description":"Fury3 (officially Fury3) is a video game developed by Terminal Reality and published by Microsoft in 1995 for Microsoft Windows. It is not a sequel to Terminal Velocity, but the two games use the same game engine although Fury3&amp;#039;s is redesigned to run natively under Windows 95. It also uses the same basic game mechanics.\n\nLater, an expansion pack called F-Zone was created. After that a full sequel, Hellbender, was made.\n\nPlayers assume the role of a pilot flying a fighter craft to eight worlds (many based on real places, like Mars and New York) controlled by a militant robotic force called Bions. Players fight three missions on each planet. Each of the missions involves destroying vital military targets used by the Bions in order to halt their progress on the planet. Players must then destroy either one or two Guardians who are the commanders of the particular Bion invasion force. Once players are done with one planet, they then move on towards the next one.\n\nThe Bions are not independent thinking machines; they are controlled by the Guardian(s) of the respective planets. The Guardians are far more intelligent than the lesser Bions--their IQ equals that of a super-computer--and destroying them will halt the Bions on the planet.\n\nThere are seven weapons in all, the main being the Servo-Kinetic Laser (SKL), the player&amp;#039;s only weapon at the start of the game. Other weapons such as Vipers (VIP) and Rapid-Fire Lasers (RFL20) are available to collect throughout the game.","torrent":{"xt":"urn:btih:1a7cc701e0a8bb8f8c67a3ce20ac02ca207ae4c1","amp;dn":"Fury3+and+F%21Zone-SX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a7cc701e0a8bb8f8c67a3ce20ac02ca207ae4c1","infoHashBuffer":{"type":"Buffer","data":[26,124,199,1,224,168,187,143,140,103,163,206,32,172,2,202,32,122,228,193]},"announce":[],"urlList":[]}}