{"title":"Star Trek - The Next Generation - Season 6","uid":13896779,"size":8844591471,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1b1ac03af1b991d333ee1641854952f6a741af94&amp;dn=Star+Trek+-+The+Next+Generation+-+Season+6&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"POtHS11","files":43,"time":1458250825,"description":"\nSeason 7\r\nList of Star Trek: The Next Generation episodes\r\n\r\nThe sixth season of the American science fiction television series Star Trek: The Next Generation commenced airing in broadcast syndication in the United States on September 21, 1992 and concluded on June 21, 1993 after airing 26 episodes. Set in the 24th century, the series follows the adventures of the crew of the Starfleet starship Enterprise-D.\r\n\r\nThe season begins with the successful rescue of Data from the nineteenth century, and we learn just how long Guinan has actually known Picard.\r\n\r\nPicard is temporarily assigned away from the Enterprise for a dangerous espionage mission against the Cardassians, but is captured and subjected to torture, nearly succumbing before being released. Deanna Troi engaged in a similarly risky mission of espionage against the Romulans.\r\n\r\nPicard also underwent significant personal development during this season. He formed an intense and troubled romantic relationship with the Enterprise's head of stellar cartography, Nella Daren. After his artificial heart is nearly destroyed, Q helps Picard experience a vision of the unremarkable life he could have led, giving him a better understanding of his mortality and his reasons for living.\r\n\r\nRiker also experiences a deeply personal conflict, making a gripping personal battle with his own sanity, and later discovers an accidental transporter-copy of himself that had been abandoned on a desolate planet for nearly a decade.\r\n\r\nSeveral well-known recurring characters make appearances this season, the most famous among them being Montgomery Scott. The Enterprise engineer from the Original Series is discovered alive, and after an awkward period adjusting to the twenty-fourth century, sets out to explore the galaxy on his own. The sentient hologram Professor Moriarty returns, holding the ship captive in a complex game that he hopes will grant him freedom to live outside the holodeck. Reginald Barclay continues to develop, overcoming his fear of transporters. Q, in addition to his appearance in Picard's counterfactual vision, returns earlier in the season.\r\n[center][image=XzRVrlTuhI][/center]\r\nWe are left with the rediscovery of Lore, leading a group of rogue Borg, who with the influence of an emotional stimulant for androids, successfully seduced Data to become a willing participant in his violent plans in the cliffhanger that ends the season.\r\n\r\n\r\n\r\nTime's Arrow, Part II             \t6x01 \t\r\nRealm of Fear \t                        6x02 \t\r\nMan of the People \t                6X03\r\nRelics                           \t6x04 \t\r\nSchisms \t                        6x05 \t\r\nTrue Q \t                                6x06 \r\nRascals \t                        6x07 \t\r\nA Fistful of Datas \t                6x08 \t\r\nThe Quality of Life \t                6x09 \t\r\nChain of Command, Part I \t        6x10\r\nChain of Command, Part II       \t6x11\r\nShip in a Bottle \t                6x12 \t\r\nAquiel                              \t6x13 \t\r\nFace of the Enemy \t                6x14 \t\r\nTapestry \t                        6x15 \t\r\nBirthright, Part I               \t6x16 \t\r\nBirthright, Part II                \t6x17 \t\r\nStarship Mine                   \t6x18 \r\nLessons                         \t6x19 \t\r\nThe Chase                       \t6x20 \t\r\nFrame of Mind                      \t6x21 \t\r\nSuspicions                       \t6x22\r\nRightful Heir                       \t6x23 \t\r\nSecond Chances                       \t6x24 \t\r\nTimescape \t                        6x25 \t\r\nDescent \t                        6x26","torrent":{"xt":"urn:btih:1b1ac03af1b991d333ee1641854952f6a741af94","amp;dn":"Star+Trek+-+The+Next+Generation+-+Season+6","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1b1ac03af1b991d333ee1641854952f6a741af94","infoHashBuffer":{"type":"Buffer","data":[27,26,192,58,241,185,145,211,51,238,22,65,133,73,82,246,167,65,175,148]},"announce":[],"urlList":[]}}