{"title":"Little River Band - Reminising","uid":9540172,"size":217812180,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1b44d55029ddcc472285f6bcbf5df026be03a9a4&amp;dn=Little+River+Band+-+Reminising&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"musicmister","files":34,"time":1391024899,"description":"An extremely comprehensive but equally enjoyable 34 tracks make up this two-CD set from Australia's Little River Band, including some infamous yet attractive add-ons. Every charted hit from LRB is here, along with some interesting rarities. A cover of Phil Everly's &quot;When Will I Be Loved,&quot; never before issued in the U.S., is a real treat, as well as the potent &quot;Long Jumping Jeweler,&quot; another single that was never released in America. A splendid cover of the Eagles' &quot;Lyin' Eyes&quot; and &quot;Take It Easy&quot; is performed live with Glenn Frey as a nifty little medley, and &quot;Days on the Road&quot; is a stark but attractive B-side addition. The real beauty of this album is uncovered in songs like &quot;We Two,&quot; displaying all the vibrancy and flash exhibited by John Farnham, who took Shorrock's place in 1983. Farnham proves that he's just as fiery on &quot;You're Driving Me Out of My Mind,&quot; with full-blown horns that overspill with dynamic flare. Wavy love songs like &quot;Love Is the Bridge&quot; and &quot;It's Cold Out Tonight&quot; display this band's multifaceted versatility, showing they can sing charming ballads with pristine honesty. Even though favorites like &quot;The Night Owls&quot; and &quot;Reminiscing&quot; cap off the solidness of this compilation, many other of their forgotten songs delightfully complete this hearty anthology. ","torrent":{"xt":"urn:btih:1b44d55029ddcc472285f6bcbf5df026be03a9a4","amp;dn":"Little+River+Band+-+Reminising","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1b44d55029ddcc472285f6bcbf5df026be03a9a4","infoHashBuffer":{"type":"Buffer","data":[27,68,213,80,41,221,204,71,34,133,246,188,191,93,240,38,190,3,169,164]},"announce":[],"urlList":[]}}