{"title":"Darwin's Ghosts: The Secret History of Evolution (2012)","uid":9309254,"size":395274476,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:1b6e17218386e18f564ea4b32b94c7ddf83f0b51&amp;dn=Darwin%27s+Ghosts%3A+The+Secret+History+of+Evolution+%282012%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Robin1966","files":13,"time":1386376610,"description":"Audio Books : History : MP3/Variable : English\n\nRebecca Stott, &quot;Darwin's Ghosts: The Secret History of Evolution (Audiobook)&quot;\n2012 | Unabridged | ASIN: B008ARPISY | Audio CD | 13 h 41 m | MP3 | 376 MB\n\nChristmas, 1859. Just one month after the publication of On the Origin of Species, Charles Darwin received an unsettling letter. He had expected criticism; in fact, letters were arriving daily, most expressing outrage and accusations of heresy. But this letter was different. It accused him of failing to acknowledge his predecessors, of taking credit for a theory that had already been discovered by others. Darwin realized that he had made an error in omitting from Origin of Species any mention of his intellectual forebears. Yet when he tried to trace all of the natural philosophers who had laid the groundwork for his theory, he found that history had already forgotten many of them.\n\nDarwin's Ghosts tells the story of the collective discovery of evolution, from Aristotle, walking the shores of Lesbos with his pupils, to Al-Jahiz, an Arab writer in the first century, from Leonardo da Vinci, searching for fossils in the mine shafts of the Tuscan hills, to Denis Diderot in Paris, exploring the origins of species while under the surveillance of the secret police, and the brilliant naturalists of the Jardin de Plantes, finding evidence for evolutionary change in the natural history collections stolen during the Napoleonic wars. Evolution was not discovered single-handedly, Rebecca Stott argues, contrary to what has become standard lore, but is an idea that emerged over many centuries, advanced by daring individuals across the globe who had the imagination to speculate on nature's extraordinary ways, and who had the courage to articulate such speculations at a time when to do so was often considered heresy.\n\nWith each chapter focusing on an early evolutionary thinker, Darwin's Ghosts is a fascinating account of a diverse group of individuals who, despite the very real dangers of challenging a system in which everything was presumed to have been created perfectly by God, felt compelled to understand where we came from. Ultimately...\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:1b6e17218386e18f564ea4b32b94c7ddf83f0b51","amp;dn":"Darwin%27s+Ghosts%3A+The+Secret+History+of+Evolution+%282012%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1b6e17218386e18f564ea4b32b94c7ddf83f0b51","infoHashBuffer":{"type":"Buffer","data":[27,110,23,33,131,134,225,143,86,78,164,179,43,148,199,221,248,63,11,81]},"announce":[],"urlList":[]}}