{"title":"Notes on a Scandal(multi-subs 4)(2lions-Team)","uid":5462605,"size":4510404966,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:1c08f2ca0e7f96ef2a3ef416bf16027a1c2f615b&amp;dn=Notes+on+a+Scandal%28multi-subs+4%29%282lions-Team%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"JUULTJE","files":-1,"time":1269476483,"description":"Notes on a Scandal (2006) \n\nGenomineerd voor 4 oscars !!\n\nVerenigd Koninkrijk\nDrama\n92 minuten\n\ngeregisseerd door Richard Eyre\nmet Cate Blanchett, Judi Dench en Bill Nighy\n\nTwee vrouwen verstrengeld in gevoelens van verlangen en verraad. Met in de hoofdrollen de voor een Golden Globe genomineerde Judi Dench en Cate Blanchett. Barbara Covett (Judi Dench) is een eenzame onderwijzeres, die bij zowel haar leelingen als collega's bekend staat om haar harde bewind. Ze heeft een eenzaam bestaan en leeft al lange tijd samen met haar kat Portia. Haar wereld verandert wanneer ze kennis maakt met de nieuwe tekenlerares, Sheba Hart (Cate Blanchett). Zij blijkt de aardige, loyale vriendin waar Barbara altijd naar op zoek is geweest. Wanneer Barbara ontdekt dat Sheba een affaire heeft met ÃƒÂ©ÃƒÂ©n van haar jonge leerlingen, verandert de releatie volledig. Ze dreigt Sheba's geheim bekend te maken bij haar echtgenoot (Bill Nighly) en de rest van de wereld. Wat ze zich vooraf niet realiseert is dat haar eigen geheim nu ook boven water dreigt te raken.\n\n\nEngels\n\nThe bitter, cynical and lonely Barbara Covett is a tough and conservative teacher near to retirement that is loathed by her colleagues and students. In the loneliness of her apartment, she spends her spare time writing her journal, taking care of her old cat Portia and missing her special friend Jennifer Dodd. When Sheba Hart joins the high-school as the new art teacher, Barbara dedicates her attention to the newcomer, writing sharp and unpleasant comments about her behavior and clothes. When Barbara helps Sheba in a difficult situation with two students, the grateful Sheba invites her to have lunch with her family. Sheba introduces her husband and former professor Richard Hart, who is about twenty years older than she; her rebellious teenager daughter Polly; and her son Ben that has Down's Syndrome. Barbara becomes close to Sheba, but when she accidentally discovers that Sheba is having an affair with the fifteen year-old student Steven Connolly, Barbara sees the chance to manipulate and get closer to Sheba, hiding the secret from the school headmaster. When Portia dies and Sheba does not stay with Barbara in the veterinary office to see Ben in a theater play, Barbara plots a Machiavellian revenge against Sheba, creating a scandal and consequent turmoil in their lives.  \n\nWeblink http://www.imdb.com/title/tt0465551/\nWeblink http://www.moviemeter.nl/film/34221\n\nVideo               : DVD Rip\nAudio               : Engels Frans\nSubs                : Nederlands Frans Engels Arabisch\nID                  : 0xE0\nFormat              : MPEG Video\nFormat version      : Version 2\nBit rate mode       : Variable\nWidth               : 720 pixels\nHeight              : 576 pixels\nDisplay aspect ratio: 16:9\nFrame rate          : 25.000 fps\nStandard            : PAL\nCover               : Yes\n\n*****************************************\n\nBrought to you by Juultje\n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n\n                          &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl&lt;/a&gt;\n\n2Lions the site to be for all your Dutch MOVIES and more\n\n******************************************\n\n\nDON T HIT AND RUN Niet gelijk afhaken als de FILM binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\nto the fakers , get a life !!!\n\t\t\n\n\n\n","torrent":{"xt":"urn:btih:1c08f2ca0e7f96ef2a3ef416bf16027a1c2f615b","amp;dn":"Notes+on+a+Scandal%28multi-subs+4%29%282lions-Team%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c08f2ca0e7f96ef2a3ef416bf16027a1c2f615b","infoHashBuffer":{"type":"Buffer","data":[28,8,242,202,14,127,150,239,42,62,244,22,191,22,2,122,28,47,97,91]},"announce":[],"urlList":[]}}