{"title":"The Basic Vampire Bible (4 PDF ebooks)","uid":15436366,"size":2001852,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1c33b77bdb41a6d56e29d7620c011f4d4b51f2dd&amp;dn=The+Basic+Vampire+Bible+%284+PDF+ebooks%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"exomystirion","files":4,"time":1469763672,"description":"- - - - - The Basic Vampire Bible (4 PDF ebooks) - - - - -\r\n\r\n1 - The Vampire Bible (pdf)\r\nThe essential Nightside practices of the Vampire religion to include the secrets of Vampirism to draw Lifeforce from human beings, why Vampires never harm others and are barred from criminal acts, how to perform the ancient rites of the Calling of the Undead Gods in magical ritual, and more.\r\n\r\n2 - The Vampire Priesthood Bible (pdf)\r\nThe Nightside Teaching of Opening the Astral Gate for out-of-body experience, and the use of the Necromanteion, an ancient passage to Communion. For the Dayside, a careful examination of the Vampiric God and Vampiric Philosophy.\r\n\r\n3 - Revelations (pdf)\r\nIn 140 pages, Revelations leads you to understand The Vampire Bible by answering the questions you are most likely to have just as others have. Step by step, the words of The Vampire Bible are explained, clarified, amplified, and made more practical for you to use. Originally available only to active subscribing members, Revelations may help you grasp the scope and seriousness of what we do. \r\n\r\n4 - Bloodlines One (pdf)\r\nBloodlines Volume One is a compilation of the best articles from the Temple's monthly newsletter Lifeforce from 1989 to 2002. These articles include information on speculative history, radical life extension, psychic phenomena and the paranormal, Vampiric ethics and politics, interviews with Temple members, and considerably more. If you are seeking additional information about the Temple and Vampirism, Bloodlines is designed to flesh out those gaps and hopefully satisfy your intellectual curiosity. Formerly only available to active members, this book is now also offered to the public to assist in grasping the seriousness of the Vampire religion and to aid in sensing the scope and goals of our international movement.\r\n\r\nAll things come from one source, changing any one thing changes the whole. \r\n- Jason Sorrell\r\n\r\nMeus Opus Magnus","torrent":{"xt":"urn:btih:1c33b77bdb41a6d56e29d7620c011f4d4b51f2dd","amp;dn":"The+Basic+Vampire+Bible+%284+PDF+ebooks%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c33b77bdb41a6d56e29d7620c011f4d4b51f2dd","infoHashBuffer":{"type":"Buffer","data":[28,51,183,123,219,65,166,213,110,41,215,98,12,1,31,77,75,81,242,221]},"announce":[],"urlList":[]}}