{"title":"adguard-6.0+Crack","uid":13456206,"size":582720,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:1c82d50fe81b72938f65abf919ef762d47f62027&amp;dn=adguard-6.0%2BCrack&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"nikitozzzz","files":3,"time":1454847257,"description":"Hello, dear Adguard users!\r\n\r\nToday is the big day, we finally release Adguard 6! We have put a lot of time and effort into its development, and you will see this reflected in the release notes. A lot was added, even more was improved compared to Adguard 5. New version became much more intuitive in use, functional and diverse.\r\n\r\nYou can update to the new version right from the app.\r\n\r\nThe most detailed review of Adguard 6 is available in our blog:\r\n\r\n\r\n[I]Changelog:[/I]\r\n\r\n*Adguard user interface was completely redesigned. It will now have modern tile design.\r\n* Adguard was translated into many new languages. That includes UI, Adguard Assistant and filter descriptions etc. \r\n* Window positions are now memorized and restored after program restart.\r\n* Tray menu is reworked, improved accessibility of different options through tray.\r\n* New versions interface is much more friendly to people with visual impairment.\r\n\r\n* UI performance and boot speed were significantly optimized, memory consumption was greatly reduced.\r\n* Now with the first launch of Adguard a tutorial will be shown, familiarizing user with Adguard and quickly introducing its capabilities.\r\n* Updating to new version from Adguard 5 is now possible and will not lose any settings.\r\n* New possibility to change update channel to 'Beta' and receive all beta updates, including Assistant and other extensions.\r\n\r\n* A new module was added - Stealth Mode. It serves to protect your online privacy in various ways, including blocking of third-party cookies, hiding IP address and many more.\r\n* Improved support for filtered apps. Adguard now automatically finds software installed on your computer and offers to filter its traffic, this includes modern UI applications.\r\n* Filter editor and Filtering log were drastically changed. You will find both fresh design and improved functionality.\r\n* You can now use new search feature to search the whole program for any keyword by entering it in the text field in the top right corner.\r\n* Now it is possible to subscribe to any filter by URL or by choosing path to a local file, and Adguard will automatically watch for changes.\r\n* Extensions were allocated to a separate module which can be enabled/disabled as a whole.\r\n\r\n* Userscripts security was significantly improved.\r\n* Plentiful additions and improvements to filtering process were made, notably introducing support for new rules modifiers and improving filtering speed.\r\n* Many more improvements, all of which are impossible to include in these release notes.\r\n\r\nWe impatiently wait for your comments and impressions!","torrent":{"xt":"urn:btih:1c82d50fe81b72938f65abf919ef762d47f62027","amp;dn":"adguard-6.0%2BCrack","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c82d50fe81b72938f65abf919ef762d47f62027","infoHashBuffer":{"type":"Buffer","data":[28,130,213,15,232,27,114,147,143,101,171,249,25,239,118,45,71,246,32,39]},"announce":[],"urlList":[]}}