{"title":"Speaking Notepad 5.1 Serial Included","uid":4534087,"size":3983630,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:1e3d17de7d2f1ef084297d9efb58a9cc2419a38a&amp;dn=Speaking+Notepad+5.1+Serial+Included&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mcfilthynasty","files":1,"time":1227669674,"description":"Speaking Notepad 5.1\n\n\n\nSpeaking Notepad is handy text editor with powerful text-to-speech capabilities. Speaking Notepad will your TXT, RTF, DOC, HTML and PDF documents, readme's, notes, e-mails and clever and interesting thoughts aloud. With its help you'll cope quickly with routine work at home or in the office. Just imagine, how much easier it is to listen to texts instead of reading them! Give a rest to your eyes! The program will read texts with SAPI4 and SAPI5-compliant high quality voices, different speed and pitches, read clipboard content, record texts into WAV, MP3 or WMA files and even read every word or sentence you are typing. That means you can control your typing aurally without looking fixedly at your monitor.\n\nBefore you buy Speaking Notepad please look through its main advantages over standard Notepad:\n\nMake a present to your eyes\nYour eyes are getting tired during long and intensive work. When you are staring at your monitor your eye muscles strains a lot. Such work at the breaking point of your eye capabilities may cause serious problems with your eyesight in the nearest future. Give a rest to your eyes with Speaking Notepad! Let computer read for you, and your eyes will tell you &quot;Thank you&quot;.\n\nType text without looking at the screen\nYou are typing long text and constantly turning your eyes from keyboard to monitor to control what you are typing? Now you can concentrate only on work and your thoughts because Speaking Notepad can read aloud what you are typing.\n\nListen to e-books.\nWith powerful bookmark management system Speaking Notepad becomes an ideal solution for e-books reading.\n\nRecord your speech!\nWant to bring your texts to another computer in the format of a sound file? Want to learn a foreign language on your own? Want to prepare voice greeting cards? With Speaking Notepad it is as easy as one click.\nKeep your ideas in one-click distance\n\nWrite down interesting thoughts and you'll never forget them. Click a button and Speaking Notepad will read your thoughts aloud!\nYou name it!\n\nSpeaking Notepad can be useful for many purposes. Maybe you'll find new innovative one. Guess an uncommon usage of Speaking Notepad and you'll get a 10% discount for one of our other products. For example, one of our customers told us that once he used Speaking Notepad to play a good April Fool's Day joke over his friends. He called them and Speaking Notepad read greetings to them with different voices.\nAnd at last...\n\nAt last this is just a handy and speedy notepad with vast functional capabilities. We are sure it'll easily replace standard Windows Notepad... or even Microsoft Word!\n\nHow Speaking Notepad 5 differs from previous versions?\n\nFull SpeechAPI 5 support\n\nMulti-language interface support\n\nDifferent visual styles of program\n\nRecord speech into WAV/MP3/WMA sound file easily\n\n... and much more\n\n\nScanned with Kaspersky - Clean\n\nFor more proper up's\n  &lt;a href=&quot;\nhttp://thepiratebay.se/user/mcfilthynasty&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/mcfilthynasty&lt;/a&gt;\n  &lt;a href=&quot;\nhttp://i396.photobucket.com/albums/pp47/mcfilthynasty/mysiggifgif.gif&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i396.photobucket.com/albums/pp47/mcfilthynasty/mysiggifgif.gif&lt;/a&gt;\n\nEnjoy","torrent":{"xt":"urn:btih:1e3d17de7d2f1ef084297d9efb58a9cc2419a38a","amp;dn":"Speaking+Notepad+5.1+Serial+Included","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e3d17de7d2f1ef084297d9efb58a9cc2419a38a","infoHashBuffer":{"type":"Buffer","data":[30,61,23,222,125,47,30,240,132,41,125,158,251,88,169,204,36,25,163,138]},"announce":[],"urlList":[]}}