{"title":"Iron &amp; Wine - 2004 - Our Endless Numbered Days  [EAC - FLAC]","uid":4701509,"size":268771007,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1e5e98751ed40631f9c64575e839cef8c4ff296f&amp;dn=Iron+%26+Wine+-+2004+-+Our+Endless+Numbered+Days++%5BEAC+-+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bludStain","files":-1,"time":1233735960,"description":"Iron &amp; Wine - 2004 - Our Endless Numbered Days  [EAC - FLAC]\n\n\nReview    by Tim Sendra\n\nOn Our Endless Numbered Days, the follow-up to 2002's stunningly good Creek Drank the Cradle, the sound of Iron &amp; Wine has changed but the song remains the same. No longer does Sam Beam record his intimate songs in the intimate surroundings of his home. Instead he has made the jump to the recording studio. As a result the record is much cleaner, less cocoon-like, certainly more the product of someone who has become a professional musician and not someone who just records for fun on a four-track. However, all Beam has sacrificed is sound quality. The sound of the record is still very intimate and simple, with very subtle arrangements that leave his voice and lyrics as the focal point. Luckily all the technology in the world can't affect Beam's voice, which still sounds like it comes right from his lips into your ear as if he were an angel perched on your shoulder. His songs are still as strong and memorable as they were on Creek, no drop off whatsoever in quality. &quot;Naked as We Came&quot; with sparkling melody lovely background harmonies by his sister Sara; the aching folk ballad &quot;Radio War,&quot; which wouldn't sound out of place on Prairie Home Companion, only it would be the best thing you ever heard there; the sad and sweet &quot;Each Coming Night&quot;; the crystalline acoustic guitar ballad &quot;Fever Dream,&quot; which has the kind of vocal harmony between Beam and his sister that seems to be the exclusive domain of siblings; and the soft rock CSNY &quot;Sodom, South Georgia&quot; are the equal of anything on Iron &amp; Wine's debut and match up well with anything Palace, Smog, or their ilk have done lately. A definite plus to recording in a studio and enlisting the help of outside musicians is that there is much more variety to the album and there are lots of small production touches that liven things up like the Native American chants at the close of &quot;Cinder and Smoke,&quot; the pedal steel guitar on &quot;Sunset Soon Forgotten,&quot; and the drums and tambourine on the bluesy &quot;Free Until They Cut Me Down.&quot; Our Endless Numbered Days is very subdued, thoughtful, melodic, and downright beautiful album and the new sound is more of a progression than a sudden shift in values, production or otherwise. Anyone who found the first album to be wonderful will no doubt feel the same about this one. Heck, you might even like it more.\n\n\n01  On Your Wings                 Sam Beam     3:52\n02  Naked as We Came              Sam Beam     2:33\n03  Cinder and Smoke              Sam Beam     5:43\n04  Sunset Soon Forgotten         Sam Beam     3:20\n05  Teeth in the Grass            Sam Beam     2:22\n06  Love and Some Verses          Sam Beam     3:40\n07  Radio War                     Sam Beam     1:56\n08  Each Coming Night             Sam Beam     3:28\n09  Free Until They Cut Me Down   Sam Beam     4:35\n10  Fever Dream                   Sam Beam     4:16\n11  Sodom, South Georgia          Sam Beam     4:59\n12  Passing Afternoon             Sam Beam     4:01\n\n\n","torrent":{"xt":"urn:btih:1e5e98751ed40631f9c64575e839cef8c4ff296f","amp;dn":"Iron+%26+Wine+-+2004+-+Our+Endless+Numbered+Days++%5BEAC+-+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e5e98751ed40631f9c64575e839cef8c4ff296f","infoHashBuffer":{"type":"Buffer","data":[30,94,152,117,30,212,6,49,249,198,69,117,232,57,206,248,196,255,41,111]},"announce":[],"urlList":[]}}