{"title":"Gabrielle - Play To Win - (2004)[EAC- MP3@320KBPS]","uid":4854345,"size":156319626,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1f45d5554b36aba50b04885221f19c86587915ac&amp;dn=Gabrielle+-+Play+To+Win+-+%282004%29%5BEAC-+MP3%40320KBPS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"seanprince","files":22,"time":1239998358,"description":"Gabrielle - Play To Win - (2004)[EAC- MP3@320KBPS]]\n\n\n\nTrack list\n\nGabrielle - Play To Win\n\n01. Ten Years Time 04:15\n02. Sometimes 03:55\n03. Stay The Same 03:50\n04. You Used To Love Me 04:11\n05. Play To Win 04:22\n06. No Big Deal 04:36\n07. Latchkey Kid 04:26\n08. Fallen Angel 03:37\n09. Give And Take 03:54\n10. War Of Two Minds 04:14\n11. Picking Up The Pieces 04:52\n12. Tumbling Down 08:50\n\nBiography by Ed Nimmervoll\n\nBritish house/R&amp;B vocalist Gabrielle began her career singing for free in London West End clubs whilst temping in offices during the day. Her big break came when she recorded a demo, called &quot;Dreams,&quot; based around Tracy Chapman's &quot;Fast Car,&quot; which subsequently fell into the hands of an A&amp;R man at London's Go! Beat records. The track was re-recorded without the Chapman sample and ended up in the Guinness Book of Hit Singles as the highest U.K. chart entry for a debut female act, topping the charts for three weeks. With the hit came a head-turning image, complete with kiss curls and sequined eye patch as Gabrielle's right eye has a drooped lid. Ignoring cosmetic surgery, she turned what might have been seen an image setback into a virtue that set her apart from the pack.\nHer debut album, Find Your Way, sold over a million copies worldwide, and paved the way for her sophomore, self-titled album, released in 1996 and produced by the Boilerhouse Boys. In three short years, those two albums and nine singles -- five of which were Top Ten -- established Gabrielle as the U.K.'s premiere soul vocalist, full of classic soul connotations (Marvin Gaye, Barry White, Bobby Womack) but also influenced by early-'80s British pop (Soul II Soul, Lisa Stansfield, Mantronix).\nIn 2000, Gabrielle followed up with her appropriately titled third album, Rise, which followed a difficult time for her personally and creatively. Widely publicized reports concerning her ex-partner's criminal conviction threatened to overshadow her musical accomplishments, not to mention her creative potential. The songs on Rise spoke of optimism, romanticism, devotion, and a keen survival instinct. The lead single, &quot;Sunshine,&quot; was a spirited thank you to those friends you have on hand to boost your confidence when you're low. The album's title track samples Bob Dylan's classic &quot;Knockin' on Heaven's Door&quot; with his rare seal of approval. 2001's world-wide hit &quot;Out of Reach&quot; was the feature track from the Bridget Jones's Diary soundtrack.\n\nAmazon.co.uk Review\n\nGabrielle's output has never been prolific but it's always been understood that when she does release something, it'll be a gem. Sadly there is nothing on Play to Win that could compete with songs such as &quot;Give Me a Little More Time&quot; or &quot;Dreams&quot;. Less soulful than the usual fare, this album brings Gabrielle's ability as a songwriter to the fore and exposes her talent for personal, introspective lyrics. However, the thoughtful (if not always catchy) songs are bogged down with typically bland and thoughtless arrangements. Acoustic guitar, piano and slide guitar plod along though the first few songs, hovering on the fine line between pleasant easy-listening and apathetic tedium.\nThat is not to say it's all bad--on &quot;Sometimes&quot; a catchy chorus starts to emerge as it does on the title track and gives the proceedings a gentle lift. A standout is &quot;Latchkey Kid&quot;, which sounds heavily influenced by Tracy Chapman but is more akin to the Gabrielle of old. &quot;War of Two Minds&quot; is more soulful than folksy and begins well with Gabrielle using a greater range in her voice, yet it loses its charm when the band kicks in. Play to Win is good in the sense that it's new material from one of the UK's most successful female performers but it's unlikely to be considered one of Gabrielle's finer moments. --David Trueman\n\nAlbum Description\nGabrielle cowrote all the tracks on Play to Win, her fourth studio album, and brings her own experiences of the complexity of life and relationships to each track--something that both new and old Gabrielle fans everywhere will connect with. Play To Win includes the single &quot;Stay the Same&quot;.","torrent":{"xt":"urn:btih:1f45d5554b36aba50b04885221f19c86587915ac","amp;dn":"Gabrielle+-+Play+To+Win+-+%282004%29%5BEAC-+MP3%40320KBPS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f45d5554b36aba50b04885221f19c86587915ac","infoHashBuffer":{"type":"Buffer","data":[31,69,213,85,75,54,171,165,11,4,136,82,33,241,156,134,88,121,21,172]},"announce":[],"urlList":[]}}