{"title":"Zombi - Surface To Air","uid":4185421,"size":64003826,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:205d29936089dcee11eb5144d5b9804555364fe7&amp;dn=Zombi+-+Surface+To+Air&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"billy_stretcher","files":5,"time":1210642425,"description":"Zombi\nSurface To Air\nElectronica/Dark Wave\n2006\n192Kbps\n\n1.Challenger Deep\n2.Digitalis\n3.Legacy\n4.Surface to Air\n5.Night Rhythms \n\n\n\nThe extraordinary two-piece ZOMBI has reappeared with Surface To Air, the long-awaited follow-up to it&amp;#039;s acclaimed debut Cosmos. Surface To Air teems with the stirring, trance-inducing deluges of rhythm and sound the duo is renowned for. Swelling waves of melodic synth ride atop a broad bass and drum foundation. Sequences of repetition roll, build, and unfold with the measured patience of master artisans. Less an album than a moving, breathing mass of symphonic sound; Surface To Air creates boundless moving pictures that are nothing short of breathtaking. \n\nHow exactly a band can combine elements of Goblin, Tangerine Dream and Rush and still be cool enough for hipsters, not to mention open for the likes of Isis,Trans Am and other indie-certified bands, is beyond me, at least on paper. Once I heard Surface to Air, though, it started making a little more sense.\nOn this record, with the exception of the opening track, the duo that is Zombi (one member on drums and one rotating between bass and synths) mixes early Tangerine Dream sequencers, big cinematic synthesizer washes, driving bass lines, and hyper-aggressive drumming into a seamless whole that&amp;#039;s dark and oppressive, and possesses so much forward momentum that I&amp;#039;d imagine even the leeriest indie-kid might get caught up in the ride. At first I was put off a little by &quot;Challenger Deep,&quot; which has little of this momentum and lots of slightly cheesy synths, but once beyond this weak opening track, things get much better. &quot;Digitalis&quot; brings in a punchy sequencer line that reminded me of a similar line from Tangerine Dream&amp;#039;s Ricochet, and &quot;Legacy&quot; sees an earthy bass guitar take over with a simple but powerful melody.\n\nBut the highlight of the album is the 18-minute &quot;Night Rhythms,&quot; which ebbs and flows masterfully, never losing its sense of direction even in the slower and more repetitive middle sections (the insistent sequencers in the background may account partly for this). When a simple but heavy bass line is introduced, the whole composition gains steam, and even though the layering of sequencer, synth, bass and drums is completely straightforward, the duo&amp;#039;s talent for seamless transition between themes and use of repetition to build tension is unimpeachable. When this composition comes to an end, after a closing section that sees the band pounding a syncopated rhythm to death with the sounds of a synthesizer moaning its death throes, one wonders how 18 minutes of such minimal melodies and repetitive rhythms could be quite so captivating.\n\nFar and away an improvement over Zombi&amp;#039;s debut full-length album, Cosmos, this album should be sought out by anyone interested in a modern interpretation of the work started by the likes of Goblin and Tangerine Dream. While it still falls short of being completely engaging for its entire length, Surface to Air is definite evidence of a band on the ups.\n\nEnjoy! :)\n","torrent":{"xt":"urn:btih:205d29936089dcee11eb5144d5b9804555364fe7","amp;dn":"Zombi+-+Surface+To+Air","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"205d29936089dcee11eb5144d5b9804555364fe7","infoHashBuffer":{"type":"Buffer","data":[32,93,41,147,96,137,220,238,17,235,81,68,213,185,128,69,85,54,79,231]},"announce":[],"urlList":[]}}