{"title":"Sasha.Grey.Expose.XXX.DVDRiP.XviD-VBT","uid":6107974,"size":1466750976,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:20855a4016ae6f4e2729b16925650b1b5a34eabb&amp;dn=Sasha.Grey.Expose.XXX.DVDRiP.XviD-VBT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"kelvin09","files":2,"time":1295236443,"description":"Cover\n &lt;a href=&quot;\nhttp://www.seedimage.com/show.php/3317_1.jpg.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.seedimage.com/show.php/3317_1.jpg.html&lt;/a&gt;\n\n\n\nScreens\n\n &lt;a href=&quot;\nhttp://www.seedimage.com/show.php/3316_2.jpg.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.seedimage.com/show.php/3316_2.jpg.html&lt;/a&gt;\n\n &lt;a href=&quot;\nhttp://www.seedimage.com/show.php/3315_3.jpg.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.seedimage.com/show.php/3315_3.jpg.html&lt;/a&gt;\n\n\n\nSasha Grey, DSnoop, Brandon Iron, Lee Bang, Tone Capone, Lefty Larue, Sandra Romain, Sinn Sage, Jennifer Dark, TJ Cummings, Bobbi Starr, Manuel Ferrara, Annie Cruz\n\n\nAlluring, enigmatic Sasha Grey, star of both mainstream film and the filthiest porn, has created quite a few sex scenes with veteran pervert Jake Malone. Sasha Grey ExposÃƒÂ© collects some of the finest hard-core performances of this pale, brunette beauty, with an emphasis on the rougher side of Sasha's oeuvre. The first piece is a throat-fucking marathon from Jake's Gang Bang My Face, in which Sasha portrays a policewoman with a taste for oral degradation at the hands (and penises) of five criminal cocksmen. Their facial abuse is momentarily halted by a latex-masked Annie Cruz, who squats over Sasha's mouth and masturbates to a squirting climax! In a segment from Bitchcraft 2, Sasha and cool Euro-bitch Sandra Romain are a couple of dominant lovers who team up on poor, pretty Sinn Sage, with spitting, flogging, slapping and lots of oral and anal kink. Only after thoroughly breaking the young sweetheart do these mean lesbians allow Sinn a final, squirting orgasm. Next, skinny European brunette Jennifer Dark joins Sasha in a POV double blow job on a big black cock ... this scene is from Mr. Malone's aptly titled We Suck. After the man shoots his load in Sasha's mouth, the ladies enjoy a kissy cum swap. Tall, gorgeous Bobbi Starr is the perfect target for Sasha's fierce libido in a scene from Bitchcraft 4 that's marked by anal rimming, nipple torment, vibrating and electrified toys, toe-fucking (!) and light bondage. And the final scene won Best 3-Way Sex Scene at the AVN Awards: it's a submission fantasy from the movie Fuck Slaves among dominant Sandra Romain, brutal Manuel Ferrara and Ms. Grey in submissive guise. Their epic threesome includes nasty ass-to-mouth anal probing; Sasha getting her tonsils showered by a messy milk enema; heavy face slapping and nipple clamps. All you fans of the iconic Sasha - as well as fanciers of Jake Malone-style perversion - do not pass up this volcanic kink!","torrent":{"xt":"urn:btih:20855a4016ae6f4e2729b16925650b1b5a34eabb","amp;dn":"Sasha.Grey.Expose.XXX.DVDRiP.XviD-VBT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20855a4016ae6f4e2729b16925650b1b5a34eabb","infoHashBuffer":{"type":"Buffer","data":[32,133,90,64,22,174,111,78,39,41,177,105,37,101,11,27,90,52,234,187]},"announce":[],"urlList":[]}}