{"title":"Every Time I Find the Meaning of Life, They Change It - Daniel K","uid":14469451,"size":566871,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:213aca64cc5f3f357d59df5041ee2edb98a23d3e&amp;dn=Every+Time+I+Find+the+Meaning+of+Life%2C+They+Change+It+-+Daniel+K&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Dr.Soc","files":1,"time":1461889204,"description":"Every Time I Find the Meaning of Life, They Change It: Wisdom of the Great Philosophers on How to Live by Daniel Klein\r\n2015 | ISBN: 0143126792 | English | 224 pages | EPUB | 0.5 MB\r\n\r\nA humorous and philosophical trip through life, from the New York Times–bestselling coauthor of Plato and a Platypus Walk into a Bar . . .\r\n\r\nDaniel Klein’s fans have fallen in love with the warm, humorous, and thoughtful way he shows how philosophy resonates in everyday life. Readers of his popular books Plato and a Platypus Walk into a Bar . . . and Travels with Epicurus come for enlightenment and stay for the entertainment.\r\n\r\nAs a young college student studying philosophy, Klein filled a notebook with short quotes from the world’s greatest thinkers, hoping to find some guidance on how to live the best life he could. Now, from the vantage point of his eighth decade, Klein revisits the wisdom he relished in his youth with this collection of philosophical gems, adding new ones that strike a chord with him at the end of his life. From Epicurus to Emerson and Camus to the theologian Reinhold Niebuhr—whose words provided the title of this book—each pithy extract is annotated with Klein’s inimitable charm and insights. In these pages, our favorite jokester–philosopher tackles life’s biggest questions, leaving us chuckling and enlightened","torrent":{"xt":"urn:btih:213aca64cc5f3f357d59df5041ee2edb98a23d3e","amp;dn":"Every+Time+I+Find+the+Meaning+of+Life%2C+They+Change+It+-+Daniel+K","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"213aca64cc5f3f357d59df5041ee2edb98a23d3e","infoHashBuffer":{"type":"Buffer","data":[33,58,202,100,204,95,63,53,125,89,223,80,65,238,46,219,152,162,61,62]},"announce":[],"urlList":[]}}