{"title":"Amber Atoms","uid":7297096,"size":70011590,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:21b9f627ea73cd216d702365fbfebfc98821b196&amp;dn=Amber+Atoms&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SmokeBogey","files":-1,"time":1337913502,"description":"Amber Atoms is a four issue Image series by cartoonist Kelly Yates. Drawn from a deep-rooted love for space-faring sci-fi adventures like Flash Gordon, the titular character promises to lead a breakneck pace of human drama amid aliens, androids and armed space battles. \n\nAmber is a young lady in her late teens or early 20's who still lives with her parents at their family run salvage yard. She's very smart and not afraid to get her hands dirty helping her father in the business. But there's a lot of tension developing between her and her father because she hasn't been encouraged to do anything other than live her life out on their homeworld, Madisomme. Amber thinks he just doesn't understand and her father believes he is protecting her from the big bad galaxy.\n\nHer adventure into the larger world begins when three of the galaxies' deadliest mercenaries arrive at her home looking for an artifact that has untold ramifications. Being this artifact is unknown to Amber, she begins an adventure that leads her to learning about her family name in history.\n\n","torrent":{"xt":"urn:btih:21b9f627ea73cd216d702365fbfebfc98821b196","amp;dn":"Amber+Atoms","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21b9f627ea73cd216d702365fbfebfc98821b196","infoHashBuffer":{"type":"Buffer","data":[33,185,246,39,234,115,205,33,109,112,35,101,251,254,191,201,136,33,177,150]},"announce":[],"urlList":[]}}