{"title":"Unbreakable - Sharon Osbourne.epub","uid":9270086,"size":2914134,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:21f2b01c3d6104c01ad1d1eb201effe5931527a6&amp;dn=Unbreakable+-+Sharon+Osbourne.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1385758691,"description":"Sharon Osbourne's life has always been an extreme rollercoaster ride. And despite her best efforts, the last few years have been the most dramatic and turbulent of all.\n\nIn her gripping new autobiography Sharon reveals the truth behind the headlines. There have been times of huge joy and pleasure - becoming a grandmother for the first time and seeing both Jack and Kelly come through testing times to find happiness and contentment at last.\n\nBut there has also been a lot of heartache. Sharon describes the shocking and unexpected battle to save her thirty-year marriage to Ozzy - and the devastating betrayal that lay behind their separation. She also lived through every mother's worst nightmare when Jack was diagnosed with multiple sclerosis - and writes movingly of her hopes and fears for her beloved son.\n\nA tough but fair judge on the X Factor, Sharon is just as hard on herself. She is honest about the mistakes she has made - from misguided plastic surgery to her battles with her weight and body image.\n\nFilled with laughter, tears and hard-won wisdom, Unbreakable is as funny, frank and fearless as Sharon herself.","torrent":{"xt":"urn:btih:21f2b01c3d6104c01ad1d1eb201effe5931527a6","amp;dn":"Unbreakable+-+Sharon+Osbourne.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21f2b01c3d6104c01ad1d1eb201effe5931527a6","infoHashBuffer":{"type":"Buffer","data":[33,242,176,28,61,97,4,192,26,209,209,235,32,30,255,229,147,21,39,166]},"announce":[],"urlList":[]}}