{"title":"FTV Girls - Ashley &amp; Brianna - Pink Girls","uid":6022988,"size":418087023,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:223569f15d35676c6f61e0292d22968a440bd7db&amp;dn=FTV+Girls+-+Ashley+%26+Brianna+-+Pink+Girls&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"phatwarez","files":-1,"time":1291859251,"description":"FTV Girls - Ashley &amp; Brianna - Pink Girls\n\t\t\t\nAshley's Comments:  Don't we look cute in our little mini dresses all pastel colored and girly?  I had to have my hair in a ponytail for this one.  Gives me a younger look.  This was my chance to be all out sexual with Brianna again and make her remember how fun it was fucking around with me last night.  She's bisexual, but I'm all about women.  I fell and hurt myself in the sand but we washed up when we got home.  'My left side is hanging out', now that was too funny, especially from a toothless wonder looking guy we saw at the store.  I think he was afraid to say 'breast'.  I shot in the pink room place before, and I liked the pictures here.  I didn't expect the big long pink dick we were going to use but Brianna has that totally sexy touch that so gets me off.  She used her spit all over my pussy and lubed me up for the toy and fucked me hard with it.  Its never the same when I use it on myself, so it feels so much better when I'm getting fucked especially from a hottie like her.  I made sure she gets the same treatment from me, but I gave it to her doggy style. I know she likes it, and its better than what she gets from her boyfriend.  I'm sure he isn't anywhere as big or as long as this fuck toy.  I know she enjoyed every minute of it even though she's not used to it.\nBrianna's Comments:  We went out the night before and had so much fun in Scottsdale, but we slept so good in that big bed of theirs in the big FTV house.  I was all fresh and ready for more fun!  We wanted to do a park &amp; swing thing so we went early when nobody would be around in the morning.  It was a lot of fun but Ashley burned her butt on the slide!  I'm not that old yet but it was nice to act like a teen again.  Ashley fingered me on the monkey bars and I ate her out on the car ride.  Then (once again!!!!!!) some guy in a mercedes drives by and starts watching, talking on his cell phone!  The photographer got nervous and sent us back to our car.  Then we went to a cornerstore where we got kicked out after less than a minute of being in there!  I don't see why younger guys have become so anal, its like always the young 20 something types that go freak over us getting naked.  Older guys seem to have no problem with it.  Just look at our quick stay at the quick mart.\nThe room with all the stuffed animals is so cute!  We haven't had any heavy foreplay at all yet so the photographer choreographed a nice scene where I seduce Ashley, first taking her heels off and sucking on her toes, then sucking on her stretchy breasts &amp; nipples, and then moving down to her cookie and licking it all up.  I was so turned on by watching this part of the video, like seeing my tongue where it counts.  When I'm licking a girl I can't really see her cookie so its nice to get this view of my face and her cookie right there.  She's so trim and pretty down there so its always a pleasure for me to give it to Ashley.  It was kind of a fun thing for me to push that big pink toy into her and pound her so hard that I could feel the toy bottoming out in her vagina and pushing against her little cervix.  I got my share of toy pounding too and I really loved it!  It made me come but it also got me really sore afterwards.  Its very enjoyable when you in the heat of it, but after cumming and contracting then you really feel sore.  My cookie needed a break!\n\nScreens (also in torrent):\n &lt;a href=&quot;\nhttp://kopimg.com/images/kopi_856_Ashley_Brianna_Pink_Girl.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://kopimg.com/images/kopi_856_Ashley_Brianna_Pink_Girl.jpg&lt;/a&gt;\n\nFile Size ------- 398mb\nLength ---------- 52:36\nResolution ------ 720x480\nContainer ------- mkv\nVideo Codec ----- x264\nAudio Codec ----- mp3\nFrame Rate ------ 30\n\np h a t w a r e z . t k\nThanks to (anonymous) for the generous seedbox donation.","torrent":{"xt":"urn:btih:223569f15d35676c6f61e0292d22968a440bd7db","amp;dn":"FTV+Girls+-+Ashley+%26+Brianna+-+Pink+Girls","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"223569f15d35676c6f61e0292d22968a440bd7db","infoHashBuffer":{"type":"Buffer","data":[34,53,105,241,93,53,103,108,111,97,224,41,45,34,150,138,68,11,215,219]},"announce":[],"urlList":[]}}