{"title":"Super Learning 2000","uid":8360775,"size":33838866,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2306204dfb0bf1756043b5ef87390bf40c0836fa&amp;dn=Super+Learning+2000&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"melonic777","files":-1,"time":1365618291,"description":"Superlearning 2000 by Sheila Ostrander &amp; Lynn Schroeder with Nancy Ostrander The ideas of accelerated learning set off fireworks for me - learning that releases creativity and joy.\nHelmut Huttenrauch, Chief Trainer, Phillips Communications \n\n\nA marvelous resource. Read and learn about human potential, yours and mine.\nBernie Siegel, MD\n\n\nThis fast-paced bestseller is chockfull of inspiring stories of people who beat the odds. I've been transformed, is a common comment. Full of new breakthroughs - deep mind re-patterning to banish blocks, new routes to supermemory and much more to open potential. Yours for the taking! Up-to-date info on how to Superlearn almost anything and excel at work, school, sports, arts.\n\nConnect with endorphin power. Learn through the dynamics of pleasure, not pain or boredom. More fun and more efficient. Use the secrets of high frequency sound to boost intelligence and creativity. Pick up on high velocity re-training to realize career opportunities 2 to 10 times faster. Get a handle on natural (and legal) substances that can vastly enhance mind &amp; memory. Explore mind machines - high-tech to help you brighten up fast. Find out - how the old are keeping mind &amp; memory young; how preschoolers can leap ahead; how new breakthroughs are beating learning disabilities.\n\nDelacorte, 397p.\nSuperlearning ","torrent":{"xt":"urn:btih:2306204dfb0bf1756043b5ef87390bf40c0836fa","amp;dn":"Super+Learning+2000","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2306204dfb0bf1756043b5ef87390bf40c0836fa","infoHashBuffer":{"type":"Buffer","data":[35,6,32,77,251,11,241,117,96,67,181,239,135,57,11,244,12,8,54,250]},"announce":[],"urlList":[]}}