{"title":"Charlie's Pond - C.L. Heckman","uid":11022411,"size":1515750,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:24c697a201eac861a6d664b51af1b46504b9aac5&amp;dn=Charlie%27s+Pond+-+C.L.+Heckman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"DethHolly","files":6,"time":1410617358,"description":"Samantha Mallon, a typical young girl from the country, is growing up in a less-than-normal home. The one person she used to confide in, her brother Charlie, has now become her biggest fear. With a family consisting of people with flaring tempers, Sam must tread lightly, or suffer the consequences. \n\nA black eye, a broken nose, and a bruised ego are finally enough to convince her to break away from the life that the Mallons have molded for her. Stepping out of her shy demeanor for just a moment, she sparks up a new friendship with Jill, an outgoing tomboy-type girl at her school and begins to enjoy being a teenager. Jill, being carefree and easy going, introduces Sam to a world and people she never knew existed. \n\nSweating from nerves and shaking in her own insecurities, Sam manages to spark the interest of Jake, a regular teenage heartthrob, who just may teach her the meaning of love, an emotion that was absent from her house growing up. However, a drunken party and a physical altercation turn Sam's world completely upside down, and begin a string of physically violent occurrences that start to destroy the positive life she has tried to build. \n\nWhen Sam is an innocent bystander to Charlie's horrific display of rage on less than friendly face, she stands conflicted. Will she stand up against the man she used to look up to, her brother, her childhood best friend, or will she keep the secret safe behind closed lips, forever trapped by fear?\n\n\nFormats: EPUB, MOBI, AZW3, PDF\nASIN#: B00HVOE3VK\nISBN#: 1496000226\nISBN13#: 9781311689603\nPublished: January 9th, 2014\nLanguage: English","torrent":{"xt":"urn:btih:24c697a201eac861a6d664b51af1b46504b9aac5","amp;dn":"Charlie%27s+Pond+-+C.L.+Heckman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"24c697a201eac861a6d664b51af1b46504b9aac5","infoHashBuffer":{"type":"Buffer","data":[36,198,151,162,1,234,200,97,166,214,100,181,26,241,180,101,4,185,170,197]},"announce":[],"urlList":[]}}