{"title":"Microsoft Visual Basic 2008 Step by Step - CD","uid":4019787,"size":29063168,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2511c88e2acff89eac6a50dc8ac8115d8b741169&amp;dn=Microsoft+Visual+Basic+2008+Step+by+Step+-+CD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bobromjinders","files":1,"time":1202604917,"description":"Synopsis\nTeach yourself the fundamentals of working with Visual Basic 2008-one step at a time. With STEP BY STEP, you work at your own pace through hands-on, learn-by-doing exercises. Whether you&amp;#039;re a beginning programmer or new to this specific language, you&amp;#039;ll understand the core capabilities and fundamental techniques for Visual Basic 2008-and rapidly build robust, elegant applications. Each chapter puts you to work, showing you how, when, and why to use the latest features of Visual Basic-guiding you each step of the way as you create actual components and working applications for Windows. You&amp;#039;ll also explore data management and Web-based development topics. PLUS-get practice files with sample code and data sets on the companion CD.\n\nKey Book Benefits:\n\n* Covers the latest enhancements and features of Visual Basic 2008 \n* Provides step-by-step guidance on how to use Visual Basic 2008 with Microsoft         Visual Studio 2008 to create smart-client and Web applications \n* Features easy-to-follow, logically planned lessons in the popular STEP BY STEP format-ideal for anyone with fundamental programming skills \n* Includes a companion CD with data sets and code samples \n\nBiography\nMichael Halvorson is the author or coauthor of more than 30 books, including Microsoft Visual Basic 2005 Step by Step, Microsoft Office XP Inside Out, Microsoft Visual Basic 6.0 Professional Step by Step, and Learn Microsoft Visual Basic 6.0 Now. In addition, Michael is an assistant professor at Pacific Lutheran University. \n\n\nProduct Details\nISBN: 0735625379\n\nISBN-13: 9780735625372\nFormat: Paperback, 624pp\nPublisher: Microsoft Press\nPub. Date: January 2008\nSales Rank: 15,415","torrent":{"xt":"urn:btih:2511c88e2acff89eac6a50dc8ac8115d8b741169","amp;dn":"Microsoft+Visual+Basic+2008+Step+by+Step+-+CD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2511c88e2acff89eac6a50dc8ac8115d8b741169","infoHashBuffer":{"type":"Buffer","data":[37,17,200,142,42,207,248,158,172,106,80,220,138,200,17,93,139,116,17,105]},"announce":[],"urlList":[]}}