{"title":"FSX - BluePrint Simulations - KRDU v2.1.2","uid":3715910,"size":118404295,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:251d38ca556874e172481fd408111c3adf759593&amp;dn=FSX+-+BluePrint+Simulations+-+KRDU+v2.1.2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"4X-AXG","files":11,"time":1182031508,"description":"4X-AXG Proudly Presents:\n\nBluePrint Simulations - KRDU v2.1.2\n\nh**p://www.blueprintsimulations.com/BluePrint_KRDUv2.htm\n\nScenery Description:\n\nBluePrint Simulations? KRDU2010 version 2 scenery depicts the Raleigh-Durham International Airport as it will exist in the year 2010, and it is part of our ?Reality Soon? series.  The current Terminal C, most of which has already been demolished, has been replaced in our scenery by a model of the future Terminal 2 currently under construction.  The model is based on images representing the future terminal building obtained from the official RDU and the project architect?s web sites.   All other major buildings within the airport boundaries, including the current Terminal A, have been portrayed accurately.  Special attention has been paid to the precise location of the terminal, including gates and parking spot locations.  The field layout has been modified to accurately represent the real airport including runways, taxiways, aprons and signage.  Some additional signs have been included to facilitate operations within the simulator environment.\n\nScenery Features:\n\nCustom-made, optimized Gmax models of the terminals, GA, and other service buildings within the airport grounds \nCustom-made, optimized textures for all Gmax generated buildings \nCustom-made, photo real ground textures in and around the airport \nAccurate runway and taxiway layout, including detailed markings, signals, and navigational aids \nCustom-made AI mapping file (AFCAD) \nThe scenery is offered in two versions, one for FS2004 and another for FSX\n\n------------\n\nWith many thanks to Mutant","torrent":{"xt":"urn:btih:251d38ca556874e172481fd408111c3adf759593","amp;dn":"FSX+-+BluePrint+Simulations+-+KRDU+v2.1.2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"251d38ca556874e172481fd408111c3adf759593","infoHashBuffer":{"type":"Buffer","data":[37,29,56,202,85,104,116,225,114,72,31,212,8,17,28,58,223,117,149,147]},"announce":[],"urlList":[]}}