{"title":"Contemporary art of 79 countries (Art Ebook).pdf","uid":12652102,"size":21830037,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2526cea1efacc72bddd6facfa03f6e5e738dfe5c&amp;dn=Contemporary+art+of+79+countries+%28Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STBGD","files":1,"time":1446154932,"description":"1939 NY | Pdf | Eng | 165 pages | 20.8 MB\r\n\r\nHAVING long recognized and appreciated the close relationship which exists between business and art, and desiring to contribute toward increasing the interest of business men in art and of artists in business, Mr. Thomas J. Watson, President of International Business Machines Corporation, himself a patron of the arts, conceived the idea in the autumn of 1937 that paintings from the many countries in which the company is represented would make an interesting and important collection from the viewpoint of business man and artist. Leaders in both groups, with whom he discussed the idea, were enthusiastic. Representatives of the company in seventy-nine different countries were instructed to ask leading art authorities to select the contemporary artists and paintings typical of their countries. Two collections, each representing seventy-nine countries, were assembled. One is now being shown at the International Business Machines Gallery of Science and Art, Palace of Electricity and Communication, Golden Gate International Exposition, San Francisco; the other is on view at the International Business Machines Gallery of Science and Art, Business Systems and Insurance Building, New York World's Fair","torrent":{"xt":"urn:btih:2526cea1efacc72bddd6facfa03f6e5e738dfe5c","amp;dn":"Contemporary+art+of+79+countries+%28Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2526cea1efacc72bddd6facfa03f6e5e738dfe5c","infoHashBuffer":{"type":"Buffer","data":[37,38,206,161,239,172,199,43,221,214,250,207,160,63,110,94,115,141,254,92]},"announce":[],"urlList":[]}}