{"title":"Vir2.Instruments.VI.One.VSTi.DXi.RTAS.AU.HYBRID.DVDR.D1-DYNAMiCS","uid":4093774,"size":8115271118,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:257d653c582864087a34bf07241d2ed6f39b4e6f&amp;dn=Vir2.Instruments.VI.One.VSTi.DXi.RTAS.AU.HYBRID.DVDR.D1-DYNAMiCS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"SilenT-HunteR","files":84,"time":1206204280,"description":"Far more than just a sound library; consider this a major studio\n     upgrade. Vir2 Instruments&amp;#039; VI.ONE is a massive multi-disc sample\n     library encompassing over two thousand instruments, kits, and other\n     sound effects, and is designed to be of maximum usability to musicians\n     across a wide span of genres. The library is packed to the brim with\n     drums (including hundreds of different kits), drum loops, basses\n     (including acoustic, upright, electric, and synth), world and ethnic\n     instruments (organized by geographic regions), sound effects, guitars\n     (acoustic and electric), keyboards, a full collection of orchestral\n     instruments, screaming B3 organs, world-class acoustic pianos,\n     prepared pianos, electric/synth pianos, pop horns and brass, a bank \n     of vintage synths, and cutting-edge synth patches. Across every musical\n     style in the world, VI.ONE is a premium, versatile, and gigantic sound\n     palette.\n     \n     VI.ONE is powered by the Kontakt Player 2 engine, bringing instant\n     access to the sounds via the standalone application, as well as being\n     accessible within sequencers via every major plug-in format:\n     AudioUnit, VST, RTAS, and DXi.\n     \n     \n     Features\n     \n     * Over two thousand patches of instruments across a wide array of    \n       instrument families \n\n     * 21GB core library of samples \n\n     * Optimized onscreen EQ and reverb controls \n\n     * Remote control of various sonic parameters available via MIDI CC \n\n     * Multitimbral operation, supporting up to 64 simultaneous instruments\n       loaded (subject to RAM availability), receiving up to 64 MIDI channels\n       (16 in plug-in mode) \n\n     * General MIDI compatible \n\n     * Kontakt Player 2 engine, supporting standalone operation as well as \n       plug-in operation in all major hosts that support AudioUnit, VST,   \n       RTAS, or DXi plug-ins \n     \n     \n     Compatibility\n     \n     VI.ONE is compatible with both Macintosh and Windows platforms and\n     includes the standalone Kontakt Player 2 application as well as\n     AudioUnit, VST, RTAS, and DXi plug-ins. All of these versions ship \n     in the same box.\n     \n     The Macintosh version requires a G4 1.4gHz or faster, 512MB of RAM, \n     a DVD drive, and OS 10.4.x or higher. It ships as a Universal Binary \n     and is fully compatible with Intel Macs. For optimum performance, Vir2\n     Instruments recommends a G5 or Intel-powered Mac, and a minimum of 1GB\n     of RAM. The library requires 21GB of free hard drive space.\n     \n     The Windows version requires a processor speed of 1.4gHz or higher,\n     512MB of RAM, a DVD drive, and Windows XP SP2 or Windows Vista 32-bit.\n     For optimum performance, Vir2 Instruments recommends a minimum of 1GB\n     of RAM. The library requires 21GB of free hard drive space.\n     \n     VI.ONE will run in standalone mode and is also compatible with every\n     major sequencing package in the world, including but not limited to:\n     Apple Logic and GarageBand, MOTU Digital Performer, Digidesign Pro\n     Tools (TDM, LE, and M-Powered), Steinberg Cubase and Nuendo, Ableton\n     Live, and more.","torrent":{"xt":"urn:btih:257d653c582864087a34bf07241d2ed6f39b4e6f","amp;dn":"Vir2.Instruments.VI.One.VSTi.DXi.RTAS.AU.HYBRID.DVDR.D1-DYNAMiCS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"257d653c582864087a34bf07241d2ed6f39b4e6f","infoHashBuffer":{"type":"Buffer","data":[37,125,101,60,88,40,100,8,122,52,191,7,36,29,46,214,243,155,78,111]},"announce":[],"urlList":[]}}