{"title":"Vampire Chronicles.[J-William]","uid":6893384,"size":12174455,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:25cc1b1484c38f0bdc21823e67e8ff31a9a2fbd7&amp;dn=Vampire+Chronicles.%5BJ-William%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Heterodox","files":-1,"time":1324100793,"description":"Interview With The Vampire\nby Anne Rice\n&quot;I see . . .' said the vampire thoughtfully, and slowly he walked across the room towards\nthe window. For a long time he stood there against the dim light from Divisadero Street\nand the passing beams of traffic. The boy could see the furnishings of the room more\nclearly now, the round oak table, the chairs. A wash basin hung on one wall with a\nmirror. He set his brief case on the table and waited.\n&quot;But how much tape do you have with you?&quot; asked the vampire, turning now so the boy\ncould see his profile. &quot;Enough for the story of a life?&quot;\n&quot;Sure, if it's a good life. Sometimes I interview as many as three or four people a night if\nI'm lucky. But it has to be a good story. That's only fair, isn't it?&quot;\n&quot;Admirably fair,&quot; the vampire answered. &quot;I would like to tell you the story of my life,\nthen. I would like to do that very much.&quot;\n&quot;Great,&quot; said the boy. And quickly he removed the small tape recorder from his brief\ncase, making a check of the cassette and the batteries. &quot;I'm really anxious to hear why\nyou believe this, why you . . .&quot;\n&quot;No,&quot; said the vampire abruptly. &quot;We can't begin that way. Is your equipment ready?&quot;\n&quot;Yes,&quot; said the boy.\n&quot;Then sit down. I'm going to turn on the overhead light.&quot;\n&quot;But I thought vampires didn't like light,&quot; said the boy. &quot;If you think the dark adds to the\natmosphere.&quot;\n&quot; But then he stopped. The vampire was watching him with his back to the window. The\nboy could make out nothing of his face now, and something about the still figure there\ndistracted him. He started to say something again but he said nothing. And then he sighed\nwith relief when the vampire moved towards the table and reached for the overhead cord.\nAt once the room was flooded with a harsh yellow light. And the boy, staring up at the\nvampire, could not repress a gasp. His fingers danced backwards on the table to grasp the\nedge. &quot;Dear God!&quot; he whispered, and then he gazed, speechless, at the vampire....\n\n\ndownload to read more \n\nseed seed seed","torrent":{"xt":"urn:btih:25cc1b1484c38f0bdc21823e67e8ff31a9a2fbd7","amp;dn":"Vampire+Chronicles.%5BJ-William%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25cc1b1484c38f0bdc21823e67e8ff31a9a2fbd7","infoHashBuffer":{"type":"Buffer","data":[37,204,27,20,132,195,143,11,220,33,130,62,103,232,255,49,169,162,251,215]},"announce":[],"urlList":[]}}