{"title":"Loriot Sein grosses Sketch-Archiv DVD 1. iso.","uid":4831048,"size":4372395179,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:266c00e582e8c6f477b6edcebd9d660b562170f1&amp;dn=Loriot+Sein+grosses+Sketch-Archiv+DVD+1.+iso.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"yim","files":4,"time":1239128954,"description":"&quot;Loriot - Sein groÃƒÅ¸es Sketch-Archiv&quot; (Germany). In German. \nCountry:\n                                        West Germany \nLanguage:\n                                        German \nColor:\n                                         Color \n                              File:\n                                        Iso.\n                              Pal. DVD.\nGermany's supreme quality comedy, 18 October 2002\nThe series by German all-round-entertainer Loriot is a real classic! Thanks to its re-release on DVD it has won new fans and reminds his old fans how great and truly enjoyable the series remains to this day.\n\nIn many ways it can be compared to the great &quot;Monty Python's Flying Circus&quot;, even some of the sketch topics are the same. Maybe it is not as absurd and lunatic as the Python classic but tends more to an analytic style like Jacques Tati.\n\nYou can compare for yourself because there is one sketch who was done by Tati first (&quot;Les Vacances de M. Hulot&quot; in 1953), then by the Pythons (in their series &quot;Flying Circus&quot; and also in &quot;And Now For Something Completely Different&quot; in the 1970s) and then by Loriot. It is the sketch with the man who wants to correct a picture and ends up ruining the whole room. BTW: I prefer the earliest version. ;)\n\nLike all of the Python members taken together Loriot convinces in acting out a number of very different characters and also gives a number of hilarious voices to his comic characters. Sometimes it is really difficult to recognize him because of the superb costumes and the make-up.\n\nEveryone else casted in this series was chosen well (I cannot mention them all).\n\nSome topics relate to current events in Germany at the time the series was made. But most of the time the topics are universal and easy to understand for every viewer, esp. when it comes to Loriot's most famous topic: The relationship and communication between men and women.\n","torrent":{"xt":"urn:btih:266c00e582e8c6f477b6edcebd9d660b562170f1","amp;dn":"Loriot+Sein+grosses+Sketch-Archiv+DVD+1.+iso.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"266c00e582e8c6f477b6edcebd9d660b562170f1","infoHashBuffer":{"type":"Buffer","data":[38,108,0,229,130,232,198,244,119,182,237,206,189,157,102,11,86,33,112,241]},"announce":[],"urlList":[]}}