{"title":"Simon &amp; Garfunkel - Bookends (Remastered) [RePoPo] PROPER","uid":4460106,"size":365284156,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:271ae5bf47a42044c460bbdc7c11d7b83a299d12&amp;dn=Simon+%26+Garfunkel+-+Bookends+%28Remastered%29+%5BRePoPo%5D+PROPER&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"repopo","files":-1,"time":1224656176,"description":"THIS RELEASE FIXES A GLITCH THE PREVIOUS UPLOAD HAD AT THE END OF ONE TRACK\n\n\n*******************************************************************************\n                   Simon &amp; Garfunkel - Bookends (Remastered)\n*******************************************************************************\n\nSimon &amp; Garfunkel - Bookends\n\n01.- Bookends Theme (Instrumental)  [00:32]\n02.- Save The Life Of My Child  [02:48]\n03.- America  [03:35]\n04.- Overs  [02:19]\n05.- Voices Of Old People  [02:07]\n06.- Old Friends  [02:35]\n07.- Bookends Theme  [01:24]\n08.- Fakin' It  [03:22]\n09.- Punky's Dilemma  [02:17]\n10.- Mrs. Robinson  [04:07]\n11.- A Hazy Shade Of Winter  [02:17]\n12.- At The Zoo  [02:32]\n13.- You Don't Know Where Your Interest Lies  [02:19]  **\n14.- Old Friends (Demo)  [02:11]   **\n\n\n\n** = BONUS TRACKS, exclusive to this release\n\n\nOriginally Released on March, 1968.  This remastered version, which includes two \nbonus tracks was released on August 21st, 2001.\n\nRipped with EAC, creating a .cue/.wav audio file, preserving the CD structure,  \ngaps and volume levels as in the original CD.\n\n-------------------------------------------------------------------------------\n\nAlbum Review by Bruce Eder\n\nIn March of 1968, Robert Kennedy was still alive and offering a vision for a way \nout to the America that had deeply entrenched itself in the Vietnam War. The \ninner-city rebellions in 1967 had shaken the youth culture's image of their own \nsummer of love in that year. The beginning of America's crippling identity \ncrisis had begun to shudder through the culture that would erupt with the death \nof Kennedy later that spring and the tragedy of the Democratic National \nConvention in Chicago later that summer. Before it was all over, Martin Luther \nKing, Jr. had also lost his life. In pop culture, rock was exploding everywhere \nin Western culture. The impact of the Beatles' Sgt. Pepper's Lonely Heart Club \nBand and the Beach Boys' Pet Sounds -- both made in 1966 -- and the appearance \nof Jimi Hendrix on the pop scene in 1967 had ushered in a new way of making \nrecords, a way that not only referred to and portrayed everyday life but was \npart of its acceptance for what it was before attempting to transcend it. \nEarlier that spring, Simon and Garfunkel had slipped their fourth album into the \nbins with a whisper, the confoundingly literary, profoundly poetic and \nstunningly beautiful Bookends. Columbia Legacy has presented us S&amp;G's entire \ncatalog painstakingly remastered with extra tracks. The sound on these discs -- \nand Bookends in particular -- is amazing. It is literally true that there are \ninstrumental passages and studio atmospherics that have never before been \naudible. As a pair, the two were seemingly equal collaborators with producer and \nengineer Roy Halee on a highly textured, multi-layered song cycle that offered \nobservations on everything from urban crises that were symptomatic of larger \nissues, the prospect of old age and death, the loss and dislocation of those who \ndesperately wanted to inherit an American Dream but not the one offered to them, \nsurreal yet wistful reflections on youthful innocence lost forever to the cold \nwinds of change.\n\nBookends is a literary album that contains the most minimal of openings with the \ntheme, an acoustic guitar stating itself slowly and plaintively before erupting \ninto the wash of synthesizers and dissonance that is &quot;Save the Life of My \nChild.&quot; The uneasy rock &amp; roll that carries the song through its disaster and \nthe revelation of &quot;Oh my grace, I've got no hiding place,&quot; which is the mere \nhint of what is to come in this wide open terrain of the previously familiar but \ncompletely unknown. The classic &quot;America&quot; is next, a folk song with a lilting \nsoprano saxophone in the refrain and a small pipe organ painting the acoustic \nguitars in the more poignant verses. The song relies on pop structures to carry \nits message of hope and disillusionment as two people travel the American \nlandscape searching for it until it dawns on them that everyone else on the \nfreeway is doing the same thing. Its sweetness and sophisticated melodic \ninvention are toppled by the message of the song and it becomes an ellipsis, a \ncipher, turned back on itself into disappearance, wondering what question to ask \nnext. The sound of a lit cigarette is the opening of &quot;Overs,&quot; a balladic study \nin the emptiness at the end of the relationship. The sound of inhaling and \nexhaling of the smoke tells the entire story. Also woven into the mix is a \ntwo-minute field recording of the voices of old people made by Garfunkel, \ncollected from nursing homes and centers for the aged. The disembodied voices \nare chilling and heartbreakingly beautiful in their different observations, \nentire lifetimes summed up in a few seconds. This interlude leads into &quot;Old \nFriends,&quot; which carries the message deeper as the image of two old men sitting \non a park bench in languid statements of life lived ordinarily but poetically \nshare not only their memories but also the commonality of their fear. A horn \nsection threatens to interrupt the reverie, carrying the chaos they feel, their \nlack of control over current events, but is warded off as denial and the \ngentleness of the melody returns and fades into the album's opening theme, \nsuggesting that we preserve our memories. As &quot;Fakin' It&quot; kicks to the fore, we \nfeel the separation inherent in Simon's generational view of the unconscious \nseparation of heart and mind. The tune is as full of hooks as a fishing boat and \nHalee swipes a bit from the Beatles' &quot;Tomorrow Never Knows&quot; and eases orchestral \nlayers into the mix, subtly of course, but ever-present and recognizable \nnonetheless. With &quot;Fakin' It,&quot; the depth of the album's meditation presents \nitself in earnest. Synth lines and handclaps give way to snare drums and \nacoustic guitars, and the first appearance of loss shows itself for what it is, \nthe passing of life, moment by moment, memory by memory so quickly, that \npretending is somehow preferable to the reality of everyday life. When the horn \nsection and strings bring the crescendos and the lyric asserts, &quot;This feeling of \nfakin' it/I still haven't shaken it/I know I'm fakin' it/I'm not really makin' \nit.&quot; Even Leonard Cohen's dark prophecies never stated the case so plainly -- in \na folk-rock tune. The identity crisis inherent in the jazzy &quot;Punky's Dilemma&quot; \nmelds the loss of innocence and childhood with the cynicism of present-day \nliving. The final four tracks of the original album, &quot;Mrs. Robinson,&quot; the theme \nsong for the film The Graduate, &quot;A Hazy Shade of Winter,&quot; and the album's final \ntrack, the George-influenced &quot;At the Zoo,&quot; offer as tremblingly bleak a vision \nfor the future as any thing done by the Velvet Underground, but rooted in the \nlives of everyday people, not in the decadent underground personages of New \nYork's Factory studio. But the album is also a warning that to pay attention is \nto take as much control of one's fate as possible. The bonus tracks, a different \ntake of &quot;Old Friends&quot; and &quot;You Don't Know Where Your Interest Lies&quot; -- which \nended up as the B-side of &quot;Hazy Shade of Winter&quot; -- add dimension to what was \neasily the most ambitious recording of Simon &amp; Garfunkel's career. Its \nproblematic themes, spare yet striking arrangements, and augmented orchestral \ninstrumentation created a backdrop for the sounds of a generation moving through \na workaday world they no longer accepted as real, a world they never understood \nin first place. That S&amp;G never overstate the case here, never preach to the \nconverted but instead almost journalistically observe the questions in the \nprocess of their being asked is a monumental achievement. That they did so in \nthree- and four-minute pop songs is almost inconceivable for the time.\n\n-------------------------------------------------------------------------------\n                      AllMusicGuide Track-by-track Review\n-------------------------------------------------------------------------------\n\nBOOKENDS THEME\n\nAppearing twice on the Bookends album, this piece was used as a link and helps \nto create a sense of unity in this classic record. The first (and very brief) \ninstrumental version is a simple, acoustic guitar reading of the melody, stating \nits theme and feel. The second version features the vocals of Simon &amp; Garfunkel \nand has been used in countless films and television shows that are set in the \n1960s. Capturing the innocence of the era perfectly, the lyrics also have the \ndistinction of looking back with a sense of wistful melancholy. This is most \ninteresting when you consider that the song was written in 1967. Simple, \neffective, and wholly effecting, its one of Paul Simon's classics. \n\nAMERICA\n\nThe pivotal use of &quot;America&quot; in the soundtrack to the film Almost Famous (2000) \ncontinued a trend that was started in part by Mike Nichols' use of Simon &amp; \nGarfunkel songs as a plot device in the 1967 film The Graduate. The former film \nuses &quot;America&quot; -- released originally on the 1968 LP song cycle Bookends -- in \nthe context of a young person leaving home in the restless late '60s, a \nmicrocosm of a whole societal shift. And this is also kind of how the song \nitself works, with the blank-verse lyrics open, offering small, personal \ndetails, almost in jokes: &quot;Let us be lovers we'll marry our fortunes \ntogether/I've got some real estate here in my bag/So we bought a pack of \ncigarettes and Mrs. Wagner pies/And we walked off to look for America/'Kathy,' I \nsaid as we boarded a Greyhound in Pittsburgh/'Michigan seems like a dream to me \nnow.'&quot; It seems like a recollection of a pleasant trip taken by young lovers, an \napparently fictional trip with Simon and his girlfriend from his time in \nEngland, Kathy Chitty ( Simon has explained that, contrary to popular myth, the \ntrip never occurred). But with a grandiose line like &quot;to look for America&quot; and \nthe grand-scale musical arrangement, &quot;America&quot; is quite obviously something more \nambitious than a personal postcard; Simon was observing the trends of his \ngeneration -- the physical restlessness and spiritual bankruptcy that the \nwanderlust signified. Simon, having received training in Brill Building \nsongwriting as a young demo-singer-for-hire, merges -- in the song's masterful \nthird verse -- his Bob Dylan-spurred ambition as an &quot;important&quot; songwriter with \nhis commercial and traditional pop songcraft: &quot;'Kathy, I'm lost,' I said, though \nI knew she was sleeping/I'm empty and aching and I don't know why/Counting the \ncars on the New Jersey Turnpike/They've all gone to look for America.&quot; The first \nline seems like yet another bit of innocuous dialogue between fellow travelers. \nBut with the next line, the song climaxes lyrically; it might simply be a tinge \nthat a relationship is coming to an end, but on a larger scale, Simon feels an \nemptiness, realizing -- in the depressing light of the New Jersey Turnpike -- \nthe pointlessness of his travel and his search, which is not fulfilling his \ninner ache. He might even possibly be predicting a similar dead end for his \npeers. But it is not just a personal disappointment; the narrator goes looking \nfor an America that Walt Whitman and Jack Kerouac have found before him, and he \nfinds no such place; tritely speaking, there is no &quot;there&quot; there. Perhaps not \ncoincidentally, the cinematic song came out the year after The Graduate, a film \nwhich explored similar themes: alienation, emptiness, disappointment, and so on. \nThe lyrical deftness that Simon demonstrates is almost overshadowed by the \norchestrated arrangement, a 6/2 folk rhythm that contains the lovely, lilting, \nsing-song melody. It begins softly, with a rhythm, tempo, and melody that Elliot \nSmith seems to have taken as a template for much of his songwriting -- though \ncertainly the antecedent came from the later Beatles records (especially the \ndrum fills). In fact, &quot;America&quot; can be taken as a &quot;bookend' of the Beatles' \n&quot;She's Leaving Home,&quot; which offers a brilliant look at the \ngrown-child-leaving-parent paradigm from the point of view of the parents. We \nimagine their daughter going off and finding happiness and success in a bigger \nworld than the one she shared with her parents. But that loss of innocence, an \ninnocence which cannot be regained, is a common theme shared with &quot;America,&quot; as \nwell as other Simon songs like &quot;Mrs. Robinson&quot; in its lines: &quot;Where have you \ngone Joe Di Maggio?/Our nation turns its lonely eyes to you.&quot; By the time \n&quot;America&quot; reaches the second chorus, and again for the final chorus, the \narrangement stokes up into something approximating a robust sea shanty -- with \ncymbal crashes and layered harmonies -- thus forming a second template for '70s \nsinger/songwriters; this time one with less subtlety by Neil Diamond on songs \nlike his &quot;America&quot; and some of Billy Joel's early, folky moments, like &quot;Piano \nMan.&quot; \n\nOVERS\n\nA simple yet very effective track from Bookends, &quot;Overs&quot; continues the theme of \naging and the passage of time that fills the first side of the album. In this \ncase, Paul Simon is singing of a love affair on the verge of disintegration. \nSome exquisite, fugue-like passages from Art Garfunkel highlight the mood and \narrangement, which is one of the most subdued and elegant on the album. \nMusically, it is based in a folk-blues style, with Simon's guitar taking a few \nblues explorations that allow the piece to breathe melodically. In some ways, \nthis song is a signpost to some of his 1970s solo work.\n\nVOICES OF OLD PEOPLE\n\nMore of a spoken word audio collage than a &quot;song,&quot; this piece, which was taped \nat convalescent homes in Southern California, helps to underline the feeling of \naging and the passage of time, themes that are indeed paramount. Sometimes sad, \nas well as comical, the voices on the record are touching, especially when you \nconsider the fact that they probably died a few years from the date of \nrecording.\n\nOLD FRIENDS\n\nPerfectly seguing out of &quot;Voices of Old People,&quot; &quot;Old Friends&quot; -- which makes \nreferences to &quot;Bookends Theme&quot; -- is a unifying link on the Bookends album. The \nlyrics look into old age and the changes that may come to be. An elegant and \nornate classical string section dominates the melody along with Paul Simon's \nacoustic guitar. There is also a frightening, dissonant passage, which is very \nreminiscent of Van Dyke Parks' Song Cycle orchestrations, which in turn were \ninfluenced by Charles Ives. This is not the only reference to Parks on the album \n(see &quot;Punky's Dilemma&quot;). \n\nFAKIN' IT\n\nEasily Simon &amp; Garfunkel's most ambitious piece of music to date (1967), &quot;Fakin' \nIt&quot; is a precursor to several other studio masterpieces that would follow, \nnamely &quot;The Boxer&quot; and &quot;Bridge Over Troubled Water.&quot; A virtual suite, the song \nopens and closes with a nod/tribute to the Beatles, with its high-pitched note \n(sounding like bagpipes) backed by marching drums, which is a dead-ringer for \nthe end of &quot;Strawberry Fields.&quot; The first main section of the song is built on a \njazzy- blues acoustic guitar figure from Paul Simon that leads the listener into \na casual atmosphere. The lyrics in this section are an autobiographical account \nof a relationship, and Simon conceived this while in a &quot;hashish reverie.&quot; The \nbuoyancy of the music neatly juxtaposes feelings of doubt and insecurity, which \nis some of Simon's funkiest pop. There is a striking interlude that features the \nvoice of Beverly Martyn, a singer/songwriter that was befriended by the duo \nduring the 1967 period. Like a fantasy cameo in a film, it presents a portrait \nof a man in a past life as a tailor in Europe, named &quot; Mr. Leitch&quot; (a reference \nto Donovan). Oddly, after recording the song, Simon learned that his grandfather \n-- also named Paul Simon -- was a tailor in Vienna. The song returns to the main \ntheme before the Beatles/ &quot;Strawberry Fields&quot; closing. All of this is less than \nfour minutes; it's one of the most striking recordings and songs of the \nlimit-smashing 1967/1968 period.\n\nPUNKY'S DILEMMA\n\nOn the surface, &quot;Punky's Dilemma&quot; is one of the lighter, nonsensical songs on \nthe Bookends album. The casual, almost jazz/ bubblegum feel of the music and \narrangement is almost juvenile, but this is deceptive. Lyrically, part of the \nsong is about a draft dodger and his moral &quot;dilemma.&quot; This is neatly and \ninnocuously set against the pleasures of breakfast food and contentment. But \nperhaps more important are the references to both Brian Wilson and Van Dyke \nParks, who had just been working on the (never completed) Smile album project. \nSpecifically, the references to relationships to food are probably from the song \n&quot;Vegetables.&quot; The sunny, casual, and almost comedic feel of the music and \narrangement were indeed themes of the Smile project, and &quot;Punky's Dilemma&quot; comes \nacross as a tribute rather than a parody. \n\nA HAZY SHADE OF WINTER\n\n&quot;Hazy Shade of Winter&quot; was a sizable hit for Simon &amp; Garfunkel in late 1966, \nreaching number 13, although it's not quite as frequently played or famous as \ntheir biggest smashes. That's unfortunate, as &quot;Hazy Shade of Winter&quot; was one of \ntheir best songs, and certainly one of the toughest and more rock-oriented by a \nduo more noted for being relatively mild and dignified. A brusque, stiff drum \nrhythm sets the pace on the opening instrumental section, built around an edgy, \nup and down guitar riff; the melody and arrangement of the instrumental section \nare duplicated on the track's subsequent vocal choruses. The lyric is one of \nSimon's more downbeat early ones, particularly on the chorus, with its images of \nleaves turning brown (perhaps subconsciously influenced by the brown leaves in \nJohn Phillips' slightly earlier &quot;California Dreamin'&quot;?) and the sky looking like \na hazy shade of winter. Though the verse is less melodically memorable than the \nchorus, it's commendably urgent and well-arranged, particularly in the lonely \nbleats of trumpet after some of the lines, and the part at the ending where the \nbass and a bassoon busily bring the verse to a climax. There's only a brief \nbridge here -- and we're not talking about the 59th Street bridge! -- which, \nthough not as vital a part of the song as the main courses, does serve the \npurpose of adding a little bit more of a dark clouds gathering feel. It's also \nnifty how the song comes to an unexpected dead, final stop on the last chorus, \nafter the line about a patch of snow on the ground. In the 1980s the song was \nrevived from an unexpected quarter, when the Bangles put it on the soundtrack of \nLess Than Zero. \n\nAT THE ZOO\n\nLike many of Simon &amp; Garfunkel's songs of their later period, &quot;At the Zoo&quot; is a \nmulti-leveled piece, combining childish whimsy with serious, poignant social \nstatements. On the surface, the song is a simple take on the pleasures of going \nto the New York City Zoo, complete with a description of the journey there. \nHowever, the lyrics in the final verse describe the dispositions of the \ndifferent animals (&quot;zebras are reactionaries/Antelopes are missionaries&quot;), which \ndraws a parable of human behavior. All of this adds up to the civilized &quot;human&quot; \nworld as the real zoo. Musically, it's a fun and funky romp. Opening with a \ndelicate acoustic guitar pattern, it slips into a walking piano and bass guitar \npattern and also features some excellent studio performances, most notably Hal \nBlaine's drum work. The final section of the song finds the momentum escalating, \nculminating in a neo-African chant from Garfunkel, which foreshadowed the group \n(and Paul Simon's) later forays into what would be called world music. \n\n-------------------------------------------------------------------------------\n","torrent":{"xt":"urn:btih:271ae5bf47a42044c460bbdc7c11d7b83a299d12","amp;dn":"Simon+%26+Garfunkel+-+Bookends+%28Remastered%29+%5BRePoPo%5D+PROPER","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"271ae5bf47a42044c460bbdc7c11d7b83a299d12","infoHashBuffer":{"type":"Buffer","data":[39,26,229,191,71,164,32,68,196,96,187,220,124,17,215,184,58,41,157,18]},"announce":[],"urlList":[]}}