{"title":"Hundred Reasons - Shatterproof Is Not A Challenge","uid":4188489,"size":57960689,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:27486750960d3c8b0f0ea396c1835d793ab0c638&amp;dn=Hundred+Reasons+-+Shatterproof+Is+Not+A+Challenge&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"billy_stretcher","files":15,"time":1210805817,"description":"Hundred Reasons\nShatterproof Is Not A Challenge\nEmo-Core/Rock\n2004\n192Kbps\n\n1 Savanna \n2 Stories With Unhappy Endings \n3 What You Get \n4 The Great Test \n5 Harmony \n6 Lullaby \n7 My Sympathy \n8 80 m.p.h. \n9 Still Be Here \n10 Pop \n11 Truth With Elegance \n12 Makeshift \n\nFront, Back And CD Cover Included.\n\n\nThe second album from Home Counties emotional hardcore stalwarts Hundred Reasons, Shatterproof Is Not a Challenge sees them consolidating the punk-rock revolution they partly sparked off on these shores: one that rejects the snotty rush of UK punk, instead harking back to American post-hardcore touchstones like Fugazi, Quicksand, and At The Drive-In. Hundred Reasons offer a poppy, mainstream take on this most defiantly underground of musical genres, but no qualms, they do it very well: the production clarity demonstrated on &quot;What You Get&quot; and &quot;The Great Test&quot; renders hirsute frontman Colin Doran&amp;#039;s skinny roar in spittle-flecked high-resolution, and supplies an agreeably punchy presence to the twin-guitar interplay handled by Paul Townshend and Larry Hibbitt. And while often vague, Doran&amp;#039;s lyrics frequently attain a sort of tear-pricked emotional resonance: &quot;Sing this with me now/ Try to harmonise this,&quot; goes the mantra-like &amp;#039;Harmony&amp;#039;, gaining strength in every plucky repetition. If there&amp;#039;s any criticism here, it&amp;#039;s that Hundred Reasons appear to have found a successful formula and stubbornly stuck to it: &quot;Pop&quot; sounds uncomfortably like a band ripping off themselves, and even a pair of ballads, &quot;Still Be Here&quot; and &quot;Makeshift&quot;, appear to be tacked on just because that&amp;#039;s what well-rounded rock-albums are supposed to do. In future, a touch more variety would prove a real boon. But in short bursts, Shatterproof Is Not a Challenge remains a bracing example of sturdy, cathartic punk-rock, and we very much suspect that&amp;#039;s exactly what Hundred Reasons were after all along.\n\nEnjoy! :)","torrent":{"xt":"urn:btih:27486750960d3c8b0f0ea396c1835d793ab0c638","amp;dn":"Hundred+Reasons+-+Shatterproof+Is+Not+A+Challenge","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"27486750960d3c8b0f0ea396c1835d793ab0c638","infoHashBuffer":{"type":"Buffer","data":[39,72,103,80,150,13,60,139,15,14,163,150,193,131,93,121,58,176,198,56]},"announce":[],"urlList":[]}}