{"title":"Los Sims 3 [Multi6]","uid":5931592,"size":134297212,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:278320b44601eda6060dc8a630f856ee1635e980&amp;dn=Los+Sims+3+%5BMulti6%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"chusca","files":3,"time":1288792494,"description":"Ã‚Â¡Los Sims 3 en NDS con mÃƒÂ¡s control y mÃƒÂ¡s creatividad que nunca! Por primera vez, podrÃƒÂ¡s disfrutar de de este gran juego de simulaciÃƒÂ³n en Nintendo DS! Crea Sims con personalidades ÃƒÂºnicas, lucha por cumplir sus deseos y controla sus vidas dentro del vecindario. Desbloquea todos los Karma Powers: podrÃƒÂ¡s ayudarlos haciendo que se enamoren de tu Sim en el momento, bendecirlos con el poder de belleza instantÃƒÂ¡nea? o maldecirlos con el enemigo instantÃƒÂ¡neo?. Usa estos poderes con cuidado ya que Ã‚Â¡pueden tener efectos inesperados! SegÃƒÂºn guÃƒÂ­es a tu Sim a lo largo de su vida, podrÃƒÂ¡s completar oportunidades que se te presenten y asÃƒÂ­ desbloquear objetos y otras sorpresas. Ã‚Â¡Disfruta ya del ÃƒÂºltimo simulador en NDS! \nCaracterÃƒÂ­sticas:\n-Primera experiencia de simulaciÃƒÂ³n de Los Sims, en Nintendo DS! Crea cualquier Sim que puedas imaginar y controla su vida. Controla a varios Sims dentro de una misma familia y disfruta de los momentos mÃƒÂ¡s especiales mientras exploras su mundo.\n-Controla el destino de tus Sims. Elige si quieres cumplir el destino de tus Sims y hacer sus sueÃƒÂ±os realidad ? o hacer todo lo contrario. Ã‚Â¿SerÃƒÂ¡n tus Sims mensajeros del diablo, lÃƒÂ­deres mundiales o ladrones expertos? Todo depende de ti.\n-Ã‚Â¡Personaliza el mundo de tus Sims! Por primera vez en DS, construye la casa de tus Sims con herramientas que te permitirÃƒÂ¡n pintar suelos, paredes, personalizar objetos de decoraciÃƒÂ³n, texturas y mucho mÃƒÂ¡s.\n-Desbloquea todos los Karma Powers. Emplea el mayor control sobre tus Sims dÃƒÂ¡ndoles riqueza, belleza o amor ? o quÃƒÂ­taselo todo tan sÃƒÂ³lo con un clic. \n\n","torrent":{"xt":"urn:btih:278320b44601eda6060dc8a630f856ee1635e980","amp;dn":"Los+Sims+3+%5BMulti6%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"278320b44601eda6060dc8a630f856ee1635e980","infoHashBuffer":{"type":"Buffer","data":[39,131,32,180,70,1,237,166,6,13,200,166,48,248,86,238,22,53,233,128]},"announce":[],"urlList":[]}}