{"title":"DxO FilmPack Elite 5.5.3 Build 505 (x64) Multilingual Incl patch","uid":12936519,"size":250051653,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:28a5535777404f71cffba407aefbb1dc6c19acb6&amp;dn=DxO+FilmPack+Elite+5.5.3+Build+505+%28x64%29+Multilingual+Incl+patch&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"OnlyByTheRain","files":2,"time":1449590733,"description":"[b]DxO FilmPack Elite 5.5.3 Build 505 (x64) Multilingual[/b]\r\n\r\n[img]https://dump.bz/storage0/1114/27GRD7Vz0ZFPYueluYsLhwYjTJDVDxVG.jpg[/img]\r\n\r\n[b]DxO FilmPack, a major new version of DxO Labs’ popular analog film simulation and creative effects software, adds 65 even more aesthetically-pleasing renderings and stunning new effects to help photographers give their photos greater emotional impact as well as a unique style, whether in color or in black &amp; white.\r\n\r\nWith DxO FilmPack, photographers can apply to their digital photos all the characteristic color, contrast, and grain of analog films that made photographic history, along with many original looks, filters, tonings, and visual effects — all of which can be infinitely combined and customized.\r\n\r\nFaithfully-restored film quality\r\n\r\nThanks to DxO Labs’ exclusive calibration technologies, DxO FilmPack offers a palette of faithfully-rendered analog film simulations with an unrivaled level of quality in the field.\r\n\r\nTo accurately reconstitute the characteristics of such traditional films as Kodak Ektachrome, Fuji Superia, and Agfa APX, DxO Labs adopted a scientific approach based on taking photos with analog films, having those films developed at highly-reputable professional laboratories — PICTO in France and Duggal in the United States — and following a rigorous digitization process.\r\n\r\nThis approach has resulted in the perfect restoration of the grain, color, contrast, and saturation of 60 legendary color and black &amp; white films, with an authenticity that has been recognized by today’s greatest photographers.\r\n\r\n65 original renderings and effects to bring out photographers’ artistic sense\r\n\r\nDominant colors, blur, pinhole, vignetting, and grain: each new DxO FilmPack designer rendering is based on a careful calibration of grain intensity, contrast, and saturation of film, vignetting, and color filters to lend photos a unique atmosphere.\r\n\r\nA new range of texture, light leak, blur vignetting, and unusual frame effects (Expert edition) allows photographers to give their photos an aged look, to draw attention to a subject, or even to use original photo borders to highlight their images.\r\n\r\nUsers can fully customize every film rendering and effect, offering countless possible combinations.\r\n\r\nOS : Microsoft® Windows VISTA, 7, 8\r\nLanguage : Multilingual\r\n\r\nWhats New:\r\nUpdates: official site does not provide any info about changes in this version[/b]","torrent":{"xt":"urn:btih:28a5535777404f71cffba407aefbb1dc6c19acb6","amp;dn":"DxO+FilmPack+Elite+5.5.3+Build+505+%28x64%29+Multilingual+Incl+patch","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"28a5535777404f71cffba407aefbb1dc6c19acb6","infoHashBuffer":{"type":"Buffer","data":[40,165,83,87,119,64,79,113,207,251,164,7,174,251,177,220,108,25,172,182]},"announce":[],"urlList":[]}}