{"title":"POtHS - Conspiracy - 028 - Toxic Skies - Includes Photos from in","uid":8519494,"size":7384901231,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:291d7d25c3cd4c986f214d955de437663848fb1e&amp;dn=POtHS+-+Conspiracy+-+028+-+Toxic+Skies+-+Includes+Photos+from+in&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"POtHS11","files":-1,"time":1369870641,"description":"PO t HS\n\nPouring Out the Holy Spirit\n\nToxic Skies - Includes Photos from inside 11 Chemtrail Tanker Jets\n\n\n\nPOtHS - Conspiracy - 028 - Toxic Skies - Includes Photos from inside 11 Chemtrail Tanker Jets\n\n\nPOtHS Comment: They are doing this right before your very eyes...open your eyes, get free.  It is always The Banksters that did it.\n\nDescription:\n\n&quot;Toxic Skies&quot; - Geoengineering and Chemtrails:\nIt is remarkable that there are movies now spreading the word about geoengineering aka chemtrails. Opinions are changing as more and more public awareness to the obvious drama going on but being officially denied in the skies....clearly many can see the massive contrast with today's skies and those years Pre-1995 in the US and pre-2000 in the EU and other NATO nations. Today we see a different colour blue and long persistent trails that were just not there before. With incremental increases in the trails it is hoped the gradual increase would appear normal to the masses. As people raise the alarm, a complex game of disinformation, propaganda and a sophisticated counterintelligence operation works 24/7 to discredit the information flowing. The governments are all complicit in a huge program, controlling the weather, food production and costs...together with changing the atmosphere to fascilitate the use of HAARP and other frequency based weapons. The governments are loosing their information war, as admitted by Hilary Clinton and desperate measures are being implemented such as new internet laws, privacy laws and terrorist laws all designed to combat and discredit the truth movement. The corrupt governments hire teams of trolls and shills to post comments on the internet and newspaper comments just to dissuade or upset truthers or persuade them they have it all wrong. This is a massive effort. Illnesses have multiplied exponentially, many of which are linked to chemtrails. Simple rainwater analysis or blood and hair samples can confirm the excessive heavy metals in our system. The UK government published it's 5th report...On the Regulations on Geoengineering in 2009....this program is advanced and the changes are becoming evident. The soil is changing and can easily be verified. They are controlling the weather, creating high and low pressures as desired...moving the jet streams, melting the polar region by design in order to access the rich resources. They also are facilitating the massive release of trapped methane by geoengineering and consequently are causing tremendous climatic problems, which they will try to solve using they ionospheric heaters to save us ( not admitting they caused the problem) and cause much more damage. The corrupt governments are but pawns in a much bigger plan, hundreds of years old to dominate the planet and all resources and people entirely for the control from the obscenely rich elites. The Crown Corporation, the Committee of 300, The Zionists and upper Freemasons, Bilderburg group, CFR and many other NGO's are tools of the Obscenely rich elites planning a NEW WORLD ORDER...a totalitarian technocracy of total enslavement...to be enacted through the&quot; UN agenda 21&quot; aka\n\n\n \nSeed long and Prosper with Blessings from our Father. I have prayed to The Father, Bless all that Seed Long. (I have 4 year old active seeds out there, must be working for some folks!)\n\nEphesians 5:11\n11 And have no fellowship with the unfruitful works of darkness, but rather reprove (expose) them.\n                                             \n\n      :thankyou:    :thankyou:    Thank You JESUS\n\n","torrent":{"xt":"urn:btih:291d7d25c3cd4c986f214d955de437663848fb1e","amp;dn":"POtHS+-+Conspiracy+-+028+-+Toxic+Skies+-+Includes+Photos+from+in","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"291d7d25c3cd4c986f214d955de437663848fb1e","infoHashBuffer":{"type":"Buffer","data":[41,29,125,37,195,205,76,152,111,33,77,149,93,228,55,102,56,72,251,30]},"announce":[],"urlList":[]}}