{"title":"Foo Fighters","uid":3551046,"size":122657768,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:292b0efec94436995b0fead9c17a635ead726f3e&amp;dn=Foo+Fighters&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"neogeo64_36","files":42,"time":1162625889,"description":"Grohl spent four years as the drummer for Nirvana. Unbeknownst to most of Nirvana&amp;#039;s fanbase, Grohl had gradually written a stockpile of songs that he had largely held back from the band for fear of ruining their chemistry. (Grohl has noted in several interviews that he was well aware of the infamous drummer joke: &quot;Q: What did the drummer say just before he got fired? / A: &amp;#039;Hey, guys, let&amp;#039;s try one of my songs!&amp;#039;&quot;) Instead, Grohl occasionally booked studio time to record demos, and even issued a cassette of some of those songs called Pocketwatch under the pseudonym Late! in 1992.\n\n\n[edit] Foo Fighters\n \nOctober 1995 cover of Rolling StoneFollowing Kurt Cobain&amp;#039;s death in 1994, Grohl entered Robert Lang&amp;#039;s Studio in Seattle, with friend/producer Barrett Jones. With the exception of a guitar part on &quot;X-Static&quot; by Greg Dulli of the Afghan Whigs, Grohl played every instrument and sang every vocal on the tracks.[1] Lured to Capitol Records by former Nirvana A&amp;R (and then-Capitol president) Gary Gersh, Grohl had the demo recordings professionally mixed, with the results eventually becoming the Foo Fighters&amp;#039; self-titled debut album.\n\nGrohl didn&amp;#039;t want the Foo Fighters to be a one-man studio project, so he worked to form a band to support the album. Initially, former bandmate Krist Novoselic was a main candidate for the band, but both became concerned that it might portray Foo Fighters as a reincarnation of Nirvana. Having heard through the grapevine about the disbanding of Seattle-based emocore band Sunny Day Real Estate, Grohl drafted SDRE&amp;#039;s bass player, Nate Mendel, and drummer, William Goldsmith. Pat Smear, who was an &quot;unofficial member&quot; of Nirvana after the release of In Utero, was added as a second guitarist, completing the band. The Foo Fighters undertook their first major tour in the spring of 1995, opening for Mike Watt.\n\nThe band&amp;#039;s first single &quot;This Is a Call&quot; was released in June of 1995,[1] and their eponymous debut album was released the next month. &quot;I&amp;#039;ll Stick Around&quot; and &quot;Big Me&quot; were released as singles in the months that followed.\n\n","torrent":{"xt":"urn:btih:292b0efec94436995b0fead9c17a635ead726f3e","amp;dn":"Foo+Fighters","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"292b0efec94436995b0fead9c17a635ead726f3e","infoHashBuffer":{"type":"Buffer","data":[41,43,14,254,201,68,54,153,91,15,234,217,193,122,99,94,173,114,111,62]},"announce":[],"urlList":[]}}