{"title":"World War 2 Era Documentaries","uid":7677768,"size":3875312370,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:29ad6df514faa6b8c9f8642989ebb4f2601784ef&amp;dn=World+War+2+Era+Documentaries&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"johnsgage1836","files":5,"time":1348742326,"description":"This is a collection of five American World War 2 propaganda documentaries. Each are public domain but I think having them is better than having to stream them from some site. Filmed in the 1940's, the video and audio quality is about you'd expect it to be but nonetheless the films contain some of the most incredible battle footage ever recorded.\n\nAttack in the Pacific (1944):\n\nBlack and white film. Details events leading up to the Pacific War and pieces together assorted naval and land battle footage from different operations through out the Aliied island-hopping campaign.\n\nAttack! Battle of New Britain (1944):\n\nBlack and white film. Focuses on the invasion of New Britain during the New Guinea campaign of the Pacific War. Non-combat footage and animations detail the particulars of the assault such as battle order and the requirements of daily life in the jungle. \n\nThe Battle of San Pietro (1945):\n\nQuality black and white film. Centered on the Allied advance into Fascist Italy, the Battle of San Pietro Infine occured just south of Monte Cassino. Described by some as an anti-war film, its graphic footage of dead and wounded American soldiers led to it being censored by the US military. Contains incredible footage of enemy shells hitting the ground, sometimes mere feet from the cameramen. \n\nTo the Shores of Iwo Jima (1945):\n\nColor film. Deatails the invasion of the island of Iwo Jima in the Pacific theater. Beginning with the prelanding bombardment, the film follows American Marines as they advance inland and capture Mount Surabachi. This film was the first time Americans got to see the famous &quot;Raising of the Flag on Iwo Jima&quot; in color. \n\nWith Marines at Tarawa (1943):\n\nBlack and white film. Despite the bad quality of the audio and video, this film is the most incredible war film I've ever seen. Because the cameramen are advancing side by side with the front line Marines as they invade the island of Tarawa, this film contains footage unlike any other. The constant thunderous roar of fired and exploding shells adds to the amazing footage where you're actually able to see the distant muzzle flashes of Japanese weapons as they target front line Marines. To me the most amazing and rare footage shows about a half dozen Japanese infantryman breaking from cover just yards from the Marine front line. No film I've seen better captures the chaos of battle as the Japanese defenders lash out at the Marines from every direction.","torrent":{"xt":"urn:btih:29ad6df514faa6b8c9f8642989ebb4f2601784ef","amp;dn":"World+War+2+Era+Documentaries","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29ad6df514faa6b8c9f8642989ebb4f2601784ef","infoHashBuffer":{"type":"Buffer","data":[41,173,109,245,20,250,166,184,201,248,100,41,137,235,180,242,96,23,132,239]},"announce":[],"urlList":[]}}