{"title":"Radical (2013) (Pdf and Epub) Gooner","uid":14656078,"size":2163639,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:29dc16cb23001a816036e825cdf2e4cabaff8f3e&amp;dn=Radical+%282013%29+%28Pdf+and+Epub%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":3,"time":1463698741,"description":"Radical - My Journey from Islamist Extremism to a Democratic Awakening (2013) (Pdf &amp; Epub) Gooner\r\n\r\nPublisher: WH Allen (2 May 2013)\r\nLanguage: English\r\nISBN-10: 0753540770\r\nISBN-13: 978-0753540770\r\n\r\nBorn and raised in Essex, Maajid Nawaz was recruited into politicised Islam as a teenager. Abandoning his love of hip hop music, graffiti and girls, he was recruited into Hizb ut-Tahrir (the Liberation Party) where he played a leading and international role in the shaping and dissemination of an aggressive anti-West narrative. While studying for his Arabic and law degree, he travelled around the UK and to Denmark and Pakistan, setting up new cells.\r\n\r\nArriving in Egypt the day before 9/11 his views soon led to his arrest, imprisonment and mental torture, before being thrown into solitary confinement in a Cairo jail reserved for political prisoners. There, while mixing with everyone from the assassins of Egypt's president to Liberal reformists, he underwent an intellectual transformation and on his release after four years, he publically renounced the Islamist ideology that had defined his life. This move would cost him his marriage, his family and his friends as well as his own personal security.\r\n\r\nSix years after his release, Maajid now works all over the world to counter Islamism and to promote democratic ideals through his organisation, The Quilliam Foundation, which he co-founded with former Islamist and bestselling author Ed Husain.\r\n\r\nFollowing in the wake of the extraordinary democratic change in the Arab world, that few would have foretold, Radical is Maajid's intensely personal account of life inside and out of Islamic extremism. It also highlights one man's quest to inspire change and challenge extremism in all its forms.\r\n\r\nThis is a hard-hitting memoir of one man's journey into and out of Islamic extremism","torrent":{"xt":"urn:btih:29dc16cb23001a816036e825cdf2e4cabaff8f3e","amp;dn":"Radical+%282013%29+%28Pdf+and+Epub%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29dc16cb23001a816036e825cdf2e4cabaff8f3e","infoHashBuffer":{"type":"Buffer","data":[41,220,22,203,35,0,26,129,96,54,232,37,205,242,228,202,186,255,143,62]},"announce":[],"urlList":[]}}