{"title":"To The Manor Born - S01 - Audio Comedy - MP3 - Slimoo","uid":5715786,"size":285726106,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:2b0c46337c858e605f0de1cb6be2122bbdfb6250&amp;dn=To+The+Manor+Born+-+S01+-+Audio+Comedy+-+MP3+-+Slimoo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"_Slimoo_","files":10,"time":1280088910,"description":"To The Manor Born - Series 01 - Audio Comedy -  - BBC7 via DVB-T\n10 x 30 minute episodes - 128Kbps - Mp3 - Slimoo\n\n\nThe Good Life elevated Penelope Keith from well-respected minor actress to the status of a fully-fledged star, and her next sitcom, To The Manor Born, proved to be equally as popular. \n\n\nShe had already proved adept at milking laughs out of snobbery, and so was ideal in the part of Audrey fforbes-Hamilton, a well-to-do, upper-class elitist who falls on hard times following the death of her husband. So desperate are her financial straits that Audrey is forced to sell her husband's huge Grantleigh Estate and thus move out of its stately manor house, the manor to which she has become accustomed, and into the humble coach-house in the grounds. To make matters worse, the new owner of the manor is a nouveau-riche businessman, Richard DeVere, a man of distant Czech ancestry whom Audrey views as rather common and vulgar because he made his millions in the wholesale grocery business.\n\nAccompanying fforbes-Hamilton on her 'downward spiral' is her loyal but decrepit butler Brabinger, and her close friend Marjory Frobisher. Audrey tries to come to terms with her new social standing and the real world of launderettes, buses and supermarkets, but her deeply ingrained feelings of superiority, and her natural tendency to want her own way, cause her many problems. \n\n\n\nAlso along for the ride are Brabinger, Audrey's loyal but decrepit butler and her close friend Marjory Frobisher.\n\n\nCast:\nPenelope Keith as Audrey fforbes-Hamilton \nAngela Thorne as Marjory Frobisher \nKeith Barron as Richard DeVere \nMargery Withers as Mrs. Poluvicka\nNicholas McArdle as Brabinger\nFrank Middlemass as Ned\n\n\n\nTo The Manor Born - S01 - E01 - The Rhythms of the Earth\nTo The Manor Born - S01 - E02 - The Grapevine\nTo The Manor Born - S01 - E03 - What's In A Name\nTo The Manor Born - S01 - E04 - Vive le Sport\nTo The Manor Born - S01 - E05 - Sons Of The Fathers\nTo The Manor Born - S01 - E06 - A Wife's Prerogative\nTo The Manor Born - S01 - E07 - The Spare Room\nTo The Manor Born - S01 - E08 - An Englishman's Home\nTo The Manor Born - S01 - E09 - The Honours List\nTo The Manor Born - S01 - E10 - Plenty More Fish\n\n\n\nAudio Format    : MP3\nDuration Approx : 28mn 54s\nBit rate mode   : Constant\nBit rate        : 128 Kbps\nChannel(s)      : 2 channels\nSampling rate   : 44.1 KHz\nResolution      : 16 bits\n \n\n\n[","torrent":{"xt":"urn:btih:2b0c46337c858e605f0de1cb6be2122bbdfb6250","amp;dn":"To+The+Manor+Born+-+S01+-+Audio+Comedy+-+MP3+-+Slimoo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b0c46337c858e605f0de1cb6be2122bbdfb6250","infoHashBuffer":{"type":"Buffer","data":[43,12,70,51,124,133,142,96,95,13,225,203,107,226,18,43,189,251,98,80]},"announce":[],"urlList":[]}}