{"title":"The Jimi Hendrix Experience - Hey Joe [Beat Club live, 1967].VOB","uid":11624524,"size":177856516,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:2b85a4b0a03c5ba771f53c3994bf724477f688ef&amp;dn=The+Jimi+Hendrix+Experience+-+Hey+Joe+%5BBeat+Club+live%2C+1967%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1417603224,"description":"The Jimi Hendrix Experience - Hey Joe [Beat Club live, 1967].VOB\n\n\nHQ very rare live performance music video from a promo DVD. &quot;Hey Joe&quot; is an American popular song from the 1960s that has become a rock standard and as such has been performed in many musical styles by hundreds of different artists. &quot;Hey Joe&quot; tells the story of a man who is on the run and planning to head to Mexico after shooting his wife. However, diverse credits and claims have led to confusion as to the song's true authorship and genesis. The earliest known commercial recording of the song is the late-1965 single by the Los Angeles garage band The Leaves; the band then re-recorded the track and released it in 1966 as a follow-up single which became a hit. Currently, the best-known version is The Jimi Hendrix Experience's 1966 recording, their debut single. The song title is sometimes given as &quot;Hey Joe, Where You Gonna Go?&quot; or similar variations.\n\nThe ex-bassist for The Animals, Chas Chandler, who was now focusing on managing other acts, had also seen Rose performing the song at the Cafe Wha? in New York City and was looking for an artist to record a rock version of &quot;Hey Joe&quot;.[37][38] Chandler discovered Jimi Hendrix, who had also been playing at the Cafe Wha? in 1966 and performing an arrangement of &quot;Hey Joe&quot; inspired by Rose's rendition.[38] Chandler decided to take Hendrix with him to England in September 1966, where he would subsequently turn the guitarist into a star.\n\nReleased in December 1966, Hendrix's version became a hit in the United Kingdom, entering the Top 10 of the UK Singles Chart in January 1967 and peaking at #6. The single was released in the United States on May 1, 1967 with the B-side &quot;51st Anniversary&quot; but failed to chart. &quot;Hey Joe&quot;, as recorded by The Jimi Hendrix Experience, with backing vocals by the Breakaways, remains the best-known version of the song and is listed as No. 201 on Rolling Stone magazine's The 500 Greatest Songs of All Time. In 2009 it was named the 22nd greatest hard rock song of all time by VH1. &quot;Hey Joe&quot; was the last song Jimi Hendrix performed at the Woodstock festival in 1969 and as such, it was also the final song of the whole festival. The song was performed after the crowd, comprising the 80,000 who hadn't yet left the festival, cheered for an encore.\n\n\nThe Jimi Hendrix Experience was an English-American rock band that formed in Westminster, London, in October 1966. Composed of singer, songwriter, and guitarist Jimi Hendrix, bassist and backing vocalist Noel Redding, and drummer Mitch Mitchell, the band was active until June 1969. During this time they released three successful studio albums. After Redding left the band in mid-1969, Hendrix and Mitchell continued to work together on other projects. The Experience reunited in 1970, with Billy Cox on bass, until Hendrix's death in September. Redding died in 2003, and Mitchell died in November 2008.\n\nWidely recognized as hugely influential in the development of the hard rock and heavy metal music genres during the late-1960s and beyond, the Experience was best known for the skill, style and charisma of their frontman, Hendrix, who has since been called one of the greatest guitarists of all time by various music publications and writers. All three of the band's studio albums, Are You Experienced (1967), Axis: Bold as Love (1967) and Electric Ladyland (1968), were featured in the top 100 of the Rolling Stone list of The 500 Greatest Albums of All Time, at positions 15, 82 and 54 respectively. In 1992, the Jimi Hendrix Experience was inducted into the Rock and Roll Hall of Fame.\n(video has a semi-transparent white &quot;vh1 classic&quot; logo at the bottom right)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Hey_Joe#Tim_Rose_and_Jimi_Hendrix_.281966.29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Hey_Joe#Tim_Rose_and_Jimi_Hendrix_.281966.29&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/kAILaaaga&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/kAILaaaga&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic:     \n   Video: MPEG2 Video 720x480 (4:3) 29.97fps 8000kbps\n   Audio: Dolby Digital AC3 48000Hz stereo 384kbps\n   Duration: 00:03:29\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.7.7\n\n*Media Player Classic Home Cinema*         &lt;a href=&quot;\nhttp://mpc-hc.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.org/&lt;/a&gt; \n\nSgtRlee (Sgt.R.Lee)","torrent":{"xt":"urn:btih:2b85a4b0a03c5ba771f53c3994bf724477f688ef","amp;dn":"The+Jimi+Hendrix+Experience+-+Hey+Joe+%5BBeat+Club+live%2C+1967%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b85a4b0a03c5ba771f53c3994bf724477f688ef","infoHashBuffer":{"type":"Buffer","data":[43,133,164,176,160,60,91,167,113,245,60,57,148,191,114,68,119,246,136,239]},"announce":[],"urlList":[]}}