{"title":"FS2004 - AFS Design Dyn`Aero MCR-01 Utralight","uid":4079434,"size":16065930,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:2c9b4100e038089d3625c566cc4d5f2494cfe9c3&amp;dn=FS2004+-+AFS+Design+Dyn%60Aero+MCR-01+Utralight&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"madasahatter","files":1,"time":1205453126,"description":"AFS-design MCR-01 ultralight \n \n \nAFS-design brings a excellent rendition of Dyn&amp;#039;Aero MCR-01 ultralight. \n \nThe MCR 01 Sportster ULC(LSA) ultralight is a side by side two-seater airplane with incredible performance and capability. Fast and agile, the VLA was specially designed to reach top speed while providing the most enjoyable experience to pilots \n \nThe MCR 01 is a very high performance aircraft, that can cruise as fast as 300 km/h with only a 100 hp engine, at very low cost. Thanks to the highest level of technology available, and very light material, the Sportster has a very efficient direct control system that guarantees the same satisfaction as flying a fighter jet.\n \nThe MCR 01  has been designed around high safety standards and wings efficiency, providing both extreme exibility and easy flight characteristics. Equipped with a 80 HP engine and a fix pitch propeller, it is the ideal airplane for intensive use in flight school operations or aviation clubs.With a 100 HP engine and a constant speed propeller, it becomes an efficient high performance airplane combining fast cruising speed and easy handle characteristics.\n \nThe MCR 01  characteristics lie in its unique wing design, involving a greater span and area, as well as split double slotted fowler flaps and ailerons. This sophisticated wing concept allows the MCR 01  to reach an unprecedented maximum to stall speed ratio of 4, although it guarantees a very gentle behavior in rough air conditions and a high safety level.\n \n \nThe MCR-01 Ultralight AFS-design product features the following:\n \n7 different visual models covering the Aero Light Club Strausberg-Berlin, Germany. \nPrivate textures of France, United Kingdom, Switzerland, Austria, Germany, Canada, United States and more...\n \n2 different mask 1 for repainter - make your own model of MCR !! \nNew Model of authentic MCR - Dyn&amp;#039;Aero support !\nNew Sound of real MCR-01 with authentic start engine sound !\n \nPanel is complete and full in function with AFS-design - XML gauges: gps_500, Bendix-King Radio Xpndr, Altimeter, Vertical Speed, RPM Indicator, Fuel, Oil, Temperature, Pitch Trim, Clock, Flaps, Libelle, Airspeedkn, Fuelpump, Lightnavigation, Lightstrobe, Intercom, starter lock, Compass, Attitude and many other gauges...\n \nHigh detail textures with realistic effects, reflective areas, specular shine and accurate external lighting. A complete 3D virtual cockpit featuring animated control surfaces, custom gauges, night lighting, high textures, fully interactive and more... \n \nNew animations feature in external model and virtuall cockpit are: detailed landing gear, rolling wheels, steerable nosegear, canopy, pilot ladder, strobe and navigation lights, folding wings, realistic propeller effect on full power, brake parachute AND virtual cockpit and many more... \n \nDetailed and easy to fly flight model with auto-trim and real animations feature of flaps and canard wings for aerodynamically unstable","torrent":{"xt":"urn:btih:2c9b4100e038089d3625c566cc4d5f2494cfe9c3","amp;dn":"FS2004+-+AFS+Design+Dyn%60Aero+MCR-01+Utralight","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c9b4100e038089d3625c566cc4d5f2494cfe9c3","infoHashBuffer":{"type":"Buffer","data":[44,155,65,0,224,56,8,157,54,37,197,102,204,77,95,36,148,207,233,195]},"announce":[],"urlList":[]}}