{"title":"Fact or Fiction  (Channel 4 - 2001 - Complete Series)","uid":6628168,"size":1674126967,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:2d73c427c2084dc0777c73c63a94af506712e169&amp;dn=Fact+or+Fiction++%28Channel+4+-+2001+-+Complete+Series%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"neil1966hardy","files":46,"time":1314230284,"description":"Boudica:\n\nTony Robinson continues his quest to uncover the real lives and histories behind some of our greatest legendary heroes. Famous for her long red hair, her chariot with blades on its wheels and her fight for justice and independence over the brutal Romans, Tony goes in search of the first iron lady of Britain - Boudica.\n\nBoudica has come to symbolise the indomitable strength of Britain, but as Tony retraces her incredible path from her home in Norfolk to Colchester, London and on to her final stand in the Midlands, he discovers a different story. It is the story of the real queen Boudica; a Roman collaborator who was prone to extreme, disorganised violence and disturbing Druidic rituals.\n\n\nBraveheart:\n\nTony Robinson goes on the trail of William Wallace, the Scottish warrior whose story was told in the film Braveheart. But tracking down the man behind the myth proves difficult, as Tony is led into a complex story of murder, treason and war atrocities very different from the swashbuckling tale known to Mel Gibson fans.\n\n\nKing Harold:\n\nTony Robinson reveals the real story behind the last great Anglo Saxon king. Far from being just the loser at the Battle of Hastings, Harold was a charismatic leader who, but for a cruel twist of fate would be regarded today as a national hero. It was after all, Harold that led the English into battle at Stamford Bridge and brought an end to the Viking invasions.\n\nHe was a chivalrous man, a true diplomat and skilled military strategist. The programme also reveals how he really met his death and the location of his grave, his devotion to his wife and his love of hawking. King Harold's rise to power is a dynastic tragedy of deception, murder and betrayal.\n\n\nRobin Hood:\n\nThere are few legends more famous than that of Robin Hood, the dispossessed nobleman hiding out in Sherwood Forest at the time of Richard the Lionheart.\n\nTony embarks on a quest to uncover the fact behind the fiction. Did Robin actually exist? What was he really like? Did he steal from the rich to give to the poor? Who were the merry men?\n\nTony's journey takes him all over England: from Yorkshire to Shropshire, Warwickshire, Kirklees Priory; to investigate the colourful legend of Robin's death; and, eventually, Sherwood Forest.\n\nWith the help of historic records, expert contributions and ancient ballads, Tony lines up four main suspects tying them into relevant historical events, such as the proliferation of the longbow and the Lancastrian Revolt.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:2d73c427c2084dc0777c73c63a94af506712e169","amp;dn":"Fact+or+Fiction++%28Channel+4+-+2001+-+Complete+Series%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d73c427c2084dc0777c73c63a94af506712e169","infoHashBuffer":{"type":"Buffer","data":[45,115,196,39,194,8,77,192,119,124,115,198,58,148,175,80,103,18,225,105]},"announce":[],"urlList":[]}}