{"title":"Dei Gratia EU4 mod","uid":10649926,"size":5277856,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:2d7f889361ccbb1b28e2d90602829c778dd6c09d&amp;dn=Dei+Gratia+EU4+mod&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Nimbleton","files":-1,"time":1406596388,"description":"Dei Gratia EU4 mod\n\n\nExtract 7zip file into your C:Users [user] Documents Paradox Interactive Europa Universalis IV mod folder\n\n\n\n\n\nCompatibie with v1.7/Res Publica\n\nDei Gratia enhances religion in the age of faith and reason.\n\nNew Religions - Religious Minorities - Religious Turmoil - Religious Ideas - Piety, Church Influence and Religious Toleration - HUNDREDS of New Events and Decisions\n\nIt's back! One of the most downloaded mods for EU3 is being updated for EU4.\n\nNOTE: This changes the checksum, so is not compatible with ironman/achievement mode.\n\n\n\nDei Gratia features: New Religions: There are 34 religions, including Sikhs, Hussites and Jews. Each religion has been carefully balanced and described with bonuses and maluses that reflect its historical and social characteristics. Many religions also have dedicated events to give them flavour, such as the Sikh event chain which founds the religion in India, or Mahayana events which give Japanese players the chance to gain the support of warrior monks - or crush them. Religious Minorities: Each province can be (and often is) divided into several religions. Depending on your tolerance of their faith, minorities can help you or hurt you. There are events dedicated to these minorities in your empire, and decisions to allow you to convert or expel them. This also means converting provinces is no longer quite as fast or simple as it used to be. Religious Turmoil: Heretics and heathens can choose to rise up against you if they think they can win, and trying to expel a minority could lead to a war of religion! Take advantage of a rival's war of religion to help spread the faith - or just seize a few provinces. Be careful converting yourself, because if you get unlucky, an heir to the throne might decide to convert the nation back to its old faith. Piety System: All religions now get access to piety. The higher your piety, the more religious events and triggered modifiers you will get, and the more powerful they become - for good or ill. Or go the reverse and watch as religious events and decisions become rare and irrelevant! Instead of random events affecting piety, the decisions you make and the national ideas you choose will give you a permanent, slowly changing level of piety. New events and decisions: As of April 21, 2014, there are 717 new events and 257 new decisions in Dei Gratia. 97% of the ones from the EU3 version of the mod have been updated into the current one, and work continues to update and rework the old files into the new event system in addition to adding new events and decisions where possible. Visit the Paradox Forum the author reads daily.","torrent":{"xt":"urn:btih:2d7f889361ccbb1b28e2d90602829c778dd6c09d","amp;dn":"Dei+Gratia+EU4+mod","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d7f889361ccbb1b28e2d90602829c778dd6c09d","infoHashBuffer":{"type":"Buffer","data":[45,127,136,147,97,204,187,27,40,226,217,6,2,130,156,119,141,214,192,157]},"announce":[],"urlList":[]}}