{"title":"(2013) Rodan - Fifteen Quiet Years [FLAC] {100.XY}","uid":9804621,"size":319300994,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2e5dc209893d87c9f784135008a9378ee87b43b0&amp;dn=%282013%29+Rodan+-+Fifteen+Quiet+Years+%5BFLAC%5D+%7B100.XY%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"100.XY","files":-1,"time":1395438425,"description":"Rodan - Fifteen Quiet Years\n\n\nWikipedia:\nRodan was an American math/post-hardcore band in the early to mid-1990s. The best known lineup of the band consisted of Jeff Mueller (guitar/vocals), Jason Noble (guitar/vocals), Tara Jane O'Neil (bass/vocals), and Kevin Coultas (drums)\nThe music of Rodan is dynamic and complex. Its extremes are well demonstrated within the first two tracks of the group's 1994 recording Rusty. The album introduces us to the band with the rich, chiming layers of &quot;Bible Silver Corner&quot;, a neo-Classical guitar-and-bass piece that passes through several movements, never getting loud over its near-seven-minute duration and often employing dissonance. The next track is the sharply contrasting hardcore &quot;Shiner&quot;, a two-and-a-half minute discharge of off-kilter rhythms and spastic vocal blasts. Many musical ideas are explored in each song, sometimes serene and other times violent and tense. The vocals are often spoken or whispered in places, while punctuated by wails and shouts in others. The three guitarists handle vocal duties, some songs being sung/spoken by one person and others being done by all three musicians.\nRodan is noted for being from the same music scene as Slint, and many comparisons have been made between the two.\n\n\nReview:\nIn the 1990s, I thought of the Louisville quartet Rodan as the punk Slint: They made dark, aggressive, mathy post-hardcore with tons of moving parts, and words that were sung, screamed, and spoken. Slint's second album, Spiderland, was released in 1991, and was almost immediately spoken about in hushed tones. It's rare to see an instant classic, but Spiderland was (deservedly) just that.\nRodan were a younger band taking cues from Slint, but going in a different direction. Not as many people knew about them; some that did discounted them as Slint Jr. During this period, Nevermind and Seattle ruled the popular conscious, but for a number of people, Louisville, Kentucky, was more important. There was Slint, of course, and Will Oldham, the guy who took the photo on the cover of Spiderland. There was also associated acts, Squirrel Bait and Bastro, as well as Antietam.\nMore than any of these bands, Rodan felt like our Louisville band. You knew members of Rodan lived together in a place in Louisville called the Rocket House, and you wanted to go there. I remember 60 or so people packing into a tiny art gallery in Manhattan to watch Half-Cocked, a road movie by Sleepyhead bassist Michael Galinsky and his partner Suki Hawley that starred Rodan and featured cameos from members of Unwound, Helium, Polvo, Freakwater, the Grifters, Versus, Slant 6, and others. It felt like a major cultural moment to everyone in that room, the way I imagine people feel now when their favorite DIY band ends up on &quot;Fallon&quot;.\nRodan was formed in 1992 by guitarist/vocalists Jason Noble and Jeff Mueller. They released their brilliant Bob &quot;Rusty&quot; Weston-produced debut, Rusty, in 1994 on Touch &amp; Go subsidiary Quarterstick. There were compilation appearances and 7&quot;'s, then they went on to other things. After they called it quits in 1994, Mueller went on to found June of 44, Noble the classically minded Rachel's. Bassist/guitarist/vocalist Tara Jane O'Neil formed Retsin with Cynthia of Ruby Falls. Drummer Kevin Coultas played in Come and later joined O'Neill in the Sonora Pine. Mueller and Noble eventually got back together in the Shipping News. These movements felt natural, connected.\nNow, almost 20 years after Rodan said goodbye, we get Fifteen Quiet Years, a compilation initally organized in 2009 that includes the band's long out-of -print 7&quot;'s and compilation tracks, as well as their 1994 three-song BBC session for John Peel. It's not sequential, though it does open with the blown-out, but pensive and relatively poppy instrumental &quot;Darjeeling&quot; that served as their recorded debut. That song appeared, in 1993, on a four-band 7&quot; put out by Jenny Toomey and Kristin Thomson on their Va. label, Simple Machines. (The 7&quot; also included Superchunk, Unrest, and Simple Machines houseband, Tsunami. Rodan were, again, the young guns.) On Fifteen, it's followed by the heavier and more spacious &quot;Milk and Melancholy&quot;, a hardcore-indebted song from their early self-released Aviary demo that was reworked for the 1993 How Winter Was Passed single, put out by Three Little Girls (the same goes for &quot;Exoskeleton&quot;, another song that appears here). You also get the scuzzy later take on Aviary's &quot;Tron&quot; that appeared on the Half-Cocked soundtrack.\nThe most interesting material on Fifteen is the stuff that appeared on Aviary, and then showed up in beefier form on Rusty. See, for instance, the blitzkrieg blast of &quot;Shiner&quot;, which still sounds like it was composed in a blender. The version here is from the Compulsiv for Two 7&quot;. There's also the 1992 version of the whirling, knotty Rusty closer, &quot;Tooth Fairy Retribution Manifesto&quot;, which features the light, calm vocals of O'Neill over a time-shifting backdrop that moves between heavy sludge and airier passages; it continually rebuilds and recoils, one of those songs that could go on for another 10 minutes and still have you by the neck. These first six songs on Fifteen are out-of-print material. They're followed by the previously unreleased BBC Peel Session, which features &quot;Sangre&quot;, &quot;Big Things, Small Things&quot;, and &quot;Before the Train&quot;: O'Neill sings the almost balladic &quot;Sangre&quot; (of course, it explodes, comes back together, explodes again); the swinging &quot;Big, Things, Small Things will help you tease out the Slint comparisons; the 11-minute &quot;Before the Train&quot; feels like a roller coaster.\nAs a physical object, Fifteen Quiet Years is a lesson in what DIY was (and is). The packaging was designed by Noble and Mueller in 2009, and was letterpress-printed by Mueller at his Dexterity Press studio. The tracks were remastered that same year by Weston, Mueller, and Noble at Chicago Mastering. And the album comes with a code to download 10 additional live recordings, selected by Noble, Mueller, O'Neil, and Coultas. These include takes on a number of Rodan staples at places like the Black Cat in D.C., Thunderdome in Louisville, and Lounge Ax in Chicago. (You get lives versions of most songs on Fifteen, as well as two takes on &quot;Wurl&quot;.)\nOf course, even with those extras, Fifteen is an incomplete offering. If you pair it with Rusty, though, you get a good picture of the band. While you're at it, you should also read the old-school liner notes, complete with a &quot;thank you&quot; section that reads like a who's who of 90s underground rock. (Back in the day, this was how you discovered new music.) Also seek out live footage and Half-Cocked, which is now available on DVD, and you'll see why so many people thought Rodan were so special.\nA lot has changed since then. This music still sounds raw, like it always did, but it's accrued something darker: Noble died of cancer in 2012, original drummer Jon Cook, also of Crain, passed away this year. Though Fifteen doesn't bring them back, it's good to know that the music they helped create will again be part of the conversation. Rodan are one of those bands that deserve another look.\nReview By Brandon Stosuy\nRate 8.0/10\n\nimage\n\n\n\nTrack List:\n1.\t&quot;Darjeeling&quot; 4:09\n2.\t&quot;Milk and Melancholy&quot; 3:11\n3.\t&quot;Tron&quot; 2:27\n4.\t&quot;Shiner&quot; 2:23\n5.\t&quot;Tooth Fairy&quot; 5:42\n6.\t&quot;Exoskeleton&quot; 7:34\n7.\t&quot;Sangre&quot; 6:22\n8.\t&quot;Big Things, Small Things&quot; 5:52\n9.\t&quot;Before the Train&quot; \n\n\nSummary:\nCountry: USA\nGenre: Indie rock, math rock\n\n\nMedia Report:\nSource : CD\nFormat : FLAC\nFormat/Info : Free Lossless Audio Codec, 16-bit PCM\nBit rate mode : Variable\nBit rate : ~789-1000 Kbps\nChannel(s) : 2 channels\nSampling rate : 44.1 KHz\nBit depth : 16 bits\n","torrent":{"xt":"urn:btih:2e5dc209893d87c9f784135008a9378ee87b43b0","amp;dn":"%282013%29+Rodan+-+Fifteen+Quiet+Years+%5BFLAC%5D+%7B100.XY%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e5dc209893d87c9f784135008a9378ee87b43b0","infoHashBuffer":{"type":"Buffer","data":[46,93,194,9,137,61,135,201,247,132,19,80,8,169,55,142,232,123,67,176]},"announce":[],"urlList":[]}}