{"title":"Rheinberger_Complete Chamber Music","uid":10506831,"size":1981458521,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2ecab5c7eede944cb15565e5b4e9c4bceffe094b&amp;dn=Rheinberger_Complete+Chamber+Music&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"dmallind","files":85,"time":1404779716,"description":"Josef Rheinberger (1839-1901) was a German (well, born in Liechtenstein technically) Romantic composer who harkened back to Schubert and Mendelssohn as much as his contemporaries, and certainly eschewed any &quot;New German School&quot; styles.  As such he is unfailingly tuneful, engaging and accessible.  This doesn't make him a vapid lightweight however.  Many of his pieces stand up far better than his scant reputation or even acknowledgement today.  While he's not a Brahms by any means, he certainly belongs in the lower first rank of the era.\n\nThis set contains various sonatas, trios, string quartets as well ass a sextet and nonet.  All his chamber works in one set, nicely performed and recorded by the Bronx Arts Ensemble and others.\n\n\n\n-----------------------------\n\nI'm trying to generate some communal sharing of the serious music repertoire beyond the &quot;Mozart's Greatest Hits&quot; level, but nowhere appears to have taken over the mantle of the old demonoid of two years ago.  I'm aware they are back at .ph but with very few seeded works and spotty availability to date.  Sadly, while I have the material, I lack access to a seed box so I am going to have to try to generate some active sharing/seeding.  Requests accepted, but be patient please as I have only a 1 mbps upload max.\t\t","torrent":{"xt":"urn:btih:2ecab5c7eede944cb15565e5b4e9c4bceffe094b","amp;dn":"Rheinberger_Complete+Chamber+Music","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ecab5c7eede944cb15565e5b4e9c4bceffe094b","infoHashBuffer":{"type":"Buffer","data":[46,202,181,199,238,222,148,76,177,85,101,229,180,233,196,188,239,254,9,75]},"announce":[],"urlList":[]}}