{"title":"Corey Harris - 2005 - Daily Bread FLAC","uid":8420681,"size":442245923,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2f33459a630a08dca8be8e068e728d84864926c4&amp;dn=Corey+Harris+-+2005+-+Daily+Bread+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"eika256","files":-1,"time":1367182389,"description":"Corey Harris - 2005 - Daily Bread\n\nCorey Harris takes a decidedly anthropological and academic approach to the blues, deeply researching its variants and origins, even making several trips to Africa to trace out its DNA (resulting in the marvelous Mississippi to Mali), but even as Harris thinks and connects dots like a scholar, when he gets down to playing the songs, he's all musician, and that leads him to create some wonderful hybrids. One would expect Harris to build further on the Mali connection for this album, but Daily Bread surprises by sounding more Jamaican than anything else, and even includes striking covers of John Holt's &quot;I See Your Face&quot; and Sylford Walker's &quot;Lamb's Bread,&quot; which merge the reggae rhythms of the originals with a sort of blues sensibility, while the political &quot;The Bush Is Burning&quot; is nothing less than full-blown ska. There are two tracks here (&quot;Mami Wata&quot; and &quot;The Peach&quot;) featuring guitarist, trumpeter, and vocalist Olu Dara that do build on the African dimension, with &quot;The Peach&quot; -- a ten-minute-long Griot creation rap -- in particular becoming a kind of perfect blend of Africa and Delta, but the rhythmic synthesis is so complete on Daily Bread that everything meshes together like pieces from the same bright quilt. Perhaps the most amazing thing about this album is how ultimately American it sounds (no doubt thanks to the presence of New Orleans pianist Henry Butler on several cuts) in spite of its Caribbean and African lilt, a testament to how well Harris pulls all these different international strands together without losing sight of where his musical journey began. Given his penchant for researching origins and sources, one would expect Harris to have a preservationist approach to the blues, but he's really more interested in the dynamic possibilities of the genre, and he does this on Daily Bread by looking to Africa and the Caribbean, with the end result being a wonderfully varied and yet unified album that preserves the blues by gracefully expanding the genre's possibilities. (AllMusic)\n\nTrack list:\n01 - Daily Bread\n02 - I See Your Face\n03 - Got to Be a Better Way\n04 - A Nickel and a Nail\n05 - The Sweetest Fruit\n06 - Mami Wata feat. Olu Dara\n07 - Lamb's Bread\n08 - Just in Time\n09 - Khaira\n10 - Big String\n11 - More Precious than Gold\n12 - The Bush Is Burning\n13 - The Peach feat. Olau Dara - bonus track\n\nEnjoy and share! ","torrent":{"xt":"urn:btih:2f33459a630a08dca8be8e068e728d84864926c4","amp;dn":"Corey+Harris+-+2005+-+Daily+Bread+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f33459a630a08dca8be8e068e728d84864926c4","infoHashBuffer":{"type":"Buffer","data":[47,51,69,154,99,10,8,220,168,190,142,6,142,114,141,132,134,73,38,196]},"announce":[],"urlList":[]}}