{"title":"The Rajneesh Chronicles - Win McCormack","uid":14476360,"size":6169806,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2ffc76a37fa2981a17482738ea479c09be7d831d&amp;dn=The+Rajneesh+Chronicles+-+Win+McCormack&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ZamKhan","files":1,"time":1461947471,"description":"The Bhagwan Shree Rajneesh and his followers were involved in nefarious activities including prostitution, drug smuggling, sexual abuse of children, and murder conspiracy. The Rajneesh Chronicles explains this behavior--and why the cult that committed the first act of bioterrorism in the U.S. was trying to cultivate a live AIDS virus.\r\n\r\nBhagwan Shree Rajneesh, widely known as the &quot;sex guru,&quot; fled India in 1981 and came to settle on a ranch in central Oregon, where he and his followers established the illegal city of Rajneeshpuram. In their effort to preserve the city, the Rajneeshees attempted during the 1984 election to take control of the Wasco County government by poisoning two county commissioners and over 700 potential voters in The Dalles, the county seat, with salmonella―the first act of bio-terrorism in U.S. history.\r\nArmed to the teeth with semiautomatic weapons, they threatened to defend the city to the death against any governmental intrusion, and hatched a plot to assassinate a U.S attorney. When the commune finally imploded and authorities arrived on the scene, they discovered that the Rajneesh nurse who had cultivated salmonella bacteria in the commune’s biological warfare laboratory was also trying to cultivate a live AIDS virus―which deranged group leaders clearly hoped to unleash on the rest on the world. \r\n\r\nThe Rajneesh Chronicles is a collection of in-depth investigative and analytical articles published in Oregon Magazine covering the entire period from the time of the cult’s arrival in Oregon in mid-1981 to its dramatic disintegration at the end of 1985 (with an introductory chronology that extends the story up to the present). \r\n\r\nWhile most press treated the cult’s antics as a humorous sideshow typified by the Bhagwan’s dozens of Rolls-Royces, editor in chief Win McCormack and other of the magazine’s writers systematically exposed the full range of the Rajneeshees’ depraved behavior, including their involvement in prostitution and international drug smuggling, sexual exploitation of children, abuse of homeless people they imported into Rajneeshpuram to register as voters, and the use of brainwashing techniques bordering on torture. The tale of the Rajneesh has become an amorphous legend few inside or outside of Oregon actually understand. The Rajneesh Chronicles fully illuminates the shocking reality behind that legend","torrent":{"xt":"urn:btih:2ffc76a37fa2981a17482738ea479c09be7d831d","amp;dn":"The+Rajneesh+Chronicles+-+Win+McCormack","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ffc76a37fa2981a17482738ea479c09be7d831d","infoHashBuffer":{"type":"Buffer","data":[47,252,118,163,127,162,152,26,23,72,39,56,234,71,156,9,190,125,131,29]},"announce":[],"urlList":[]}}