{"title":"Dandupalya Kannada 2012 Unrated DVDScr -=DVG=-","uid":8260168,"size":734638332,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:31bf2dda0dc4ba23b1af01970a76758367b45702&amp;dn=Dandupalya+Kannada+2012+Unrated+DVDScr+-%3DDVG%3D-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"hinaruto","files":11,"time":1363365283,"description":"Directed by Srinivasa Raju, 'Dandupalya' is based on real-life incidents that occurred during the late 1980s and early 1990s when a notorious gang committed series of murders in Karnataka and Andhra Pradesh (mostly in periphery of Bangalore and Kolar districts).\nThe director has narrated the gang's spine-chilling encounters with innocent people in a realistic way.\nThe film, which has a lot of lot of raw elements, narrates the criminal incidents, when Dandupalya gang went on a rampage with murders, rape and loot, in a nearly accurate way.\n\nIt is not recommended for the faint-hearted, but the film is an interesting watch for movie buffs, who want different type of films.\nThe film narrates the story of Krishna and his gang members, including the most cruel woman Lakshmi, who planned and executed the most heinous criminal acts. When a series of murders rock the city of Bengaluru and its peripheral areas, Karnataka police is given the job of hunting down the criminals. The charge goes to an exceptionally brilliant police officer Chalapathy.\nChalapathy's brilliant investigation and his method of interrogation helps track the guilty and render justice to victims.\nThough the first half of the film is a little inconsistent, the second half is extremely engaging. The investigative part of the police officer builds up the tempo of the film, which does not subside until the climax.\nNevertheless 'Dandupalya' has some fantastic performances and brilliant technical work. Unfortunately, the producers and director did not focus on good aspects of the film while marketing the product.\nThe director has also taken some freedom in making the film a little more commercial by introducing some unnecessary characters.\nActress Pooja Gandhi, whose recent films were not very successful, has delivered a stunning performance in the role of Lakshmi. She has to be appreciated for accepting a role with negative shades. Her body language and expressions are really good.\nRavi Shankar's portrayal of police officer Chalapathy is also exceptionally good. Among the gang members every actor has done his best, but it is Markand Deshpande and Jai Dev who have come out with flying colours. Raghu Mukherjee, Nisha Kothari and Sudharani have filled in their roles adequately.\nThe dialogues are crisp and to the point.","torrent":{"xt":"urn:btih:31bf2dda0dc4ba23b1af01970a76758367b45702","amp;dn":"Dandupalya+Kannada+2012+Unrated+DVDScr+-%3DDVG%3D-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31bf2dda0dc4ba23b1af01970a76758367b45702","infoHashBuffer":{"type":"Buffer","data":[49,191,45,218,13,196,186,35,177,175,1,151,10,118,117,131,103,180,87,2]},"announce":[],"urlList":[]}}