{"title":"Jack of Hearts 01-04 (1984) + Marvel Premiere 44 (1978)","uid":10524485,"size":62877300,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:343283d990371b7c4a3412607277b7adb2b84e95&amp;dn=Jack+of+Hearts+01-04+%281984%29+%2B+Marvel+Premiere+44+%281978%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"ill420smoker","files":-1,"time":1405026488,"description":"Jack of Hearts 01-04 (1984) CBR\n\n  01 &quot;Murmur of the Heart..!&quot;\n  02 &quot;Heart to Heart&quot;\n  03 &quot;Heartbreak!&quot;\n  04 &quot;Heart Attack&quot;\n\nMarvel Premiere 44 &quot;The Jack of Hearts!&quot; (1978) CBR\n\n****************************************************\n\nJack Hart was the son of Philip Hart, a brilliant scientist who developed a revolutionary, extremely efficient liquid fuel called Zero Fluid, and a humanoid alien woman of the Contraxian race. The alien was one of many scientists dispatched to try to discover an energy source to resuscitate the dwindling nuclear processes of the Contraxian sun. Learning of Hart's experiments, the alien assumed a totally human form to keep Hart under surveillance. Hart and the alien eventually met, married, and produced a son they named Jack. The alien woman, &quot;Marie,&quot; died in a car accident when the boy was a child. Neither her husband nor child ever learned of her extraterrestrial origin.\n\nJack grew up charming and intelligent, becoming a poetry major at New Haven College in Connecticut. There he met the one girl who wasn't interested in him - Marcy Kane. She would eventually fall for Jack, but tragedy would soon tear them apart.\n\nWhen Jack was still young, Philip Hart perfected his Zero Fluid and decided to donate the fuel to all the free countries of the world. Hart was then contacted by agents of the criminal Corporation who wanted to market the Zero Fluid. Refusing to deal with them, Philip Hart was murdered by Corporation agents before the eyes of his son.\n\nManaging to escape, Jack Hart took refuge in his father's basement laboratory Corporation agents broke in minutes later, and their laser-cannon sheared through the laboratory door, striking the vat of Zero Fluid. Doused by the powerful, corrosive fuel, Hart underwent a mutagenic change and began to glow. With an uncontrollable burst of energy generated by his entire body, Hart killed his father's murderers. Vowing vengeance on the entire Corporation, Hart fashioned a costume for himself, plundering his father's collection of armament. The armor somehow interacted with the final stage of mutation and provided a moderator that contained and controlled the release of his body's energy.","torrent":{"xt":"urn:btih:343283d990371b7c4a3412607277b7adb2b84e95","amp;dn":"Jack+of+Hearts+01-04+%281984%29+%2B+Marvel+Premiere+44+%281978%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"343283d990371b7c4a3412607277b7adb2b84e95","infoHashBuffer":{"type":"Buffer","data":[52,50,131,217,144,55,27,124,74,52,18,96,114,119,183,173,178,184,78,149]},"announce":[],"urlList":[]}}