{"title":"20th Century Masters: The Best of Brenda Lee; The Christmas Coll","uid":5984841,"size":303955362,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:35b2a1512de829fcc48dad83c4eccfe8e3c32a34&amp;dn=20th+Century+Masters%3A+The+Best+of+Brenda+Lee%3B+The+Christmas+Coll&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ddawg","files":-1,"time":1290701851,"description":" &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/61b0QrOO49L.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/61b0QrOO49L.jpg&lt;/a&gt;\n\n\nTitle: 20th Century Masters: The Best of Brenda Lee; The Christmas Collection [Original recording remastered]\nArtist: Brenda Lee\nAudio CD (September 23, 2003)\nNumber of Discs: 1\nGenre: Christmas\nFormat: Format: Free Lossless Audio Codec\n\n\nTrack Listing:\n\n01. Rockin' Around The Christmas Tree\n02. Papa Noel\n03. This Time Of The Year\n04. Jingle Bell Rock\n05. Christy Christmas\n06. I'm Gonna Lasso Santa Claus\n07. Winter Wonderland\n08. Silver Bells\n09. Santa Claus Is Coming To Town\n10. The Angel And The Little Blue Bell\n11. Frosty The Snowman\n12. Christmas Will Be Just Another Lonely Day\n13. Blue Christmas\n14. A Marshmallow World\n15. Strawberry Snow\n16. White Christmas\n17. Jingle Bells\n18. Silent Night \n\n\nAmazon Review:\nThis collection was originally released on an 18-track CD titled Rockin' around the Christmas tree. \n\nBrenda is one of those singers - just like Bing Crosby - who's most famous song is a Christmas classic, despite a vast catalog of other material. On this collection, Brenda demonstrates her skills on a wide variety of Christmas songs, although there is only one carol (Silent night). \n\nThe oldest recordings here (from 1956, when Brenda was only 11) are Christy Christmas and I'm gonna lasso Santa Claus - this song is quite amusing but also has a moral tale, as it points out that Santa is more generous to the rich than the poor. Sadly, that will always be true. \n\nIn 1958, Brenda recorded Papa Noel, a cajun-flavored song, and Rockin' around the Christmas tree. Expected to be a massive hit, it missed the charts completely, though Brenda wasn't yet in the big time. Following the multi-million selling I'm sorry in 1960, a decision was taken to try again that Christmas. This time, the song went high in the charts, not just in America, but around the world. \n\nThe remainder of these songs, except White Christmas, Jingle bells and Silent night (which were recorded in 1965, but remained unissued outside Japan until the release of the Rockin' around the Christmas tree CD mentioned in the opening paragraph), were first released on Brenda's original Christmas album in 1964, which also included some of the earlier tracks, including (of course) Rockin' around the Christmas tree. \n\nSome of the songs were originally popularized by other singers, including Jingle bell rock (Bobby Helms), White Christmas and Silver bells (both Bing Crosby), This time of the year (Brook Benton) and Blue Christmas (Ernest Tubb, but made even more popular by Elvis), but Brenda's vocal style makes her versions distinctive, even though the arrangements are mostly faithful to the originals. It's a marshmallow world is a brilliant song which had already appeared on the Phil Spector Christmas album, though I don't know it's origin. \n\nWhat really makes this album, though, are the original songs. Apart from those recorded in 1956 and 1958, there is Christmas will be just another lonely day (a serious song written by Ray Stevens, best known for his comic songs), Strawberry snow and the slightly silly (but brilliant) The angel and the little blue bell. \n\nAllmusic Review:\nThis edition in Universal's discount-priced compilation series Best of Brenda Lee: The 20th Masters Christmas Collection is actually a re-titled reissue of the 1999 collection Rockin' Around the Christmas Tree: The Decca Christmas Recordings. It contains all of the seasonal music Brenda Lee recorded for Decca Records between 1956 and 1965. Included is her initial Christmas single &quot;Christy Christmas&quot;/&quot;I'm Gonna Lasso Santa Claus,&quot; along with the 1958 45 rpm &quot;Rockin' Around the Christmas Tree&quot;/&quot;Papa Noel,&quot; the A-side of which finally became a gold-selling hit in 1960; the complete contents of Lee's 1964 LP Merry Christmas from Brenda Lee; and three songs, &quot;White Christmas,&quot; &quot;Jingle Bells,&quot; and &quot;Silent Night,&quot; recorded in 1965 and included as bonus tracks on Japanese copies of the LP, but not released in the U.S. until 1999. The selections are a combination of familiar holiday fare done in Lee's inimitable style and a few attempts to join the pantheon of Christmas perennials. Only &quot;Rockin' Around the Christmas Tree&quot; succeeded, despite Lee having reached the charts with the ballads &quot;This Time of the Year&quot; and &quot;Christmas Will Be Just Another Lonely Day,&quot; but the surprisingly aggressive &quot;I'm Gonna Lasso Santa Claus&quot; is amusing, especially coming from a singer who was only 11-years-old when she recorded it.","torrent":{"xt":"urn:btih:35b2a1512de829fcc48dad83c4eccfe8e3c32a34","amp;dn":"20th+Century+Masters%3A+The+Best+of+Brenda+Lee%3B+The+Christmas+Coll","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"35b2a1512de829fcc48dad83c4eccfe8e3c32a34","infoHashBuffer":{"type":"Buffer","data":[53,178,161,81,45,232,41,252,196,141,173,131,196,236,207,232,227,195,42,52]},"announce":[],"urlList":[]}}