{"title":"J.D. Robb - Eve Dallas 27 - Born in Death-viny","uid":6426443,"size":1756127,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3616223646ac9cf471b0f006a3496c4a6c0b72d1&amp;dn=J.D.+Robb+-+Eve+Dallas+27+-+Born+in+Death-viny&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"daemonx0x","files":-1,"time":1306493557,"description":"J.D. Robb - Eve Dallas 27 - Born in Death-viny\n\nTechnology has advanced in 2060 New York City, but childbirth has been the same since the beginning of time. And despite the brutal double homicide on Lieutenant Eve Dallas's caseload, she has to be there for her pregnant friend Mavis, even if it means throwing the dreaded baby shower. . .\n\nBut Mavis needs an even bigger favor now. Tandy Willowby, one of the moms-to-be in her class, has gone missing, just days before her due date - not even showing up at the shower at Eve and Roarke's place that she&quot;d been looking forward to so much. A recent emigrant from London, Tandy has few friends in New York, and no family. When Eve enters Tandy's apartment and finds Mavis's shower gift wrapped and ready on the table - and Tandy's packed hospital bag still on the floor - her spine starts tingling.\n\nNormally, this would be turned over to Missing Persons. Eve has more than enough on her plate trying to find out who murdered Natalie Copperfield and her fianc , both employed at a highly prestigious accounting firm. But Mavis wants no one but Eve on the case - and Eve can't say no. She'll have to track Tandy down while tracing the deals and double-crosses hidden in the files of some of the city's richest and most secretive citizens, in a race against a particularly vicious killer. Luckily, she has her multimillionaire husband Roarke's expertise to help with the numbers-crunching. But as he mines for the crucial data that will break the case wide open, Eve faces an all-too-real danger in the flesh-and-blood world.","torrent":{"xt":"urn:btih:3616223646ac9cf471b0f006a3496c4a6c0b72d1","amp;dn":"J.D.+Robb+-+Eve+Dallas+27+-+Born+in+Death-viny","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3616223646ac9cf471b0f006a3496c4a6c0b72d1","infoHashBuffer":{"type":"Buffer","data":[54,22,34,54,70,172,156,244,113,176,240,6,163,73,108,74,108,11,114,209]},"announce":[],"urlList":[]}}