{"title":"Kimoji - Kim Kardashian Emoji v1.11 [Build 12]","uid":14238536,"size":45022988,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:363b5706cb2dd44169752145af406cc9dee14fa0&amp;dn=Kimoji+-+Kim+Kardashian+Emoji+v1.11+%5BBuild+12%5D+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Pahly","files":1,"time":1460118712,"description":"KIMOJI gives you access to 400+ emoji designs, and introduces the all-new KIMOGIF keyboard!\r\nAlso includes an exclusive collection of KIMOJI for Valentine's Day! \r\n\r\nWorks in all messaging applications where the copying and pasting of images and GIFs is supported. Also includes integrated QWERTY keyboard. New packs will be added, so install now and start building your collection!\r\n\r\n\r\nHow to Install: Installation of the Kimoji keyboard can be a little tricky. After installing the, go to Settings&gt;General&gt;Keyboard&gt;Keyboards&gt;Add New Keyboard, then select Kimoji. After it's installed as one of the keyboards, select Kimoji and turn on &quot;Allow Full Access&quot; to use the emojis.\r\n\r\nKimoji KeyboardUsing the Kimoji keyboard is also a little different than using native emojis. First, click on the globe at the bottom of the keyboard like you would normally to bring up the emoji keyboard. Then, select ABC at the bottom of the emoji keyboard to bring up the Kimoji keyboard. \r\n\r\nSelect a Kimoji, then follow the instructions to paste it into the text body. Even if your friend doesn't have the Kimoji app, he or she will still be able to see them.\r\n\r\nThere's also a set of larger versions of the Kimojis to send, called Stickers, and an alphanumeric keyboard. Unfortunately, there's no autocorrect or spellcheck in this keyboard, so I'd recommend just using the regular keyboard if you're adding text","torrent":{"xt":"urn:btih:363b5706cb2dd44169752145af406cc9dee14fa0","amp;dn":"Kimoji+-+Kim+Kardashian+Emoji+v1.11+%5BBuild+12%5D+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"363b5706cb2dd44169752145af406cc9dee14fa0","infoHashBuffer":{"type":"Buffer","data":[54,59,87,6,203,45,212,65,105,117,33,69,175,64,108,201,222,225,79,160]},"announce":[],"urlList":[]}}