{"title":"A Vietnam Trilogy: Veterans and Post Traumatic Stress, 1968, 198","uid":8756549,"size":1746010,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:366540dd3fd54b86837583d333d3096c124f6c36&amp;dn=A+Vietnam+Trilogy%3A+Veterans+and+Post+Traumatic+Stress%2C+1968%2C+198&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"blackatk","files":-1,"time":1375158416,"description":"Publication Date: August 1, 2004 | filetype: pdf\n\n\nAn internationally recognized expert on war and post-traumatic stress therapy analyzes the Vietnam War s psychological and social impact and the implications for today s veterans through the lens of his service in 1968 and two return visits in 1989 and 2000.\n\nThrough the stories of veterans and the author s own understanding as a psychiatric social work officer in Vietnam and his extensive post-war experiences as a mental health professional, A Vietnam Trilogy describes the impact of war on veterans from a psychiatric, psychological, social and cultural perspective, both during and decades after the war.\nThe large numbers of psychiatric casualties from war used to be attributed to an underlying psychiatric disorder presenting the classic blame-the-victim scenario. When they were finally classified as what is now known as PTSD (post-traumatic stress disorder), the path was opened for more realistic and fruitful healing techniques. A Vietnam Trilogy describes a care-giver s and numerous veterans perspectives of what happens to combatants during war, the therapeutic processes fostered by an innovative Dept. of Veteran Affairs treatment program directed by Dr. Scurfield, and the pioneering return trips he co-led to peace-time Vietnam in 1989 and 2000.\nThis book offers a unique vicarious journey of healing and pathos by relating the experiences of those who participated in these therapeutic efforts. For families, care-givers, students and teachers of history, and others, the book offers a glimpse from the participants view of the shock, the horrors, the overwhelming stress, and the mindset that were so damaging to personnel in the war zone, as well as of the extraordinary courage and strength necessary to survive. Finally, it offers insight into creative therapeutic approaches and recommendations for veterans and those who wish to help them recover from the traumas of war. Volume 1,&quot;A Vietnam Trilogy. Veterans and Post-Traumatic Stress, 1968, 1989 and 2000&quot;, describes the healing processes of hundreds of veterans from Vietnam and earlier wars up until 1990, when the author co-led a group of veterans on a therapeutic trip back to Vietnam to face their demons.\nThe second volume, &quot;Healing Journeys,&quot; continues from 1990 to 2000 (including a discussion of the impact of the first Gulf War on veterans of earlier wars) and a second return trip to Vietnam in 2000, as part of a university Study Abroad program, to help veterans in their healing process.\nVolume 3, &quot;War Trauma, Lessons Unlearned From Vietnam to Iraq&quot; (Algora, fall 2006), completes the Trilogy with a consideration of the experience of prior wars to help people who are now in the military or in the healing professions, and their families and communities, to deal with today s realities of combat and its aftermath.\n\n\nPaperback: 248 pages\nPublisher: Algora Publishing (August 1, 2004)\nLanguage: English\nISBN-10: 0875863221\nISBN-13: 978-0875863221\n\n &lt;a href=&quot;\nhttp://www.amazon.com/Vietnam-Trilogy-Veterans-Traumatic-Stress/dp/0875863221/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Vietnam-Trilogy-Veterans-Traumatic-Stress/dp/0875863221/&lt;/a&gt;\n\n\n\nTags: Vietnam, Veterans, PTSD, post, traumatic, stress, disorder, trauma, vietnam, nlf, vietcong, shell shock, Iraq, Afghanistan, soldier, military, army, navy, shell shock, thousand, yard, stare, 1000, GWOT, terrorism, psychology, mental, health, social, family, demob, demobilization, reintegrate, reintegration, nightmare, stress, distrust, hyper-vigilance, \n\n","torrent":{"xt":"urn:btih:366540dd3fd54b86837583d333d3096c124f6c36","amp;dn":"A+Vietnam+Trilogy%3A+Veterans+and+Post+Traumatic+Stress%2C+1968%2C+198","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"366540dd3fd54b86837583d333d3096c124f6c36","infoHashBuffer":{"type":"Buffer","data":[54,101,64,221,63,213,75,134,131,117,131,211,51,211,9,108,18,79,108,54]},"announce":[],"urlList":[]}}