{"title":"Milf.Gape.XviD-PORNOLATiON","uid":7700551,"size":1467787264,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:380db21cd9f6bef5e5d109bcc68ee3c4659f815f&amp;dn=Milf.Gape.XviD-PORNOLATiON&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"chkm8te","files":2,"time":1349499408,"description":"Milf Gape XviD - PORNOLATiON\n\nStarring : Veronica Avluv, Chris Strokes, Francesca Le, India Summer, Mark Wood, Syren De Mer\n\nDescription : For &quot;MILF Gape,&quot; an Anal-themed collection of vignettes from the dirty Buttman Choice line of Specialty fetishy videos, Classic American Latina cutie Francesca Le and well-hung porn Stud Mark Wood - collectively LeWood Productions - Created have four sexy vignettes of intense, no-holes-barred sodomy starring mature, seasoned beauties that love taking big cocks up the ass. These hot mamas get off on feeling pricks pumping their bungholes and stretching their sphincters. First, sultry brunette India Summer dons a kinky, provocative get-up and leaves a romantic trail of rose petals to entice her husband for an afternoon fuck. But her neglectful spouse has sent an employee home for some work material. India takes advantage of the opportunity, treating the lucky worker to an intimate blow job and a session in illicit ass banging that leaves her rosebud gaping and her mouth filled with hot semen. Next is Francesca as a stunning older lady who doesn't want her daughter to date tattooed hip-hop slacker Chris Strokes. When they're alone her disapproval turns to lust, and soon Francesca's sweet bunghole is getting reamed hard and dilated widely, with plenty of ass-to-mouth cocksucking. Mark confronts redheaded cougar Syren De Mer with evidence of adultery, then ravages her cheating butthole, even stuffing her lover's letter inside Syren's punished rectum. Finally, gorgeous Veronica Avluv uses her oral and anal talents to get her son's school application some special consideration, leaving the experienced fox dripping with sweat and semen. &quot;MILF Gape&quot; shows the animalistic anal jamming of the cougar set.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=040rh89c58ddbo5rg6z1.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=040rh89c58ddbo5rg6z1.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=i2t93g6a8e0o2ax1tgol.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=i2t93g6a8e0o2ax1tgol.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=2y94fzzatkbs2oxnzwns.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=2y94fzzatkbs2oxnzwns.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:380db21cd9f6bef5e5d109bcc68ee3c4659f815f","amp;dn":"Milf.Gape.XviD-PORNOLATiON","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"380db21cd9f6bef5e5d109bcc68ee3c4659f815f","infoHashBuffer":{"type":"Buffer","data":[56,13,178,28,217,246,190,245,229,209,9,188,198,142,227,196,101,159,129,95]},"announce":[],"urlList":[]}}