{"title":"Eastbound.and.Down.S01E06.720p-[mak621]","uid":5334600,"size":781921664,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:38cccefcccf84f0c0a9980ce3e6be82653f2b267&amp;dn=Eastbound.and.Down.S01E06.720p-%5Bmak621%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"mak621","files":-1,"time":1265280127,"description":"Eastbound &amp; Down is a comedy show from HBO, starring Danny McBride as Kenny Powers, a former professional baseball pitcher, who after a disappointing career is forced to return to his hometown middle-school in Shelby, North Carolina as a substitute physical education teacher. Will Ferrell and Adam McKay received an order for six episodes for the first season from HBO. The series is being produced by Will Ferrell's production company, Gary Sanchez Productions. The show premiered February 15, 2009, at 10:30 p.m. On April 8, 2009, HBO announced it had renewed the series for a second season.\n\nEpisode 6 - &quot;Chapter 6&quot; - Kenny gets an offer from Tampa and is forced to say goodbye to his family and teaching job. The Tampa Bay Rays become the first MLB team to lend their official logo to the show; it appears on the 'black' credit card that the Tampa agent presents as his credentials. Right before he leaves, he gets a phone call from the agent saying that the deal was off, and he hides this from his family and April, and leaves with April, leaving all of them with the assumption that his baseball career is back on track. He dumps April at a gas stop and is last seen driving away with a worried look on his face. Features the song &quot;Sky Pilot&quot; by The Animals and Shawn Lee's Ping Pong Orchestra- Kiss The Sky \n\nLooks like this is the only 720p version of this show so ENJOY!!","torrent":{"xt":"urn:btih:38cccefcccf84f0c0a9980ce3e6be82653f2b267","amp;dn":"Eastbound.and.Down.S01E06.720p-%5Bmak621%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38cccefcccf84f0c0a9980ce3e6be82653f2b267","infoHashBuffer":{"type":"Buffer","data":[56,204,206,252,204,248,79,12,10,153,128,206,62,107,232,38,83,242,178,103]},"announce":[],"urlList":[]}}