{"title":"Highlander 1 tm 5 nl subs NLT-Release (DivX)","uid":6509382,"size":6899620732,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:38d19d0fd139bf245f203a5521a056a0c25766ee&amp;dn=Highlander+1+tm+5+nl+subs+NLT-Release+%28DivX%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"linday1","files":-1,"time":1309560197,"description":"Highlander 1:\n\n\nVerenigde Staten / Verenigd Koninkrijk\nActie / Fantasy\n116 minuten\n\ngeregisseerd door Russell Mulcahy\nmet Christopher Lambert, Clancy Brown en Sean Connery\n\nGeboren in de Hooglanden van Schotland in 1518, Connor Macleod is onsterfelijk. Wanneer hij tijdens een gevecht gewond raakt en niet sterft, wordt hij verbannen uit zijn dorp. Hij ontmoet een andere onsterfelijke, Ramirez, die hem het zwaardmansschap leert en de manieren van onsterfelijke. In het New York van 1986 is de locatie van de Gathering, waar Macleod en een paar overgebleven onsterfelijken moeten strijden voor the Prize, waarmee je de macht op aarde voor altijd hebt\n\nHighlander 2:\n\n\n\nFrankrijk / ArgentiniÃƒÂ« / Verenigd Koninkrijk\nActie / Sciencefiction\n91 minuten / 109 minuten (director's cut)\n\ngeregisseerd door Russell Mulcahy\nmet Christopher Lambert, Sean Connery en Michael Ironside\n\nHet is het jaar 2024 en de ozonlaag boven de aarde is compleet verdwenen. Om vele doden te voorkomen werkte Connor MacLeod aan een speciaal schild dat de zon moest tegenhouden. Maar sinds z'n overwinning in de vorige film zijn er geen Immortals meer en daardoor is hij nu zelf sterfelijk geworden. Als MacLeod eenmaal een oude man is geworden komt er opeens een groep Immortals te voorschijn. Ze blijken van een andere planeet te komen.\n\nHighlander 3:\n\n\n\nCanada / Frankrijk / Verenigd Koninkrijk\nSciencefiction / Actie\n106 minuten\n\ngeregisseerd door Andrew Morahan\nmet Christopher Lambert, Mario Van Peebles en Deborah Kara Unger\n\nDe derde film speelt zich af in 1994 en is een prequel van de tweede film. Na de dood van zijn vrouw Heather, vertrekt Connor MacLeod naar Japan. Hij wordt gevolgd door de slechte Immortal Kane en al spoedig vechten ze op leven en dood. MacLeod weet Kane op te sluiten in een grot. Honderden jaren later weet Kane zich te bevrijden en is uit op wraak.\n\nHighlander 4:\n\n\nVerenigde Staten\nActie / Fantasy\n87 minuten\n\ngeregisseerd door Douglas Aarniokoski\nmet Adrian Paul, Christopher Lambert en Bruce Payne\n\nDe legendarische highlander Connor MacLeod moet tegen wil en dank met zijn vervreemde broer Duncan MacLeod samenwerken om een gestoorde onsterfelijke te stoppen die te machtig is geworden om alleen te bevechten.\n\nHiglander 5:\n\n\nVerenigde Staten\nActie / Sciencefiction\n102 minuten\n\ngeregisseerd door Brett Leonard\nmet Adrian Paul, Peter Wingfield en Jim Byrnes\n\nDe film over MacLeod vertelt het verhaal van de speurtocht van 'de onsterfelijken' naar de Heilige Graal: de bron van onsterfelijkheid. De wereld verkeert in chaos en MacLeod denkt terug aan de gelukkige tijden die hij heeft gekend. Ontevreden over hoe de wereld er nu uitziet, begint hij samen met een groep vrienden een zoektocht naar de bron van hun onsterfelijkheid.\n \nMet dank naar de originele poster.\n\n\nVoor de nieuwste films en muziek ga je naar:\n &lt;a href=&quot;\nhttp://www.movierecensies.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.movierecensies.nl&lt;/a&gt;\n\n\nBy Linday :D","torrent":{"xt":"urn:btih:38d19d0fd139bf245f203a5521a056a0c25766ee","amp;dn":"Highlander+1+tm+5+nl+subs+NLT-Release+%28DivX%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38d19d0fd139bf245f203a5521a056a0c25766ee","infoHashBuffer":{"type":"Buffer","data":[56,209,157,15,209,57,191,36,95,32,58,85,33,160,86,160,194,87,102,238]},"announce":[],"urlList":[]}}