{"title":"Guns N' Roses - It's So Easy [uncensored promo] (vhs).VOB","uid":11624522,"size":240693248,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:38ee1ee2f7bcfa2a43b32b980217cb3edee6a81f&amp;dn=Guns+N%27+Roses+-+It%27s+So+Easy+%5Buncensored+promo%5D+%28vhs%29.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1417603206,"description":"Guns N' Roses - It's So Easy [uncensored promo] (vhs).VOB\n\n\nHQ rare uncensored promo music video from a promo VHS Tape. &quot;It's So Easy&quot; is a song written by West Arkeen and American hard rock band Guns N' Roses, featured on the band's 1987 debut studio album Appetite for Destruction. The song was released as the band's first single on June 15, 1987, in the UK, where it reached number eighty-four on the UK Singles Chart. It was also released in Germany around the same time. The songs &quot;Shadow Of Your Love&quot; and &quot;Move To The City&quot;, featured on the 12-inch vinyl and 12-inch picture disc editions of the single, were written by members of Guns N' Roses while in the band Hollywood Rose, and were later included on the EP Live from the Jungle. &quot;Move to the City&quot; had previously been released on the 1986 EP Live Like A Suicide. \n\nAccording to an interview published in Hit Parader in March 1988, &quot;It's So Easy&quot; is &quot;an account of a time Duff McKagan and West Arkeen, and also the rest of the band, were kinda going through. They didn't have money, but they had a lot of hangers on and girls [they] could basically live off of ... things were just too easy. There's an emptiness; it's so easy.&quot;\n\nIn an Eddie Trunk interview from 2006, Axl said that Duff and West originally wrote the song as an acoustic &quot;Hippie Ya-Ya&quot; song, and that it was Slash's decision to turn it into a rock song.\n\nThe song is notable for its cowbell percussion and frequent usage of the vulgar word &quot;fuck&quot;.\n\nThere was an original music video made for &quot;It's So Easy&quot;, the first ever made from the band; the video features the band playing live in front of a crowd on stage. A heavily edited version of the video was later made for promotional purposes. It was not included on the band's Welcome to the Videos DVD, and as such its content is rare and can only be found on the internet. At the time the video was released, Guns N' Roses were not as popular as they would eventually become, the single was never released in the United States and its video was never accepted by MTV.\n\n\nGuns N' Roses is an American hard rock band who formed in Los Angeles, California, in 1985. The classic lineup as signed to Geffen Records in 1986, consisted of vocalist Axl Rose, lead guitarist Slash, rhythm guitarist Izzy Stradlin, bassist Duff McKagan and drummer Steven Adler. The band released six studio albums, accumulating sales of more than 100 million albums worldwide, including shipments of 45 million in the United States. \n\nGuns N' Roses have been credited with reviving the mainstream popularity of rock music, at a time when popular music was dominated by dance music and pop metal. Their late 1980s and early 1990s years have been described as the period in which they brought forth a &quot;hedonistic rebelliousness&quot; reminiscent of the early Rolling Stones,[19] a reputation that had earned them the nickname &quot;The Most Dangerous Band in the World&quot;. The band's classic lineup, along with later members Reed and drummer Matt Sorum, were inducted into the Rock and Roll Hall of Fame in 2012, their first year of eligibility.\n(video has white timecounter numbers at the bottom)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/It's_So_Easy_(Guns_N'_Roses_song)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/It's_So_Easy_(Guns_N'_Roses_song)&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/kAILDaAga&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/kAILDaAga&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic:     \n   Video: MPEG2 Video 720x480 (4:3) 29.97fps 9608kbps\n   Audio: Dolby Digital AC3 48000Hz stereo 192kbps\n   Duration: 00:03:31\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.7.7\n\n*Media Player Classic Home Cinema*         &lt;a href=&quot;\nhttp://mpc-hc.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.org/&lt;/a&gt; \n\nSgtRlee (Sgt.R.Lee)","torrent":{"xt":"urn:btih:38ee1ee2f7bcfa2a43b32b980217cb3edee6a81f","amp;dn":"Guns+N%27+Roses+-+It%27s+So+Easy+%5Buncensored+promo%5D+%28vhs%29.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38ee1ee2f7bcfa2a43b32b980217cb3edee6a81f","infoHashBuffer":{"type":"Buffer","data":[56,238,30,226,247,188,250,42,67,179,43,152,2,23,203,62,222,230,168,31]},"announce":[],"urlList":[]}}