{"title":"Glucose Syrups - Technology and Applications","uid":14661445,"size":4453805,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3af70d81e5ade7d48bc6f297e11d4a5cbf70fd26&amp;dn=Glucose+Syrups+-+Technology+and+Applications&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1463756447,"description":"Glucose Syrups - Technology and Applications - Peter Hull (Wiley-Blackwell, 2010).pdf\r\n\r\nISBN 978-1-4051-7556-2\r\n\r\nGlucose syrups (commonly known as corn syrups in North America) are derived from starch sources such as maize, wheat and potatoes. Offering alternative functional properties to sugar as well as economic benefits, glucose syrups are extremely versatile sweeteners, and are widely used in food manufacturing and other industries. They are a key ingredient in confectionery products, beer, soft drinks, sports drinks, jams, sauces and ice creams, as well as in pharmaceuticals and industrial fermentations.\r\n\r\nThis book brings together all the relevant information on the manufacture and use of glucose syrups. Drawing on forty years’ experience in the international glucose industry, the author provides a valuable reference for all those involved in the processing and buying of these syrups, and for scientists involved in the manufacture of a full range of food (and some non-food) products in which the syrups are ingredients. The emphasis is on practical information - recipes are included where relevant in the applications chapters, and appendices offer commonly-used calculations and useful data. Food technologists can use the book to make choices about the most suitable glucose syrup to use in a particular application, and also to adapt recipes in order to replace sugar (sucrose) or other ingredients. A glossary of terms reflecting the international terminology of the industry completes the book","torrent":{"xt":"urn:btih:3af70d81e5ade7d48bc6f297e11d4a5cbf70fd26","amp;dn":"Glucose+Syrups+-+Technology+and+Applications","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3af70d81e5ade7d48bc6f297e11d4a5cbf70fd26","infoHashBuffer":{"type":"Buffer","data":[58,247,13,129,229,173,231,212,139,198,242,151,225,29,74,92,191,112,253,38]},"announce":[],"urlList":[]}}