{"title":"Martes con mi Viejo Profesor - Alborn Micht [Epub][Spanish]","uid":6972493,"size":262676,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3b08cea8a9c2b2a75e888bc058e86eba91cbacaa&amp;dn=Martes+con+mi+Viejo+Profesor+-+Alborn+Micht+%5BEpub%5D%5BSpanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"virana","files":-1,"time":1327133571,"description":"Martes con mi Viejo Profesor - Mitch Albom [Epub]\n\nMitch Albom, describe detalladamente los ÃƒÂºltimos meses de la vida de un viejo profesor de sociologÃƒÂ­a, Morrie Schwartz, que tuvo en la universidad y con el que retoma el contacto dieciseis aÃƒÂ±os mÃƒÂ¡s tarde despuÃƒÂ©s de terminar su licenciatura.\n\nEste anciano profesor estÃƒÂ¡ muriendo lentamente a consecuencia de la terrible enfermedad ELA (esclerosis lateral amiotrÃƒÂ³fica) que le va convirtiendo rÃƒÂ¡pidamente en un ser dÃƒÂ©bil y completamente dependiente de los demÃƒÂ¡s a medida que los mÃƒÂºsculos de su cuerpo se van paralizando uno a uno, una de las enfermedades mÃƒÂ¡s crueles que sigue sin tener cura.\n\nMitch visitarÃƒÂ¡ a su profesor cada martes y juntos debatirÃƒÂ¡n sobre muchos temas transcendentales, con el transfondo del sentido de la vida como leiv motiv, la familia, el matrimonio, los hijos, el perdÃƒÂ³n, la muerte, la vejez, el amor ... uno a uno se irÃƒÂ¡n desgranando en una serie de conversaciones entre profesor y alumno donde el primero tratarÃƒÂ¡ de dar la clase mÃƒÂ¡s importante de su vida, la ÃƒÂºltima, a su querido discÃƒÂ­pulo y amigo, desde su posiciÃƒÂ³n de un enfermo terminal que ve terminar sus dÃƒÂ­as y desea morir en paz, volcando toda su sabidurÃƒÂ­a en unas breves pero emotivas lecciones. Mitch no volverÃƒÂ¡ a ser la misma persona, junto a la silla de ruedas de su amigo primero y a su lecho de muerte despuÃƒÂ©s, reirÃƒÂ¡, llorarÃƒÂ¡ y debatirÃƒÂ¡ cuestiones que siempre le habÃƒÂ­an interesado pero a las que nunca habÃƒÂ­a prestado la suficiente atenciÃƒÂ³n.\n\nEl libro estÃƒÂ¡ lleno de detalles sobre la vida de un enfermo de ELA y su lucha diaria, sin esperanzas, contra el destino, no obstante tambiÃƒÂ©n hay momentos muy emotivos y bellos, y sobre todo la idea central de que a pesar de todo la vida vale la pena vivirla y que el amor es lo que le da sentido. Morrie Schwartz se despedirÃƒÂ¡ finalmente del mundo no sin antes haber dejado una profunda huella en las personas que han compartido su vida y tambiÃƒÂ©n en aquellos que le han acompaÃƒÂ±ado en esos momentos tan duros. Poseedor de un optimismo invulnerable y una desbordante humanidad encara el ideal de aquello que todos quisiÃƒÂ©ramos ser, un Buda, un ser que hace tiempo que dejÃƒÂ³ de luchar contra el mundo y contra sÃƒÂ­ mismo y que ha conseguido desterrar, a pesar de sus terribles circunstancias, el sufrimiento psicolÃƒÂ³gico de su vida.\n\nEs dificil leer algunos pasajes sin sentir congoja, sobre todo cuando sabes que la historia relatada es real, cuanto ha callado o alterado el Sr. Albom en su obra es algo que nunca sabremos, lo que no le resta ni un ÃƒÂ¡pice de valor a lo relatado en la misma. Me ha gustado sobre todo el tratamiento que a lo largo de todo el libro se hace del tema de la muerte Ã‚Â¿existe alguien preocupado todavÃƒÂ­a por el sentido de la vida?... harÃƒÂ­a bien en echarle un vistazo a esta bella obra.\n\nLo mejor: Breve, emotivo, con momentos duros pero a la vez cargado de esperanza y con un hermoso mensaje vital, M. Albom consechÃƒÂ³ un mÃƒÂ¡s que merecido ÃƒÂ©xito por este libro. Se lee prÃƒÂ¡cticamente de un tirÃƒÂ³n y vale la pena, es una de esas obras que uno no puede dejar pasar por alto. Cualquiera que haya tenido un familiar consumiÃƒÂ©ndose lentamente y sufriendo una grave enfermedad se sentirÃƒÂ¡ identificado con esta novela.\n\nLo peor: Un poco repetitivo, se echan de menos mÃƒÂ¡s conversaciones entre los dos protagonistas o al menos mÃƒÂ¡s detalles en las mismas. Ese apelar a nuestro lado mÃƒÂ¡s sensible termina cansando un poco y &quot;matando el nervio&quot;, llega un punto en que deja de impresionar tanto y posiblemente se haga un poco corto.","torrent":{"xt":"urn:btih:3b08cea8a9c2b2a75e888bc058e86eba91cbacaa","amp;dn":"Martes+con+mi+Viejo+Profesor+-+Alborn+Micht+%5BEpub%5D%5BSpanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b08cea8a9c2b2a75e888bc058e86eba91cbacaa","infoHashBuffer":{"type":"Buffer","data":[59,8,206,168,169,194,178,167,94,136,139,192,88,232,110,186,145,203,172,170]},"announce":[],"urlList":[]}}