{"title":"Kim Wilde - Chequered Love","uid":4866631,"size":120549380,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:3be104c8f8f15e97fa3f83ede9a172a7ebcf7acf&amp;dn=Kim+Wilde+-+Chequered+Love&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1240558701,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Chequered Love&quot; is the second single by British singer Kim Wilde.\n\nThe song was released in the spring of 1981 to follow-up Wilde's hugely successful debut &quot;Kids in America.&quot; As with that single, writing credits were given to Wilde's father and brother Marty and Ricky Wilde with the latter also being given production credits.\n\n&quot;Chequered Love&quot; became another big hit for Wilde, reaching the UK Top 5 and peaking inside the Top 10 all around the world. The song later appeared on Wilde's self-titled debut album. It has become one of her most famous and enduring songs.\n\nKim Wilde is the first studio album by Kim Wilde, released in 1981.\n\nKim Wilde's debut album was released when she was 20 years old and turned her into Europe's most popular female pop star. Most of the music on this album was played by the symphonic rock band The Enid and the songs were all written by Marty Wilde and Ricky Wilde. Production duties were fulfilled by Ricky Wilde. The album was certified Gold in the UK.\n\nMusically, the album was mainly rock-oriented, which wasn't surprising given the appearance of The Enid, but it also featured a reggae track (&quot;Everything We Know&quot;) and a brass section appeared on &quot;2 6 5 8 0&quot;. Lyrically, Marty Wilde provided a few surprises: besides the obligatory love songs there was also a song about a rare minority of people who continually hear sound in their head (&quot;Water On Glass&quot;), the deterioration of inner cities (&quot;Our Town&quot;) and a song about a theory that sound is alive (&quot;Tuning In Tuning On&quot;). The singles &quot;Kids in America&quot; and &quot;Chequered Love&quot; were big hits all over Europe, becoming classic pop songs.\n\nThe album entered the UK album charts at #10, moving into the Top 3 the next week. During promotion, Kim's band consisted of Ricky Wilde, James Stevenson and later boyfriend Calvin Hayes, who also appeared on the sleeve of the album. Kim later commented that, at that time in the industry, it was passe for a female to attempt to launch a serious career in pop music on her own, and that the backing band had been shown on the sleeve to give credibility to the album. Still, she was attacked for trying to copy the allure of U.S. band Blondie.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:3be104c8f8f15e97fa3f83ede9a172a7ebcf7acf","amp;dn":"Kim+Wilde+-+Chequered+Love","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3be104c8f8f15e97fa3f83ede9a172a7ebcf7acf","infoHashBuffer":{"type":"Buffer","data":[59,225,4,200,248,241,94,151,250,63,131,237,233,161,114,167,235,207,122,207]},"announce":[],"urlList":[]}}