{"title":"Buena Vista Social Club (1999) (ISO, PAL)","uid":5635656,"size":4374247897,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3da4d86cab5de56242085899679f699b2f0b4044&amp;dn=Buena+Vista+Social+Club+%281999%29+%28ISO%2C+PAL%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"alekow1","files":4,"time":1276880185,"description":"\nThis is a Greek release.\nNot compressed or edited.\n\n\n\n\n[Amazon.com essential video\n\nIn 1996, composer, producer, and guitar legend Ry Cooder entered Egrem Studios in Havana with the forgotten greats of Cuban music, many of them in their 60s and 70s, some of them long since retired. The resulting album, Buena Vista Social Club, became a Grammy-winning international bestseller. \nWhen Cooder returned to Havana in 1998 to record a solo album by 72-year-old vocalist Ibrahim Ferrer, filmmaker Wim Wenders was on hand to document the occasion. \nWenders splits the film between portraits of the performers, who tell their stories directly to the camera as they wander the streets and neighborhoods of Havana, and a celebration of the music heard in performance scenes in the studio, in their first concert in Amsterdam, and in their second and final concert at Carnegie Hall. The songs are too often cut short in this fashion, but Buena Vista Social Club is not a concert film. \nWenders weaves the artist biographies with a glimpse of modern Cuba remembering its past, capturing a lost culture in music that is suddenly, unexpectedly revived for audiences in Havana and around the world. Wenders makes his presence practically invisible, as if his directorial flourishes or off-screen narration might deflect attention from the artists, who do a fine job of telling their own stories through interviews and music. \nIt's a loving portrait of a master class in Cuban music, with a vital cast of aging performers whose energy and passion belie their years. --Sean Axmaker (Amazon)\n\n\n\n\nDirected By: Wim Wenders\nProducer: Ry Cooder\n\n\nFormat: R2 / PAL / DVD 9\nLanguage: English, Spanish\nSubs: Greek\n\n\n\nLabel: Road Movies Film Production\nReleased: 1999 \n\n\nDVD-rip by alekow (UltraIso)\nDVD Cover Included (400dpi)\n\n\n\n\n\n\nEnjoy, Seed and Share\n","torrent":{"xt":"urn:btih:3da4d86cab5de56242085899679f699b2f0b4044","amp;dn":"Buena+Vista+Social+Club+%281999%29+%28ISO%2C+PAL%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3da4d86cab5de56242085899679f699b2f0b4044","infoHashBuffer":{"type":"Buffer","data":[61,164,216,108,171,93,229,98,66,8,88,153,103,159,105,155,47,11,64,68]},"announce":[],"urlList":[]}}