{"title":"Sexually Broken--Lanky model Hailey Young rag doll fucked Matt W","uid":9037133,"size":815681745,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:3dff570df08dae28b2c9af2fafd9b60948a0cab9&amp;dn=Sexually+Broken--Lanky+model+Hailey+Young+rag+doll+fucked+Matt+W&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"merzedes","files":-1,"time":1381534848,"description":"\nLanky model Hailey Young rag doll fucked all over a couch while tightly bound, punishing BJs! | Hailey Young | Matt Williams\n\nOctober 11, 2013 \n\n\nMP4 only.\n \n \nHailey Young was born to fuck. It is what she does best. We like sexual athletes around here, and Hailey is in the Major Leagues. Today we are going to turn her into a bag of holes and stick her so full of dick her brain melts and runs out of her ears.\n\nWe start off her firmly bound in a box tie that keeps her completely secure while being completely comfortable. She didn't going anywhere. Our little cock slut is deposited on her knees and ready for use. Which is exactly what we do-we use the back of her throat hole like a parking garage. Hailey makes every inch of the dick disappear, and she does it with ease. Hailey is the type of girl that gives &quot;nose on the belly&quot; blow jobs. That is our favorite kind of girl.\n\nHer large pleading eyes and wide open mouth inspire us, and we haul her up onto the couch to get at her throat from another angle. Pushing down on the back of her head buries the cock even deeper down her well-used mouth hole. She handles it with ease, and that is when we decided to simply open the floodgates. Hailey is brutally rag-dolled fucked all over the couch. From every angle and every position, we flip her lean bound body around like a pancake and all she can do is endure and take the cock. She is dicked down so hard her eyes rattle in her skull.\n\nA final massive throat pounding just to drive the point home that she is simply here to be used leaves her limp and gasping, and then we add the vibrator. It is too intense, and Hailey desperately tries to escape from the sensation, but she isn't going anywhere. We use her waist tie to hold her in place, and she cums upside down, red-faced and covered in sweat, her screams echoing from the rafters. We have had our fill of her today and leave her naked and bound, still upside down on our couch. She is too spent to even twitch. Good girl Hailey, good girl. \n\nScreens &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/10_11hyoung5/SexuallyBroken-Hailey-Young-Matt-Williams-Lanky-model-Hailey-Young-rag-doll-fucked-all-over-a-couch-while-tightly-bound-punishing-BJs.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/10_11hyoung5/SexuallyBroken-Hailey-Young-Matt-Williams-Lanky-model-Hailey-Young-rag-doll-fucked-all-over-a-couch-while-tightly-bound-punishing-BJs.php&lt;/a&gt;\n\n12 000 uploads and counting, 13k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:3dff570df08dae28b2c9af2fafd9b60948a0cab9","amp;dn":"Sexually+Broken--Lanky+model+Hailey+Young+rag+doll+fucked+Matt+W","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3dff570df08dae28b2c9af2fafd9b60948a0cab9","infoHashBuffer":{"type":"Buffer","data":[61,255,87,13,240,141,174,40,178,201,175,47,175,217,182,9,72,160,202,185]},"announce":[],"urlList":[]}}