{"title":"Ruby Velle &amp; The Soulphonics - It's About Time  2012","uid":12115529,"size":102513743,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3ea3a6b69a39d3ce6ad1c2feae590b20809f0694&amp;dn=Ruby+Velle+%26amp%3B+The+Soulphonics+-+It%27s+About+Time++2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"RoffeTheCoolMan","files":11,"time":1436684849,"description":"Ruby Velle And The Soulphonics It's About Time \n\nIt's About Time, a long overdue full-length album from Atlanta's Ruby Velle &amp; The Soulphonics, brings on an arsenal of soulful original music and poignant lyrics. The album features 10 original songs chiming in at just over 40 minutes in length, recorded on 1/2&quot; 8-track tape by producer and keyboardist Spencer Garn. Fronting the 7-piece powerhouse band is Ruby Velle, a Canadian born little lady of southern influence and East Indian decent, whose voice and appearance often surprise people when they hear and see her live for the first time. \n\nLeading the pack is &quot;My Dear,&quot; a powerful back-beat soul groove that sets the tone for the record and teases the listener to hear more. Then the track &quot;Medicine Spoon&quot; drops into a fast paced funky drumbeat, perfect for sampling as the genre is known for. Throughout the album there are medium and fast paced songs with tasteful horn arrangements and full string ensembles featured on &quot;The Agenda&quot; and &quot;Mr. Wrong.&quot; &quot;It's About Time,&quot; the band's foray into political commentary, offers an epic and enormous sound mixed with meaningful, timely lyrics.\n\nRuby Velle &amp; The Soulphonics' roots are embedded in the rich sound and history of Georgia soul, beginning with the early '50s and '60s R&amp;B that became so well known around the world. Having performed countless gigs since their inception, and with a slew of 45 RPM singles already under their belts, the brand has already contributed heavily to the steadily increasing awareness of genuine rhythm and blues music that exists today. They pack clubs and festivals with their original brand of soul, all of which is written and recorded in Atlanta.\n\nRuby Velle And The Soulphonics It's About Time Track Listing:\n\n1.  My Dear\n2.  Medicine Spoon\n3.  The Man Says\n4.  The Agenda\n5.  Looking For A Better Thing\n6.  Soul of the Earth\n7.  Coming Home To You\n8.  Mr. Wrong\n9.  Longview\n10. It's About Time\n\n\nPER REUQEST AND SEEEED PLEASE !!!!","torrent":{"xt":"urn:btih:3ea3a6b69a39d3ce6ad1c2feae590b20809f0694","amp;dn":"Ruby+Velle+%26amp%3B+The+Soulphonics+-+It%27s+About+Time++2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ea3a6b69a39d3ce6ad1c2feae590b20809f0694","infoHashBuffer":{"type":"Buffer","data":[62,163,166,182,154,57,211,206,106,209,194,254,174,89,11,32,128,159,6,148]},"announce":[],"urlList":[]}}