{"title":"Norman Lippert - The Girl On The Dock","uid":4785994,"size":3142968,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3ebc8728c825ce7c8a0ccc6a6a8bfdaf43ce9c1b&amp;dn=Norman+Lippert+-+The+Girl+On+The+Dock&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Zealote","files":1,"time":1237555299,"description":"Returning to the home of her grandfather after her final school year, Petra Morganstern is a changed young witch. She has passed the hardest test of all: caught in the web of an evil plot, Petra refused to kill an innocent girl as payment for the return of her long-dead parents. Now, confident in her choice, yet plagued by recurring dreams of her loss, Petra must face the unsettling fact that her choice might not have been final after all.\n\nThe one ray of hope in Petra's life is her younger step-sister, Izabella, whose simple-minded charm is only offset by the awful Phyllis, her hateful mother, who plans to send the youn girl away to the Percival Sunnyton work farm for the rest of her life. Desperate to protect Izabella from the increasingly deranged rages of Phyllis, Petra struggles to find a balance between the forces that seek to rule her own heart. Will she cling to the choice she made during her previous year, upholding good over her own greatest desires, or will the ghost of power and selfishness, always at work in the back room of Petra's mind, be her ultimate undoing?\n\nAs things spiral steadily out of control, Petra finds herself confronted with the unforgiving force of destiny, thrusting her into the ultimate choice one more time. Only this time, no one will be there to save the day. This time, the choice will be Petra's alone.\n\n\nG. Norman Lippert has been writing for over a decade, but only began sharing his work with the world when he completed his first fan-fiction novel, James Potter and the Hall of Elders' Crossing. Garnering a rather shocking worldwide following, JPHEC became the topic of international media, including the Scotsman newspaper, Fox affiliates across the United States, and Canadian Public radio. Since its intial release, the story has been translated into at least five langagues. Together with its sequel, James Potter and the Curse of the Gatekeeper, the James Potter fan fiction series has been viewed by well over a million readers worldwide.\n\nThe Girl on the Dock is George's second original (non fan-fiction) story released for publication.\n\n &lt;a href=&quot;\nhttp://www.girlonthedock.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.girlonthedock.com/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.elderscrossing.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.elderscrossing.com/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.gatekeeperscurse.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.gatekeeperscurse.com/&lt;/a&gt;\n","torrent":{"xt":"urn:btih:3ebc8728c825ce7c8a0ccc6a6a8bfdaf43ce9c1b","amp;dn":"Norman+Lippert+-+The+Girl+On+The+Dock","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ebc8728c825ce7c8a0ccc6a6a8bfdaf43ce9c1b","infoHashBuffer":{"type":"Buffer","data":[62,188,135,40,200,37,206,124,138,12,204,106,106,139,253,175,67,206,156,27]},"announce":[],"urlList":[]}}