{"title":"Cut Copy - Free Your Mind (2013) [FLAC]","uid":9140038,"size":387648463,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3f1c5c7a8af71886afc0d7dbc1dba5c7ab529f50&amp;dn=Cut+Copy+-+Free+Your+Mind+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1383494075,"description":"\n  Cut Copy - Free Your Mind (2013) [FLAC]\n\n  Genre: Pop/Rock, Electronic\n  Styles: Synth Pop, Dance Punk, New Wave\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bit Rate: ~ 900 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  01 Intro\n  02 Free Your Mind\n  03 We Are Explorers\n  04 Let Me Show You Love\n  05 Into the Desert\n  06 Footsteps\n  07 In Memory Capsule\n  08 Above the City\n  09 Dark Corners &amp; Mountain Tops\n  10 Meet Me ina House of Love\n  11 Take Me Higher\n  12 The Waves\n  14 Walking in the Sky\n\n  After the release of their dark, '80s-inspired synth pop classic In Ghost Colours in 2008, Cut Copy have been warming up and expanding their sound to the point where they almost sound like a completely different band. 2011's Zonoscope was almost excessively bright and extroverted, with songs like &quot;Where I'm Going&quot; almost sounding like Jock Jams in comparison to the introspectively moody sound the band had previously established. Their 2013 album, Free Your Mind, is even bigger sounding and warmer than a hug from the sun. Taking tons of inspiration from the late-'80s and early-'90s club scene in the U.K. and touching on everything from the Hacienda-ready acid house to the thumping piano house of groups like Black Box, the album is a danceable love letter to the era. Almost every move the group makes is instantly familiar to anyone with any interest in that time period, but the band add more than enough of their own personality, as well as advanced skill at mixing and matching moods and feels, to keep it from being an empty exercise in nostalgia. \n\n  Call it a full exercise instead. Influences and inspirations aside, what makes the album work is the sense of joy and upbeat emotion that the band, and especially vocalist Dan Whitford, inject into every nook of every song. Starting off with &quot;Free Your Mind,&quot; a bongo and gospel backing vocal-filled empowerment jam so soft and fuzzy that even Primal Scream at their most &quot;Come Together&quot; dippy might find a bit much, and going from there, the record is light as a shiny helium balloon. Like that balloon, it doesn't lose its bouncy buoyancy until the very end. After all, the percolating house trax that should fill dancefloors (like the very Pet Shop Boys at their best-sounding &quot;Footsteps&quot;), higher-than-the-sun electro-pop (&quot;Dark Corners and Mountain Tops,&quot; which sounds like ELO gone full disco, &quot;Take Me Higher&quot;), and slowly grooving songs that are perfect fodder for late-night revelry (the K-Klass sampling &quot;Let Me Show You Love&quot;), the album ends with a bit of a stinker. &quot;Walking in the Sky&quot; comes off like the Verve at their U2-loving worst; overly preachy and obvious with its heart in the right place, but an annoyingly simple tune to go with it. \n\n  This stumble leaves a bad taste in the mouth, but one that can be easily removed by doubling back and listening to a great song like the uplifting &quot;We Are Explorers,&quot; that also has a message, and with it, a propulsive beat, a sparkling melody, and shimmering synths. So skip that track and the rest goes down as smoothly as a well-mixed, neon-colored cocktail, or four, and will leave you woozy and reeling from the music's warm embrace. Cut Copy may have left behind the monochromatic brilliance of their early work, but the explosion of colors they've added like Jackson Pollock on a bender has only made their growth more interesting and enriching.","torrent":{"xt":"urn:btih:3f1c5c7a8af71886afc0d7dbc1dba5c7ab529f50","amp;dn":"Cut+Copy+-+Free+Your+Mind+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f1c5c7a8af71886afc0d7dbc1dba5c7ab529f50","infoHashBuffer":{"type":"Buffer","data":[63,28,92,122,138,247,24,134,175,192,215,219,193,219,165,199,171,82,159,80]},"announce":[],"urlList":[]}}