{"title":"DYNASTY WARRIORS: GUNDAM 3 - XBOX360 - REGION FREE","uid":6501963,"size":5836077872,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:404b9827391c5fb5f753a05586340f934ed562a7&amp;dn=DYNASTY+WARRIORS%3A+GUNDAM+3+-+XBOX360+-+REGION+FREE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"boobsman","files":61,"time":1309279034,"description":"\nDynasty Warriors: Gundam 3 represents the next generation of futuristic mecha action with graphical and gameplay additions, bringing authenticity and astounding improvements to the series.\n\nSet in the future, chaotic warfare has engulfed the universe. The world is ripe with strife as gigantic mecha called Mobile Suits march to war on land and in space. Featuring characters and mecha from over 30 years of GundamÃ‚Â® anime and manga series, Dynasty Warriors: Gundam 3 thrusts players into the galactic melee with over 50 playable and upgradable characters and over 70 playable and upgradeable Mobile Suits combed from the Gundam universe. New additions include Mobile Suits from Mobile Suit Gundam 00, Mobile Suit Gundam UC and many more.\n\nDynasty Warriors: Gundam 3 also features a number of gameplay additions to the series, including 3 brand new featured systems, including the Partner Strike, Emergency Dash and Recovery Gauge Systems, which will bring a new level of tactical engagement to the series. Partner Strike System will enable the player to summon partner characters to the battlefield to assist at crucial moments affecting your characters current melee engagement or possibly the overall battlefield conditions for your army. Emergency Dash System will allow players to execute new cancel and evasion moves negating enemy attacks. This system will bring a new level to gameplay since powerful combos can be more easily parried. The new Recovery System enables players to recover health during battle allowing players the ability to recover in battle.\n\nAdditionally, Dynasty Warriors: Gundam 3 brings a new strategy facet to gameplay. Battlefields now incorporate multiple facilities with various functions. Capturing these locations will change the battlefield conditions and turn the tide of the battle in your favor. Furthermore, players can take their favorite Mobile Suits and engage others in head-to-head action in online versus mode and up to 4 player online multiplayer campaign mode.\n\nMecha overload: Over 50 playable and upgradable characters and over 70 playable and upgradeable Mobile Suits combed from the Gundam universe, including new Mobile Suits from Mobile Suit Gundam 00, Mobile Suit Gundam UC and many more.\n\nAnime in motion: Experience the Gundam anime and manga series come to life with an entirely new cel-shaded graphical treatment.\n\nDeeper gameplay systems: Enhanced and aggressive enemy AI adds to the challenge while new gameplay systems, including Partner Strike (summon partner characters to the battlefield at crucial moments), Emergency Dash (negate enemy attacks with new cancel and evasion moves) and Recovery Gauge (recover health during battle) expand the level of strategy and depth to the gameplay.\n\nStory mode returns: the popular mode originally introduced in the first Dynasty Warriors: Gundam is back with an entirely new campaign.\n\nThe biggest game yet: Tremendously deep with over hundreds of hours of gameplay! Plus the limitless replay value of online multiplayer with up to 4 players. ","torrent":{"xt":"urn:btih:404b9827391c5fb5f753a05586340f934ed562a7","amp;dn":"DYNASTY+WARRIORS%3A+GUNDAM+3+-+XBOX360+-+REGION+FREE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"404b9827391c5fb5f753a05586340f934ed562a7","infoHashBuffer":{"type":"Buffer","data":[64,75,152,39,57,28,95,181,247,83,160,85,134,52,15,147,78,213,98,167]},"announce":[],"urlList":[]}}