{"title":"Dino Crisis(PC GAME)","uid":4350023,"size":122479582,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:408720ad9095e5f07506a543ee2c6d66770fb72d&amp;dn=Dino+Crisis%28PC+GAME%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"YAWOT","files":1,"time":1219096341,"description":"Dino Crisis unrar and play\n\n\n\nDino Crisis is a survival horror game by Capcom that was released in 1999. It was originally released for the Sony PlayStation and later for the Sega Dreamcast and Microsoft Windows. It was produced and directed by Resident Evil creator Shinji Mikami.\n\nThe game:\nSet in 2009, a special forces team must find a way to survive in a secret government facility that has been infested with time-displaced dinosaurs. It features similar gameplay to the Resident Evil series and although Capcom promoted Dino Crisis as part of its own unique sub-genre dubbed &quot;panic horror&quot;, it is often categorized by the gaming press and public as another survival horror game.\n\nWhile Dino Crisis did not achieve the same level of success Resident Evil did, it was popular enough to gain two sequels: (Dino Crisis 2 and Dino Crisis 3) and a light gun-based spinoff in Capcom&amp;#039;s Gun Survivor series, known as Dino Stalker.\n\nCharacters:\n\n   * Regina (Stephanie Morgenstern) - The player&amp;#039;s character and the sole female member of the team. She is an intelligence agent and weapons expert, specializing in weapons maintenance. Playable.\n\n   * Gail (Alex Karzis) - A veteran spy, and the leader of the team. He is well known for his cold demeanor and seems to have a heart of stone. He carries a large heavy machine gun and his field of expertise seems to be combat. He cares a lot about his mission. He can ethere sirvive in the game or die. NonPlayable.\n\n   * Rick (Richard Yearwood) - The third member of the team and an expert computer hacker. He carries a Sniper Rifle. He seems to be much more easy-going than Gail, providing most of the comic relief. He is African-American. NonPlayable.\n\n   * Cooper (Robert Tinkler) - The fourth member of the extraction team. He&amp;#039;s blown off course at the start of the mission and ends up being eaten by a T. Rex. The rest of the team never learns this, and he is declared M.I.A. He carried the only outsourcing radio on the team, and his death puts the rest of the members in a bind. NonPlayable.\n\n   * Tom (Bino Tautorrez) - An agent of S.O.R.T., who has infiltrated the Ibis Island facility to investigate the reports of new-type weapons being researched. He is wounded by a dinosaur, and later dies.\n\n   * Dr. Edward Kirk (Adrian Truss) - The genius behind the Third Energy Theory. He was approached by the Borginian Republic who were interested in the properties of Third Energy as a weapon, and promised him all the funding, facilities, researchers and equipment he needed. \n\nTo that end, he staged his death and moved to Ibis Island, to where a Third Energy research facility had been set up for him and killed most of his workers with the help of the dinos.\n\nDinosaurs In order of their appearance, the dinosaurs in the game \n\nare:\n\n   * Velociraptor (the fictional Jurassic Park-style larger version.)\n   * Tyrannosaurus\n   * Pteranodon\n   * Compsognathus\n   * Therizinosaurus\n   * Deinonychus (the red-white-blue raptors, AKA Super Raptors)\n\nThird Energy:\n\nThird Energy is a fictional energy source in the video game series Dino Crisis. It apparently uses air as energy","torrent":{"xt":"urn:btih:408720ad9095e5f07506a543ee2c6d66770fb72d","amp;dn":"Dino+Crisis%28PC+GAME%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"408720ad9095e5f07506a543ee2c6d66770fb72d","infoHashBuffer":{"type":"Buffer","data":[64,135,32,173,144,149,229,240,117,6,165,67,238,44,109,102,119,15,183,45]},"announce":[],"urlList":[]}}