{"title":"Blood - A Critique of Christianity by Gil Anidjar (2014) [5 Vers","uid":10573384,"size":39238117,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:40c991784f41a73f5e9a93c733bdf09f6f9969bc&amp;dn=Blood+-+A+Critique+of+Christianity+by+Gil+Anidjar+%282014%29+%5B5+Vers&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"VikTSlick","files":-1,"time":1405614237,"description":"Title: Blood - A Critique of Christianity \nAuthor: Gil Anidjar\nCategory: Academic/Religion\nSeries: Religion, Culture, and Public Life\nHardcover: 464 pages\nPublisher: Columbia University Press (April 29, 2014)\nLanguage: English\nISBN-10: 0231167202\nISBN-13: 978-0231167208\n\nPromotional info/Publisher's summary - &quot;Blood, according to Gil Anidjar, maps the singular history of Christianity. As a category for historical analysis, blood can be seen through its literal and metaphorical uses as determining, sometimes even defining Western culture, politics, and social practices and their wide-ranging incarnations in nationalism, capitalism, and law.\n\nEngaging with a variety of sources, Anidjar explores the presence and the absence, the making and unmaking of blood in philosophy and medicine, law and literature, and economic and political thought from ancient Greece to medieval Spain, from the Bible to Shakespeare and Melville. The prevalence of blood in the social, juridical, and political organization of the modern West signals that we do not live in a secular age into which religion could return. Flowing across multiple boundaries, infusing them with violent precepts that we must address, blood undoes the presumed oppositions between religion and politics, economy and theology, and kinship and race. It demonstrates that what we think of as modern is in fact imbued with Christianity. Christianity, Blood fiercely argues, must be reconsidered beyond the boundaries of religion alone.&quot;\n\nReviews:\n&quot;This book is bound to become a standard against which future scholarship on the cultural history of Christianity and several related fields will be evaluated. It achieves the feat of offering an exhaustive genealogy of the significance of &quot;blood&quot; in Western civilization, thereby pulling blood into an urgently needed visibility.&quot; -Elisabeth Weber, University of California, Santa Barbara\n\n&quot;This is an original reading of the place of blood in Christian theology and religion and its far-reaching impact on the history and cultural practices of the West. It is distinguished by the singular voice of its author, who is at once fiercely critical, ironic, contemptuous, erudite, and enlightening as he engages thinkers both living and dead on the relationship between blood and its many metaphoric and literal representations. This is not a conventional book in any way, it is a manifesto, a call, if not to arms, then to recognition of the fact that Western thought, its social and political organization, is infused with Christianity, even if those influenced by it are not practicing Christians in any religious sense.&quot; -Joan W. Scott, Harold F. Linder Professor, Institute for Advanced Study\n\nThis torrent contains the original retail EPUB as well as conversions into MOBI, AZW3, LIT, and large print PDF formats done in Calibre. The front cover image and generated metadata.opf file are also included. Please seed, and enjoy.\n\nPlease visit and support my Suprbay release thread here, I would appreciate it:       &lt;a href=&quot;\nhttps://forum.suprbay.org/Thread-VikTSlick-s-Comics-Releases&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/Thread-VikTSlick-s-Comics-Releases&lt;/a&gt;","torrent":{"xt":"urn:btih:40c991784f41a73f5e9a93c733bdf09f6f9969bc","amp;dn":"Blood+-+A+Critique+of+Christianity+by+Gil+Anidjar+%282014%29+%5B5+Vers","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40c991784f41a73f5e9a93c733bdf09f6f9969bc","infoHashBuffer":{"type":"Buffer","data":[64,201,145,120,79,65,167,63,94,154,147,199,51,189,240,159,111,153,105,188]},"announce":[],"urlList":[]}}