{"title":"Finding Nouf &amp; City of Veils - Zoe Ferraris","uid":8633927,"size":743674,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:414de0099f797588e45c438da72c5f7da092692f&amp;dn=Finding+Nouf+%26amp%3B+City+of+Veils+-+Zoe+Ferraris&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":2,"time":1372701712,"description":"Zoe Ferraris is an American novelist who was born in Oklahoma. In 1991 she married a man from Saudi Arabia and lived in Jeddah, Saudi Arabia, with her in-laws for nine months. Her time in Saudi Arabia is the background for the three novels she has written.\n\nIn 2009, Zoe Ferraris won an Alex Award for Finding Nouf. Finding Nouf also won the 2008 Los Angeles Times Book Prize in the Art Seidenbaum Award for First Fiction category.\n\nFinding Nouf [ The Night of the Mir'aj]\n\nAmong the well-to-do families of Jeddah, Palestinian-born desert guide Nayir is an outsider. But when Nouf ash-Shrawi, the sixteen-year-old daughter of a wealthy Saudi dynasty, disappears just before her arranged marriage, Nayir is the man the Shrawis trust to bring her home. Days later Nouf's body is found in a desert wadi, but Nayir's task is not over; he feels compelled to uncover the disturbing circumstances surrounding her death. His search takes him far from his natural terrain, away from the endless dunes and empty skies of the desert and into the city of Jeddah, with its oppressive monuments, foreigners' compounds and shuttered apartments. Most troubling of all, his investigations force him to work closely with Katya Hijazi, a forensic scientist. He finds himself struggling with emotions he has fought all his life to repress and with loyalties he has never before questioned: to old friends, to his faith, and to a culture in which women take their secrets to their graves.\n\nVivid and suspenseful, The Night of the Mi'raj is an extraordinary psychological drama and a mesmerising portrait of a society at once exquisitely cultured and profoundly claustrophobic.\n\nAwards: Macavity Awards (Nominee)\n\nCity of Veils\n\nWhen the body of a brutally beaten woman is found on the beach in Jeddah, Saudi Arabia, Detective Osama Ibrahim dreads investigating another unsolvable murder--chillingly common in a city where the veils of conservative Islam keep women as anonymous in life as the victim is in death.\n\nBut Katya, one of the few females in the coroner's office, is determined to identify the woman and find her killer. Aided by her friend Nayir, she soon discovers that the victim was a young, controversial filmmaker named Leila. Was it Leila's connection to an incendiary Koranic scholar or a missing American man that got her killed?\n\nCity of Veils combines a suspenseful and tightly woven mystery with an intimate and nuanced portrait of women's lives in the Middle East. ","torrent":{"xt":"urn:btih:414de0099f797588e45c438da72c5f7da092692f","amp;dn":"Finding+Nouf+%26amp%3B+City+of+Veils+-+Zoe+Ferraris","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"414de0099f797588e45c438da72c5f7da092692f","infoHashBuffer":{"type":"Buffer","data":[65,77,224,9,159,121,117,136,228,92,67,141,167,44,95,125,160,146,105,47]},"announce":[],"urlList":[]}}