{"title":"New York, I Love You.DVDScreener R5.XVID","uid":5266247,"size":1254395274,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:414e31c52a4fe6dedeac0bd15bc46bf454da5f8b&amp;dn=New+York%2C+I+Love+You.DVDScreener+R5.XVID&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"nahla","files":1,"time":1262893191,"description":"New York, I Love You\nTÃƒÂ­tulo original: New York, I Love You\nGÃƒÂ©nero: Drama / Comedia / Amor\nDuraciÃƒÂ³n: 103 minutos\nPaÃƒÂ­s: Estados Unidos / Francia\nAÃƒÂ±o: 2009\nDirecciÃƒÂ³n: Yvan Attal / Allen Hughes / Shunji Iwai / Wen Jiang / Joshua Marston / Natalie Portman / Brett Ratner / Fatih Akin / Shekhar Kapur / Mira Nair / Randall Balsmeyer (Transiciones)\nProducciÃƒÂ³n: Emmanuel Benbihy / Marina Grasic\nGuiÃƒÂ³n: Yvan Attal, Allen Hughes, Shunji Iwai, Wen Jiang, Joshua Marston, Natalie Portman, Scarlett Johansson, Andrei Zvyagintsev, Fatih Akin, Randall Balsmeyer, Shekhar Kapur, Brett Ratner, Mira Nair\nFotografÃƒÂ­a: BenoÃƒÂ®t Debie, Pawel Edelman, Adam Kimmel, Mikhail Krichman, Michael McDonugh, Andrij Parekh, Declan Quinn, Mauricio Rubinstein\nMÃƒÂºsica: Antonio Pinto\nReparto: Bradley Cooper, Hayden Christensen, Andy GarcÃƒÂ­a, Rachel Bilson, Natalie Portman, Irrfan Khan, Emilie Ohana, Orlando Bloom, Christina Ricci, Maggie Q, Ethan Hawke, Anton Yelchin, James Caan, Olivia Thirlby, Drea De Matteo, Julie Christie, John Hurt, Shia LaBeouf, Ugur Yucel, Taylor Geare, Carlos Acosta, Shu Qi, Chris Cooper, Robin Wright Penn, Eli Wallach, Cloris Leachman\nEstreno en EspaÃƒÂ±a: 16-oct-2009\n\n\n\n\nTras Paris, je t'aime, ahora le toca el turno a Nueva York. Nueve historias de amor en la Gran Manzana, cada una dirigida por un realizador que le da tÃƒÂ­tulo a su segmento.\n\nWen Jiang - Ben es un carterista que intenta ligar con una chica llamada Molly... hasta que llega su novio, Garry, que serÃƒÂ¡ la horma del zapato de Ben.\nMira Nair - Una judÃƒÂ­a hasÃƒÂ­dica comercia con un hombre indio en el distrito de los diamantes, y a pesar de estar a punto de casarse, surge una chispa entre ellos.\nShunji Iwai - Un compositor bloqueado recibe la ayuda telefÃƒÂ³nica de la secretaria de su jefe.\nYvan Attal - Dos parejas que salen a la calle a fumar. La primera, un joven escritor intenta ligar con una mujer explosiva pero distante, aunque no sabe dÃƒÂ³nde se mete. La segunda, una mujer casada intenta seducir a un desconocido.\nBrett Ratner - Un chico que se ha quedado sin cita para el baile de graduaciÃƒÂ³n recibe la ayuda del farmacÃƒÂ©utico de su barrio, aunque su nueva cita viene con sorpresa.\nAllen Hughes - Un hombre y una mujer rememoran su pasional encuentro del dÃƒÂ­a anterior, sin saber si desean volver a encontrarse o no.\nShekhar Kapur - Una antigua cantante de ÃƒÂ³pera visita de nuevo un hotel en donde viviÃƒÂ³ grandes momentos, y conoce a un peculiar mayordomo.\nNatalie Portman - Un hombre pasea con su hija por Central Park y conoce de primera mano los estereotipos raciales que aÃƒÂºn permanecen en nuestra sociedad.\nFatih Akin - Un pintor se obsesiona con una joven tendera asiÃƒÂ¡tica.\nJoshua Marston - Una anciana pareja celebra su 63Ã‚Âº aniversario de boda con un viaje por la ciudad.\n\n\nTamaÃƒÂ±o: 1.23 GB\nIdioma: EspaÃƒÂ±ol/Castellano\nCalidad: DVD-Screener ","torrent":{"xt":"urn:btih:414e31c52a4fe6dedeac0bd15bc46bf454da5f8b","amp;dn":"New+York%2C+I+Love+You.DVDScreener+R5.XVID","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"414e31c52a4fe6dedeac0bd15bc46bf454da5f8b","infoHashBuffer":{"type":"Buffer","data":[65,78,49,197,42,79,230,222,222,172,11,209,91,196,107,244,84,218,95,139]},"announce":[],"urlList":[]}}