{"title":"Sexually Broken--Part two of Syren de Mer's BaRS show with rough","uid":12772686,"size":525164934,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:415835120ef8f5bdff32749bbec27e1a178cd865&amp;dn=Sexually+Broken--Part+two+of+Syren+de+Mer%27s+BaRS+show+with+rough&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"merzedes","files":1,"time":1447699614,"description":"\nPart two of Syren de Mer's BaRS show with rough brutal fucking and challenging deepthroat on BBC! | Syren De Mer | Matt Williams | Jack Hammer \r\n\r\nNovember 16, 2015\r\n\r\n\r\nHigh MP4 only.\r\n\r\n\r\nBusty MILF bound with metal pipes and turned into a sex sandwich \r\n\r\nThis isn’t going to be easy. Syren De Mer is lifestyle swinger that loves the dick. Her love of the dick is what got her into porn in the first place. She claims to be insatiable. She can never get enough dick. But today she might of just bitten off more than she can chew. Today she gets so stuffed full of the cock that it just might be too much for this swinger. Can she handle it?\r\n\r\nBound with metal pipes that force her down in a bend over position, Syren’s big bubble butt and mouth hole are exposed. She can not move or shift an inch. All she can do is take what we wish out. And what we have to dish out is relentless punishing dick. No mercy, no respite, just all of the hard rough fucking we can possibly offer. And what we can offer is a lot.\r\n\r\nIt is just too much for this self proclaimed cock slut and we have to shift out the bondage so that Syren can get on top of it. We are nothing if not thoughtful and change out the metal pipes so that we can continue to dish out the dick. Which we do with relish. Once she can breath again we make it so that she can no longer breathe by shoving hard cock right down her face pussy while taking her from behind.\r\n\r\nOur cock slut is dazed and drooling, her eyes vacant and unfocused. She claimed she loves the cock. We have given her so much cock that she can no longer recall her own name. And we are still not done with her yet. There is still one more position to go. Can Syren make it? Or will it be too much for her to take? Stay tuned to find out!\r\n\r\nScreens \nhttp://www.sexuallybroken.com/sexual/bondage/trailer.php?y=2015&amp;p=11_16smer8&amp;u=SexuallyBroken-Syren-De-Mer-Matt-Williams-Jack-Hammer-Part-two-of-Syren-de-Mers-BaRS-show-with-rough-brutal-fucking-and-challenging-deepthroat-on-BBC\r\n\r\nUploaded by Merzedes and Shallow2\r\n\r\n19 000 Femdom/BDSM/Fetish torrentuploads completed. Man.. feels like every 1000 goes by faster and faster ;)\r\n\r\nJust keep on leaving us the nice comments below and we are happy :)\r\n\r\nAny Questions ?? Read our FAQ!!\r\n \nhttps://yuq.me/users/23/079/W2kwa6hEeP.png\r\n \nhttp://s16.postimg.org/rxyfmji7p/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg\r\n\r\nCheers :-)","torrent":{"xt":"urn:btih:415835120ef8f5bdff32749bbec27e1a178cd865","amp;dn":"Sexually+Broken--Part+two+of+Syren+de+Mer%27s+BaRS+show+with+rough","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"415835120ef8f5bdff32749bbec27e1a178cd865","infoHashBuffer":{"type":"Buffer","data":[65,88,53,18,14,248,245,189,255,50,116,155,190,194,126,26,23,140,216,101]},"announce":[],"urlList":[]}}