{"title":"Fuel Cells: Principles Design and Analysis [2014] [PDF]","uid":12580168,"size":7547380,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4163bda63724b22e3d295a5feeb1cf173a8ad74c&amp;dn=Fuel+Cells%3A+Principles+Design+and+Analysis+%5B2014%5D+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"NoctDeath","files":2,"time":1444942058,"description":"Title: Fuel Cells: Principles Design and Analysis \r\nSeries: Mechanical and Aerospace Engineering Series (Book 55) \r\nAuthor: Shripad T. Revankar, Pradip Majumdar \r\nFormat: PDF \r\nHardcover: 748 pages \r\nPublisher: CRC Press (May 28, 2014) \r\nLanguage: English \r\nISBN: 978-1420089684 \r\n\r\n\r\nFuel Cells: Principles, Design, and Analysis considers the latest advances in fuel cell system development and deployment, and was written with engineering and science students in mind. This book provides readers with the fundamentals of fuel cell operation and design, and incorporates techniques and methods designed to analyze different fuel cell systems. It builds on three main themes: basic principles, analysis, and design.\r\n\r\nThe section on basic principles contains background information on fuel cells, including fundamental principles such as electrochemistry, thermodynamics, and kinetics of fuel cell reactions as well as mass and heat transfer in fuel cells. The section on design explores important characteristics associated with various fuel cell components, electrodes, electrocatalysts, and electrolytes, while the section on analysis examines phenomena characterization and modeling both at the component and system levels.\r\n\r\n- Includes objectives and a summary in each chapter\r\n- Presents examples and problems demonstrating theory/principle applications\r\n- Provides case studies on fuel cell analysis\r\n- Contains mathematical methods including numerical methods and MATLAB® Simulink® techniques\r\n- Offers references and material for further reading\r\n\r\nFuel Cells: Principles, Design, and Analysis presents the basic principles, examples, and models essential in the design and optimization of fuel cell systems. Based on more than ten years of the authors’ teaching experience, this text is an ideal resource for junior- to senior-level undergraduate students and for graduate students pursuing advanced fuel cell research and study","torrent":{"xt":"urn:btih:4163bda63724b22e3d295a5feeb1cf173a8ad74c","amp;dn":"Fuel+Cells%3A+Principles+Design+and+Analysis+%5B2014%5D+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4163bda63724b22e3d295a5feeb1cf173a8ad74c","infoHashBuffer":{"type":"Buffer","data":[65,99,189,166,55,36,178,46,61,41,90,95,238,177,207,23,58,138,215,76]},"announce":[],"urlList":[]}}