{"title":"[F-D]Mobile Suit Gundam seed Box 1 [480P][Dual-Audio]","uid":8542024,"size":995044095,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:41949c2d99240561f5aa8b423f87a891a52f953c&amp;dn=%5BF-D%5DMobile+Suit+Gundam+seed+Box+1+%5B480P%5D%5BDual-Audio%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Vandread9","files":-1,"time":1370419250,"description":"Plot:\nThe series is the first of the Gundam franchise set in the &quot;Cosmic Era&quot; in which mankind is divided between normal Earth dwelling humans, known as &quot;Naturals&quot;, and the genetically altered humans known as &quot;Coordinators&quot;, who live in space colonies.\n\nThe story, set during the Bloody Valentine War, begins in the neutral space colony Heliopolis, where secret development of advanced mobile suits for the Naturals' war effort is being conducted. The colony is attacked by ZAFT forces, the military of the Coordinators, with the objective of stealing the new units. During the incursion a teenager Coordinator named Kira Yamato, upon seeing his friends in danger, pilots the GAT-X105 Strike mobile suit to fend off the invaders but the colony is critically damaged in the ensuing fight. As Heliopolis disintegrates, the survivors board an Archangel class assault ship belonging to the Earth Alliance, the Natural's military, and begin their journey to the Alliance base in Alaska. During the journey to Earth, Kira pilots the Strike to counter a series of attacks by ZAFT but is seemingly killed by his childhood friend, ZAFT soldier Athrun Zala, during one of their battles in which he is nearly killed. Kira survives the attack is treated in one of the PLANT space colonies, home to the Coordinators. The Archangel arrives in Alaska but ZAFT launches a full scale attack on the base overpowering their enemies.\n\n\nInfo:\nAudio: Eng/Jap\nSubs: Eng\nEps: 12 + Extras\nQuality: Medium/High\nFormat: .mkv\nSize/ep: 80MB +/-\nEncoder: Frozen_Solid [F-D]\t","torrent":{"xt":"urn:btih:41949c2d99240561f5aa8b423f87a891a52f953c","amp;dn":"%5BF-D%5DMobile+Suit+Gundam+seed+Box+1+%5B480P%5D%5BDual-Audio%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41949c2d99240561f5aa8b423f87a891a52f953c","infoHashBuffer":{"type":"Buffer","data":[65,148,156,45,153,36,5,97,245,170,139,66,63,135,168,145,165,47,149,60]},"announce":[],"urlList":[]}}