{"title":"fakty i mity 10/2009 [pl][pdf]","uid":4765513,"size":35819450,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:41cea59bd2f8629b72fc8ba74e8a2ada8b626c69&amp;dn=fakty+i+mity+10%2F2009+%5Bpl%5D%5Bpdf%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rajtek321","files":2,"time":1236855434,"description":"Gazeta regularnie publikuje materialy dotyczace przestepstw kryminalnych i obyczajowych popelnianych przez duchownych rÃƒÂ³znych wyznan. Jako pierwsza, z niemal pÃƒÂ³lrocznym wyprzedzeniem w stosunku do publikacji &quot;Rzeczpospolitej&quot; opublikowala materialy kompromitujace katolickiego arcybiskupa z Poznania, Juliusza Paetza, a takze informacje o mafii paliwowej.\n\nPublikacje tygodnika sugeruja postep niezgodnej z Konstytucja klerykalizacji panstwa. W tygodniku ukazuja sie tez artykuly na temat szkodliwego wplywu kleru na dzieje ludzkosci oraz na sytuacje gospodarcza i polityczna rÃƒÂ³znych panstw, zwlaszcza Polski.\n\nZ inicjatywy redaktora naczelnego i czytelnikÃƒÂ³w tygodnika w 2002 roku doszlo do zalozenia Antyklerykalnej Partii Postepu RACJA. Partia ta, dzialajaca pod nowa nazwa RACJA Polskiej Lewicy, jest stale obecna na lamach tygodnika.\n\nTygodnik &quot;Fakty i Mity&quot; zbieral podpisy poparcia pod kandydatura Marii Szyszkowskiej w wyborach prezydenckich 2005, jednak liczba tych glosÃƒÂ³w nie byla wystarczajaca do zarejestrowania kandydatki. 14 wrzesnia 2005 udzielil poparcia Polskiej Partii Pracy i Komitetowi Wyborczemu PPP w wyborach parlamentarnych 2005 oraz Danielowi Podrzyckiemu (zginal w wypadku samochodowym krÃƒÂ³tko przed wyborami) w wyborach prezydenckich 2005. W kampaniach wyborczych do wladz wszystkich szczebli, tygodnik wspieral kandydatÃƒÂ³w innych partii, ktÃƒÂ³rzy deklarowali oficjalnie poglady antyklerykalne.\n\nOd marca 2007 roku tygodnik ma stalego korespondenta parlamentarnego. W listopadzie 2007 roku redakcja uruchomila na swojej stronie serwis aktualnych informacji. Uzupelnia on wersje drukowana gazety o biezace wiadomosci polityczne i spoleczne w zakresie tematyki poruszanej w tygodniku.\n\nKontrowersje \n\nTygodnik jako jedyny w Polsce zdecydowal sie na publikacje wywiadu z Grzegorzem Piotrowskim, bylym funkcjonariuszem tajnej milicji SB. Piotrowski opowiadal m.in. o dzialaniach IV Departamentu MSW, widzianych oczami pracownika tej komÃƒÂ³rki SB, zajmujacej sie osobami powiazanymi z Kosciolem rzymskokatolickim. Podczas odbywania kary wiezienia za zamordowanie ksiedza Jerzego Popieluszki, Piotrowski pojawil sie 9 marca 2000 wspÃƒÂ³lnie z Romanem Kotlinskim na konferencji prasowej inaugurujacej nowy tygodnik, podczas ktÃƒÂ³rej przedstawil nowe okolicznosci zamachu na ksiedza Popieluszke[potrzebne zrÃƒÂ³dlo]. W kampanii wyborczej 2007 premier Jaroslaw Kaczynski wielokrotnie przedstawial tygodnik jako czesc frontu przeciwko jego rzadowi, stwierdzajac, ze &quot;Fakty i Mity&quot; zatrudnialy Grzegorza Piotrowskiego. Informacje sugerujace te teze pojawily sie w niektÃƒÂ³rych publikacjach[2][3]. Redaktor naczelny Roman Kotlinski na lamach gazety (nr 43/2007) nazwal to &quot;klamliwa insynuacja&quot;. Stwierdzil, ze &quot;FiM&quot; nigdy nie zatrudnialy Piotrowskiego, a premier powoluje sie na nieprawdziwe publikacje dziennika Fakt, przeciwko ktÃƒÂ³remu toczy sie proces sadowy. Kotlinski zapowiedzial rozwazenie pozwu przeciwko Jaroslawowi Kaczynskiemu.","torrent":{"xt":"urn:btih:41cea59bd2f8629b72fc8ba74e8a2ada8b626c69","amp;dn":"fakty+i+mity+10%2F2009+%5Bpl%5D%5Bpdf%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41cea59bd2f8629b72fc8ba74e8a2ada8b626c69","infoHashBuffer":{"type":"Buffer","data":[65,206,165,155,210,248,98,155,114,252,139,167,78,138,42,218,139,98,108,105]},"announce":[],"urlList":[]}}