{"title":"Concise Encyclopedia of Composite Materials","uid":12404293,"size":89586101,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4433086da551c94d4ddbd9bb70dafdba86b00484&amp;dn=Concise+Encyclopedia+of+Composite+Materials&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1442069421,"description":"Concise Encyclopedia of Composite Materials (Elsevier, 1994).pdf\n\nISBN: 0-08-042300-0\n\nThe Concise Encyclopedia of Composite Materials, first published as a hardbound edition in 1989, has been updated and revised and is now available as a paperback for individual researchers requiring a fundamental reference source for this dynamic field.\nSince 1989, research involving composite materials has advanced rapidly and this revised edition reflects those changes with the addition of new articles, including recent work on nanocomposites, smart composite materials systems, and metallic multilayers.\n\nThe 67 articles included in this revised edition are presented in alphabetical order and each provides an introduction to one aspect of composite materials. Every article is extensively cross-referenced and includes a full bibliography. The volume contains over 250 photographs, drawings and tables as well as exhaustive subject and author indexes.\n\nThe comprehensive breadth of coverage of the field of composite materials makes this volume an invaluable source of reference for materials scientists and mechanical engineers involved in industrial and academic research into the fabrication, properties and applications of composite materials","torrent":{"xt":"urn:btih:4433086da551c94d4ddbd9bb70dafdba86b00484","amp;dn":"Concise+Encyclopedia+of+Composite+Materials","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4433086da551c94d4ddbd9bb70dafdba86b00484","infoHashBuffer":{"type":"Buffer","data":[68,51,8,109,165,81,201,77,77,219,217,187,112,218,253,186,134,176,4,132]},"announce":[],"urlList":[]}}