{"title":"Austin Powers: The Spy Who Shagged Me(1999)DVDRip.AC3(ENG)-DROCK","uid":6074446,"size":734578688,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:445018486ff4c97d0f145b543c0419e9dc18deb7&amp;dn=Austin+Powers%3A+The+Spy+Who+Shagged+Me%281999%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"drock232","files":-1,"time":1293764956,"description":"Austin Powers -- fashion photographer, denizen of Swingin' London, international espionage agent, and bane of dental hygienists everywhere -- returns in his second screen adventure. Powers (once again played by Mike Myers), a 1960s superspy stranded in the 1990s, discovers that his nemesis, criminal genius Dr. Evil (also Mike Myers), has somehow stolen his &quot;mojo&quot; (the secret to his otherwise inexplicable sex appeal) and traveled back in time to the 1960s as part of his latest fiendish scheme. Powers must also travel back in time to retrieve it, but if Austin doesn't quite fit into 1998, he's been there just long enough not to fit in in 1968 anymore, either. Powers also discovers that Dr. Evil has new allies this time: Mini-Me (Verne Troyer), a clone of Dr. Evil one-eighth his size but just as nasty; Fat Bastard (Myers yet again), whose name describes him just fine; and vixenish assassin Robin Swallows (Gia Carides). Powers' lack of mojo also proves troublesome when he's paired with his new partner, saucy CIA operative Felicity Shagwell (Heather Graham). Other characters returning from the first film include Elizabeth Hurley as Vanessa Kensington, Robert Wagner as Number Two, Michael York as Basil Exposition, Seth Green as Scott Evil, and Mindy Sterling as Frau Farbissina. Austin Powers: The Spy Who Shagged Me also includes cameo appearances from Tim Robbins, Jerry Springer, Woody Harrelson, and Burt Bacharach with his current songwriting partner, Elvis Costello. \n\nRipped with DVD Decrypter and Autogk.","torrent":{"xt":"urn:btih:445018486ff4c97d0f145b543c0419e9dc18deb7","amp;dn":"Austin+Powers%3A+The+Spy+Who+Shagged+Me%281999%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"445018486ff4c97d0f145b543c0419e9dc18deb7","infoHashBuffer":{"type":"Buffer","data":[68,80,24,72,111,244,201,125,15,20,91,84,60,4,25,233,220,24,222,183]},"announce":[],"urlList":[]}}