{"title":"Star Trek Hidden Evil + Crack/NoCD and Full Instructions","uid":4198216,"size":523175335,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:44a80ee024af588c989f595b932b8a2803bf3d0b&amp;dn=Star+Trek+Hidden+Evil+%2B+Crack%2FNoCD+and+Full+Instructions&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mrpresident2002","files":1,"time":1211348027,"description":"First off, select &amp;#039;Format&amp;#039; then &amp;#039;Word Wrap&amp;#039; if not already enabled\n\nStar Trek Hidden Evil ? 1999\nRipped with PowerIso4\n\n\nRead Completely!!!\n\n\nInstall notes:\n\n\n1. Burn or mount with daemon tools or your favorite drive emulator that can open .cue or .bin files. I recommend daemon tools!!!!\n\n\n2. Install game as directed, or choose your own install directory.\n\n\n3. Copy the cracked  ?HiddenEvil.exe? file from &quot;crack&quot; folder located in this download to ...install directoryStar Trek - Hidden EvilBin and replace  original &quot;HiddenEvil.exe&quot; file.\n\n\n4. Alternately, you can use the &quot;sthe10.exe&quot; file cracker app supplied with this download. Again, copy &quot;sthe10.exe&quot; to the ...install directoryStar Trek - Hidden EvilBin folder, and run &quot;sthe10.exe&quot;, it will then prompt you to crack the &quot;HiddenEvil.exe&quot; file. \n***NOTE*** If it says it cannot crack the file, right click on &quot;HiddenEvil.exe&quot; and select &quot;properties&quot;. Be sure that the &quot;Read Only&quot; function is disabled. Then try again. Save yourself the trouble and just copy the crack supplied.\n\n\n5. IMPORTANT!! This is an old game and may not run on some systems running winXP or Vista. I had the same problem. You MUST, once again open ...install directoryStar Trek - Hidden EvilBin and right click on the &quot;HiddenEvil.exe&quot; file. Select &quot;properties&quot;, compatibility tab, and run in win95, or win98ME mode, and I would recommend selecting the &quot;run in 640X480&quot; mode as well.  May solve other  issues with old software like this. The graphics are 640X480 anyways. Unless you?re using win95/98/ME, always select ?Software? display option when you start the game. If you run into issues or crashes after taking these steps, play with the compatibility modes and try disabling the other features and using both 95 and 98ME modes. Don&amp;#039;t use 256 Color mode.  I use Vista with an AMD FX60 dual core, Asus board, and 8800GTS video card with no problems using the basic settings described. No promises though.\n\n\nKeybinds are unchangeable and unlisted, so here they are as I know them, may be more:\n\nWASD = up left down right\nQE = strafe left right\nSpace= use/fire\nEnter= sometimes also a use function, stupid?\nTab= inventory, in here selecting items is ENTER not SHIFT\nShift= run\nNumber keys 1-9, NOT-NumberPad= quick select for Phaser, Tricorder, nerve pinch, hypo, communicator, and some found items\n\nThere is NO MOUSE function in this game? lame?\n\n\nIf you really enjoy old Star Trek games, then Star Trek: A Final Unity is a must. It&amp;#039;s an even older, point and click action/adventure made by Trilobyte in 1995, and must run in dosbox and will work on almost ANY system with dosbox. Considered by most Trekkies to be the best Star Trek game of all time. There is a torrent for it as well, just search the name ator www.isohunt.com\n\nGOOD LUCK!! And enjoy this rare Trek. \n\n-Xade\n","torrent":{"xt":"urn:btih:44a80ee024af588c989f595b932b8a2803bf3d0b","amp;dn":"Star+Trek+Hidden+Evil+%2B+Crack%2FNoCD+and+Full+Instructions","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"44a80ee024af588c989f595b932b8a2803bf3d0b","infoHashBuffer":{"type":"Buffer","data":[68,168,14,224,36,175,88,140,152,159,89,91,147,43,138,40,3,191,61,11]},"announce":[],"urlList":[]}}