{"title":"Christopher_Hitchens.vs.Peter_Hitchens.Debate.Religion.War.2008","uid":4481868,"size":491755828,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4535d74ee5474e59291fc98a6b94a8df5e46a185&amp;dn=Christopher_Hitchens.vs.Peter_Hitchens.Debate.Religion.War.2008&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sfantupetru","files":21,"time":1225600534,"description":"2008 - Hauenstein Center (CFI, IDA)\n\nBrother vs brother going on a very lively debate about hot topics like politics, war and Iraq in the first part (videos 1-4) and God and the Bible in second and third (videos 5-14). Bonus press conference included (5 videos). IPod friendly MP4 videos.\n\n\nChristopher Hitchens\n\nOne of the most controversial and compelling voices in Anglo-American journalism, has written twenty books, including biographies of Thomas Jefferson, Thomas Paine, and George Orwell, as well as scathing critiques of Henry Kissinger, Bill Clinton, and Mother Teresa.  Most recently, he wrote the book on atheism, God is Not Great: How Religion Poisons Everything, and edited The Portable Atheist: Essential Readings for the Nonbeliever.  A contributing editor to Vanity Fair and a frequent commentator on C-SPAN, he also writes regularly for The Atlantic, The New York Times Book Review, The Nation, Harper's Magazine, Slate, and The New York Review of Books.\n\nPeter Hitchens\n\nOne of Britain's most controversial journalists, blogs and writes a regular column for the Mail on Sunday.  Formerly a long-time writer for the Daily Express, Peter was once asked by former Prime Minister Tony Blair to &quot;sit down and stop being bad,&quot; after an aggressive press conference confrontation.  Peter is author of The Abolition of Britain: From Winston Churchill to Princess Diana and The Abolition of Liberty: The Decline of Order and Justice in England.  He has also written for The Spectator, The Guardian, and New Statesman.\n\n","torrent":{"xt":"urn:btih:4535d74ee5474e59291fc98a6b94a8df5e46a185","amp;dn":"Christopher_Hitchens.vs.Peter_Hitchens.Debate.Religion.War.2008","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4535d74ee5474e59291fc98a6b94a8df5e46a185","infoHashBuffer":{"type":"Buffer","data":[69,53,215,78,229,71,78,89,41,31,201,138,107,148,168,223,94,70,161,133]},"announce":[],"urlList":[]}}