{"title":"BBC - Britain's Big Wildlife Revival (2013) RMAC","uid":9044552,"size":6338060444,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:456b1e88f9178da9f7cb6ae292f1c73cfd52f476&amp;dn=BBC+-+Britain%27s+Big+Wildlife+Revival+%282013%29+RMAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rcdmac","files":30,"time":1381712940,"description":"[center][size=200][color=blue][b]Britain's Big Wildlife Revival[/b][/size][/color]\n[/center]\nBritain's Big Wildlife Revival brings together some of the BBC's most respected wildlife experts to highlight the plight of Britain's most at-risk animals.\n\n\n\nEpisode 1 - [color=orange][b]Woodland[/b][/color]\n[image=g1MthW7pXS]\n\nEpisode 1 of 6\nDURATION: 1 HOUR\nEllie Harrison and her team of wildlife experts explore our precious woodlands and their threatened wildlife. Ellie visits the oak woods of mid-Wales and a bluebell wood in the Chilterns, where she discovers that Britain's woodlands are suffering from centuries of loss and decades of neglect.\n\nIolo Williams champions the native red squirrel, and discovers how we are fighting back against the alien grey squirrel which forces out the reds and gives them a killer disease.\n\nNick Baker tracks down Britain's most venomous animal - the adder - to learn more about its bizarre and secret habits. Gordon Buchanan goes on a Highland quest in search of the near mythical Scottish wildcat. And wildlife gardener Mike Dilger finds out how a school in Portsmouth has transformed part of their playing field into a woodland packed with wildlife.\n\nFinally, Ellie takes to the air with a bird which has become one of the greatest conservation success stories ever - the majestic red kite.\n\n\nEpisode 2 - [b][color=orange]Coastal[/b][/color]\n[image=efT73E1ivA]\n\nEpisode 2 of 6\nDURATION: 1 HOUR\nEllie Harrison visits the Farne Islands, an offshore paradise for seabirds and seals, and one of the greatest wildlife spectacles in Britain. She gets attacked by Arctic terns, gets hands on with a puffin, and goes swimming with grey seals. Along the way she discovers how the country's coastal and marine wildlife is under threat.\n\nBill Oddie has been watching puffins since he was a child and now has the chance to discover where they go when they leave British shores. Iolo Williams climbs up to the nest of Britain's largest bird of prey, the sea eagle, to get a close up of their huge chicks and Miranda Krestovnikoff goes in search of the charismatic bottlenose dolphin. Finally, Ellie finds out how our largest mammal, the grey seal, triumphed over pollution and persecution.\n\n\nEpisode 3 - [color=orange][b]Urban[/b][/color]\n[image=KWtmrR7w5J]\n\nEpisode 3 of 6\nDURATION: 1 HOUR\nEllie Harrison takes to London's crowded streets to find out how our urban wildlife copes with living alongside millions of people. She visits the most urban woodland in London - a disused Victorian cemetery that is a haven for people and wildlife; and the London Wetland Centre, an oasis in the heart of the capital where wildlife is thriving.\n\nBen Fogle visits 'Hedgehog Street' in Bristol, where residents have joined together to make their gardens hedgehog friendly; bug hunter George McGavin tracks down our largest and most fearsome insect, the mighty stag-beetle; and David Lindo tramps the streets of the capital in a quest to see our most rapidly declining bird - the humble house sparrow. Finally, Ellie marvels at the peregrine falcon which has recently colonised city centres up and down the country - and gets to ring one of the precious chicks nesting on Norwich Cathedral.\n\n\nEpisode 4 - [b][color=orange]Rivers[/color][/b]\n[image=1bYRTGaDtF]\n\nEpisode 4 of 6\nDURATION: 1 HOUR\nEllie Harrison visits two very different rivers - the Tyne in Newcastle city centre and a chalk stream in rural Dorset - to find out how their wildlife is faring in this constantly changing habitat. She discovers an unusual arrival - a seabird nesting five miles from the sea on Tyne Bridge - and goes 'wild swimming' to recapture memories of her childhood.\n\nGordon Buchanan finds out how we are giving river salmon a helping hand; Philippa Forrester goes in search of our most iconic and beautiful river bird, the kingfisher; and Miranda Krestovnikoff discovers how, at the 11th hour, we may be able to save the native white-clawed crayfish. Finally, Ellie goes in search of the elusive otter - will she see one?\n\n\nEpisode 5 - [b][color=orange]Farmland[/color][/b]\n[image=jEm8CpWdHl]\n\nEpisode 5 of 6\nDURATION: 1 HOUR\nEllie Harrison discovers how much of our countryside has been transformed into a food factory, squeezing out our precious farmland wildlife - and how farmers are now bringing countryside creatures back from the brink by creating new places for them to live. She visits an organic farm and a scheme in Wiltshire where farmers are working together to recreate habitat on a huge scale.\n\nAdam Henson takes a trip down memory lane to his childhood where hares were a common sight and finds out why they have declined so much; Steve Leonard investigates the charismatic barn owl; and Michaela Strachan takes a spooky walk in search of the greater horseshoe bat. Finally, Ellie discovers how the large blue butterfly returned from extinction in the UK - with a helping hand from us.\n\n\nEpisode 6 - [b][color=orange]Wetland[/color][/b]\n[image=E8GhtP4ybV]\n\nEpisode 6 of 6\nDURATION: 1 HOUR\nIn the last episode of the series, Ellie Harrison visits the Somerset Levels, a newly created wetland in the shadow of Glastonbury Tor, where creatures once on the brink of extinction are now returning thanks to our efforts. She goes on a nocturnal hunt for insects, watches rare egrets and bitterns, and discovers how these former peat diggings have been transformed into a special place for people and wildlife.\n\nBen Fogle goes in search of the slipperiest of all our creatures - the eel; George McGavin tracks down the 'underwater dragon' - the great crested newt; and Ellie joins a team devoted to saving our most endangered mammal, the water vole. She also discovers how our tallest bird, the crane, has been brought back to the West Country after an absence of almost 500 years.\n\n\n\n***********************************\n\n\n[b]General[/b]\n\nFormat\tMatroska\nFormat version\tVersion 2\nFile size\t988 MB\nDuration (ms)\t58mn 59s\nOverallBitRate_Mode/String\tVariable\nTotal bitrate\t2 341 Kbps\nEncoded application\tLavf54.63.104\nEncoded library\tLavf54.63.104\nMOOVPOSITION\t36\nAVCPROFILE\t100\nAVCLEVEL\t41\nAACAOT\t2\nVIDEOFRAMERATE\t25\nAUDIOCHANNELS\t2\n\n[b]Video[/b]\nId\t1\nFormat\tAVC\nFormat info\tAdvanced Video Codec\nFormat profile\t&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;7038191718303c445e41&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\nUse of CABAC\tYes\nRefFrames\t3 frames\nCodec Id\tV_MPEG4/ISO/AVC\nDuration (ms)\t58mn 59s\nBitrate mode\tVariable\nBitrate maximum\t3 500 Kbps\nWidth\t1 280 pixels\nHeight\t720 pixels\nAspect ratio\t16:9\nFramerate mode\tConstant\nFramerate\t25.000 fps\nColorimetry\tYUV\nColos space\t4:2:0\nBit depth\t8 bits\nScan type\tProgressive\nDefault/String\tYes\nForced/String\tNo\n\n[b]Audio[/b]\nId\t2\nFormat\tAAC\nFormat info\tAdvanced Audio Codec\nFormat profile\tLC\nCodec Id\tA_AAC\nDuration (ms)\t58mn 59s\nChannel(s)\t2 channels\nChannelPositions\tFront: L R\nSampling rate\t48.0 KHz\nCompression_Mode/String\tLossy\nVideo_Delay/String\t1mn 5s\nDefault/String\tYes\nForced/String\tNo\n\n\nEncoded by RMAC","torrent":{"xt":"urn:btih:456b1e88f9178da9f7cb6ae292f1c73cfd52f476","amp;dn":"BBC+-+Britain%27s+Big+Wildlife+Revival+%282013%29+RMAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"456b1e88f9178da9f7cb6ae292f1c73cfd52f476","infoHashBuffer":{"type":"Buffer","data":[69,107,30,136,249,23,141,169,247,203,106,226,146,241,199,60,253,82,244,118]},"announce":[],"urlList":[]}}