{"title":"Next To Me - Allie Everhart","uid":13133134,"size":870404,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4670a47c8d3a3dfd4640090496a1c2f91a424b04&amp;dn=Next+To+Me+-+Allie+Everhart&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1451866201,"description":"After losing her parents and brother in a car accident, Callie dropped out of college and went to live in the small town where her family used to spend the summers. A year later, and struggling to move on, she keeps to herself and wants to be left alone. So she’s not too happy when her new neighbor keeps knocking on her door.\r\n\r\nNash Wheeler, a 25-year-old construction worker from Chicago, inherited the house next to Callie’s and is living there while he renovates it. Outgoing, confident, and never one to back down from a challenge, Nash sets out to get to know his new neighbor, inviting her over for dinner and offering to fix things around her house.\r\n\r\nAs much as his persistence annoys her, Callie finds herself attracted to the tall, muscular, blue-eyed guy next door. And the more time she spends with him, the more she realizes how much they have in common. Like Callie, Nash has experienced loss, but when he opens up to her about it, she’s not willing to do the same. It’s too personal.\r\n\r\nNash is just her neighbor. Just some guy living there for the summer. But is that really all he is? Or is he the one person who can finally help her move on?","torrent":{"xt":"urn:btih:4670a47c8d3a3dfd4640090496a1c2f91a424b04","amp;dn":"Next+To+Me+-+Allie+Everhart","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4670a47c8d3a3dfd4640090496a1c2f91a424b04","infoHashBuffer":{"type":"Buffer","data":[70,112,164,124,141,58,61,253,70,64,9,4,150,161,194,249,26,66,75,4]},"announce":[],"urlList":[]}}