{"title":"[Clips4sale] Lucy Marie - Mommy gives you an extra special blowj","uid":15529036,"size":575753029,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:46b0c7eca575a213895c1755e73afcccf4e13de7&amp;dn=%5BClips4sale%5D+Lucy+Marie+-+Mommy+gives+you+an+extra+special+blowj&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LucasCar","files":1,"time":1470808412,"description":"[Clips4sale] Lucy Marie – Mommy gives you an extra special blowjob HD (720p/2016)\r\n\r\n Hot taboo Mom/son fantasy with a long sensual POV blowjob Mommy never swallows for Daddy but she will for her precious son! I am doing yoga and meditating and you are my horny son spying on me as usual…staring longingly at my big juicy tits, you are becoming obsessed and steal any opportunity to spy on me and jerk off. I know you lust over my body and it really turns me on, I tease you a little for spying and then invite you to grope me as long as you keep it our little secret. Seeing how hard it makes you I take my bra off and encourage you to stroke over me… I tell you how much more I love you than Daddy. You ask me to prove it and to give you examples of how I treat you differently. I list all the ways I prefer you over him and tell you how I stroke my pussy over you once Daddy falls asleep. I also tell you how I would swallow every last drop of your cum if I had you in my mouth. I decide to give you a blowjob..I look you in the eyes as I lick and suck and tease you, calling you my good boy and telling you how good it feels. Finally you explode in my mouth and I play with the cum for a while…allowing it to slide out of my mouth and licking it back up. Clip contains: dirty talk, cum swallowing, cum play, MILF, topless, taboo, cleavage, POV, blowjob\r\n\r\nCategories: MILF, TABOO, CUM SWALLOWERS, TOPLESS, CUM IN MOUTH, mommy blowjob, taboo pov blowjob, cum swallowing.\r\n \nhttp://screenimage.net/img-57aaa53545d9e.html\r\n \nhttp://screenimage.net/img-57aaa539d4284.html\r\n\r\n\r\n★ ★ ★  For more Exclusive Porn please visit ★ ★ ★\r\n \nhttps://thepiratebay.org/user/LucasCar","torrent":{"xt":"urn:btih:46b0c7eca575a213895c1755e73afcccf4e13de7","amp;dn":"%5BClips4sale%5D+Lucy+Marie+-+Mommy+gives+you+an+extra+special+blowj","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"46b0c7eca575a213895c1755e73afcccf4e13de7","infoHashBuffer":{"type":"Buffer","data":[70,176,199,236,165,117,162,19,137,92,23,85,231,58,252,204,244,225,61,231]},"announce":[],"urlList":[]}}