{"title":"The Carpenters - A Song for You","uid":8316744,"size":53549940,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:473f49a7ae05c708ccc84c35f583e1907a2f0b07&amp;dn=The+Carpenters+-+A+Song+for+You&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ViejoLobodeMar","files":13,"time":1364605777,"description":"A Song for You is the fourth album released by the Carpenters, released on June 13, 1972. According to Richard Carpenter, &quot;A Song for You was intended to be a concept album (of sorts) with the title tune opening and closing the set and the bookended selections comprising the 'song'.&quot;[4]\nIn Cash Box's Top 100 Albums of 1972, A Song for You was ranked #26.[5] A special gold-plated disc CD of A Song for You was later sold to the general public.\nSix songs were released as A-side singles internationally: &quot;Hurting Each Other&quot;, &quot;It's Going to Take Some Time&quot;, &quot;Goodbye to Love&quot;, &quot;Top of the World&quot;, &quot;I Won't Last a Day Without You&quot;, and &quot;Bless the Beasts and Children&quot;.\n\n&quot;Hurting Each Other&quot;, a cover of an obscure Ruby &amp; the Romantics tune, was the first single issued from A Song for You in early 1972, and reached number two, becoming the Carpenters' sixth straight gold single. A cover of Carole King's &quot;It's Going to Take Some Time&quot; followed and peaked at number 12, and was followed by the number seven hit &quot;Goodbye to Love&quot;, which was refused airplay on some easy listening radio stations because of a fuzz guitar solo by Tony Peluso. The song had a significant impact on the power ballad songs which followed. The album also included the Carpenters' version of the Academy Award nominated title song from the 1971 film Bless the Beasts and Children, which had already charted at number 67 on the Hot 100 as the flip side of the duo's version of &quot;Superstar&quot;.\nThe album's biggest hit single, the number one smash &quot;Top of the World&quot;, was not issued until over a year after the album's release. According to Richard Carpenter, who co-wrote the song with John Bettis, the reason for the song's late release in the U.S. was that he had misjudged the song's commercial appeal, but was proven wrong when the Carpenters' &quot;Top of the World&quot; became a hit in Japan in 1972 and Lynn Anderson's cover reached #2 on the U.S. country charts in 1973. The song went through a few minor revisions, including a slight remix, before it was finally released as a single in the U.S. The Carpenters' treatment of the much-covered Paul Williams/Roger Nichols composition &quot;I Won't Last a Day Without You&quot; also got a belated single release in 1974, and peaked at number eleven on the Hot 100.\nWith the exception of &quot;Bless the Beasts...&quot; which peaked at number 26 on the AC chart, all of the album's charted singles made either number one (&quot;Hurting Each Other&quot;, &quot;I Won't Last a Day Without You&quot;) or number two on the Adult Contemporary chart. The album and its singles were also successful internationally; &quot;Goodbye to Love&quot; and &quot;I Won't Last a Day...&quot; made the top ten on the UK Singles Chart as a double A-side, and &quot;Top of the World&quot; made the Oricon singles chart in Japan on three separate occasions (#21 in 1972, #52 in 1973, and #83 in 1996).\n\n1.\t&quot;A Song for You&quot;  \t\n2.\t&quot;Top of the World&quot;  \t\n3.\t&quot;Hurting Each Other&quot;  \t\n4.\t&quot;It's Going to Take Some Time&quot;\n5.\t&quot;Goodbye to Love&quot;\n6.\t&quot;Intermission&quot;\n7.\t&quot;Bless the Beasts and Children&quot; \n8.\t&quot;Flat Baroque&quot;\n9.\t&quot;Piano Picker&quot;\n10.\t&quot;I Won't Last a Day Without You&quot;\n11.\t&quot;Crystal Lullaby&quot;\n12.\t&quot;Road Ode&quot;\n13.\t&quot;A Song for You (Reprise)&quot;\n","torrent":{"xt":"urn:btih:473f49a7ae05c708ccc84c35f583e1907a2f0b07","amp;dn":"The+Carpenters+-+A+Song+for+You","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"473f49a7ae05c708ccc84c35f583e1907a2f0b07","infoHashBuffer":{"type":"Buffer","data":[71,63,73,167,174,5,199,8,204,200,76,53,245,131,225,144,122,47,11,7]},"announce":[],"urlList":[]}}