{"title":"Bryan Adams - Run To You","uid":4586829,"size":129851396,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:47a9f1650e80406a26b59ab825cb7709c2dfe69f&amp;dn=Bryan+Adams+-+Run+To+You&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":1,"time":1229658517,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Run to You&quot; is a rock song written by Bryan Adams and Jim Vallance for Adams fourth studio album Reckless (1984). It was the first single released from the album Reckless. It is arguably one of Adams' most recognizable and popular songs. The song topped the Billboard Mainstream Rock Tracks chart and peaked at number 6 on the Billboard Hot 100. The song has appeared on all of Adams' compilation albums. The single was certified Gold in Canada in 1985.\n\n&quot;Run to You&quot; was released in October 1984 and became one of the most successful songs from Reckless on the American rock charts and arguably one of Adams most recognizable and popular songs. &quot;Run to You&quot; was released worldwide on October 18, 1984. The song reached the top ten on the Mainstream Rock Tracks and was Adams first number one hit on the Mainstream Rock Tracks and number six on the Billboard Hot 100. &quot;Run to You&quot; reached the top twenty on the Canadian singles chart and remained in the top twenty for seven weeks. &quot;Run to You&quot; reached the highest Canadian chart positions Adams had attained at the time of release and became his second top twenty single in Canada. &quot;Run to You&quot; was released the following month in Ireland and peaked at number 8 and reached number eleven on the UK Singles Chart. It was his second single to chart in Europe.\n\nThe music video was shot in London, England and later Los Angeles. Directed by Steve Barron, it was nominated for the 1985 MTV Video Music Awards in five different categories: Best Direction, Best Special Effects, Best Art Direction, Best Editing and Best Cinematography. While the song didn't win any of the awards, it has received more MTV Video Music Award nominations than any other of Adams' songs.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:47a9f1650e80406a26b59ab825cb7709c2dfe69f","amp;dn":"Bryan+Adams+-+Run+To+You","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"47a9f1650e80406a26b59ab825cb7709c2dfe69f","infoHashBuffer":{"type":"Buffer","data":[71,169,241,101,14,128,64,106,38,181,154,184,37,203,119,9,194,223,230,159]},"announce":[],"urlList":[]}}