{"title":"The Worst Case Scenario Survival Handbook","uid":3950410,"size":1399784,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:48c6ce6bf48e26f289ba2a4bdc5c6bf023ffa16a&amp;dn=The+Worst+Case+Scenario+Survival+Handbook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"smartiepanties","files":2,"time":1198803161,"description":"     How to Wrestle Free from an Alligator: 4. If its jaws are closed on something you want to remove (for example, a limb), tap or punch it on the snout. \n\nThough it&amp;#039;s being marketed as a humorous title--after all, it&amp;#039;s unlikely you&amp;#039;ll be called upon to land a plane, jump from a motorcycle to a moving car, or win a swordfight--the information contained in The Worst-Case Scenario Survival Handbook is all quite sound. Authors Joshua Piven and David Borgenicht consulted numerous experts in their fields (they&amp;#039;re cited at the end of the book) to discover how to survive various and sundry awful events. Parachute doesn&amp;#039;t open? Your best bet for survival is to hook your arms through the straps of a fellow jumper&amp;#039;s chute--and even then you&amp;#039;re likely to dislocate both shoulders and break both legs. Car sinking in water? Open the window immediately to equalize pressure, then open the car door and swim to the surface. Buried in an avalanche? Spit on the snow--it will tell you which direction is really up. Then dig as fast as you can.\n\nEach survival skill is explained in simple steps with helpful illustrations. Most stress the need to be prepared--both mentally and physically. For example, to escape from quicksand, you will need to lay a pole on the surface of the quicksand, flop on your back atop the pole, and pull your legs out one by one. No pole? No luck. &quot;When walking in quicksand country, carry a stout pole--it will help you get out should you need to.&quot;\n\nHopefully you&amp;#039;ll never need to know how to build a fire without matches, perform a tracheotomy, or treat a bullet wound. But in the words of survival evasion resistance escape instructor &quot;Mountain&quot; Mel Deweese, &quot;You never know.&quot; --Sunny Delaney \n\n\n\nVERY GOOD READ!!!","torrent":{"xt":"urn:btih:48c6ce6bf48e26f289ba2a4bdc5c6bf023ffa16a","amp;dn":"The+Worst+Case+Scenario+Survival+Handbook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48c6ce6bf48e26f289ba2a4bdc5c6bf023ffa16a","infoHashBuffer":{"type":"Buffer","data":[72,198,206,107,244,142,38,242,137,186,42,75,220,92,107,240,35,255,161,106]},"announce":[],"urlList":[]}}