{"title":"221 Svenska sånger swedish songs","uid":14066757,"size":1932791412,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:48c6d4c12048184bd683bd59d3af3cbf347936e8&amp;dn=221+Svenska+s%26aring%3Bnger+swedish+songs&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Yggdrasut","files":221,"time":1459136856,"description":"En helt unik och mycket varierad samling visor och sånger, alltid sjungna på Svenska av kända artister från förr och nu. Kanske är detta den bästa samlingen som finns med Svensk musik, och den är alltså väl värd att bevaras till framtiden. Alla varianter finns med, kärlekvisor, vikingarock, körsång, svensktopp, trabadurer, svängig dansmusik, sjömansvisor, satir och humor, nutida, gammalt, ALLT.\r\n\r\nVissa artister har en egen samling: Bellman, Edvard Persson, Evert Taube,  Hootennany Singers, Jussi Björling, Magnus Uggla, Orphei drängar, Owe Thörqvist, Povel Ramel, Ulla Billquist och Ultima Thule har alla en egen avdelning.\r\n\r\nAndra ingår i mappen Svenska klassiker, t.ex. Harry Brandelius, Robert Broberg, Sigge Furst, Sven-Bertil Taube, Sven-Ingvars, Thorstein Bergman och Zarah Leander.\r\n\r\nTexterna är av bl.a. Bellman, Dan Andersson, Fröding, Nils Ferlin, Karlfelt, Povel Ramel, Magnus Uggla, Ulf Peder Olrog, Evert Taube och Esaias Tegner. Och många andra, både kända och numera okända.\r\n\r\nSpela upp med VLC och aktivera då gärna slumpfunktionen, som är den lilla rutan längst ner till höger. Då hittar du snart den text och melodi som du för stunden behöver. Här finner du tröst, och här kan du också flyga högt på sångens vingar. \r\nLyssna - dela - och NJUT av den Svenska musiken!","torrent":{"xt":"urn:btih:48c6d4c12048184bd683bd59d3af3cbf347936e8","amp;dn":"221+Svenska+s%26aring%3Bnger+swedish+songs","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48c6d4c12048184bd683bd59d3af3cbf347936e8","infoHashBuffer":{"type":"Buffer","data":[72,198,212,193,32,72,24,75,214,131,189,89,211,175,60,191,52,121,54,232]},"announce":[],"urlList":[]}}