{"title":"North Korea - The Struggle Against American Power (Malestrom)","uid":4864590,"size":1570718,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:49ff0d437e69333723cc7a01196e29392b361948&amp;dn=North+Korea+-+The+Struggle+Against+American+Power+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"malestrom_HH","files":1,"time":1240416001,"description":" &lt;a href=&quot;http://www.image-upload.net/images/arviti0dazdclvbmxar.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.image-upload.net/images/arviti0dazdclvbmxar.jpeg&lt;/a&gt;\n\nTim Beal, &quot;North Korea: The Struggle Against American Power&quot;\nPublisher: Pluto Press | 2005 | ISBN 0745320139 | PDF | 352 pages\n\n\nGeorge W. Bush's infamous remark about the 'Axis of Evil' brought North Korea dramatically back into the international spotlight. During the late 1990s relations between North Korea and the US and its allies were on the mend. However, the election of George W. Bush resulted in renewed crisis. The nuclear accord between the two countries was torn up, dashing North Korean hopes for establishing normal diplomatic and economic relations. Though malnutrition has eased and the economy is growing, the outlook is bleak. This book cuts through the propaganda to unearth the complex and contradictory realities of this much-demonised country and its geopolitical context. The North is not a 'workers' paradise' but, like Iraq, neither is it a threat to its neighbours and the region in the way usually portrayed. Tim Beal reveals a country overburdened by military spending that sees itself under constant threat. However, he also shows that North Korea is pragmatic about negotiating with the United States. Attempts at economic reform and export expansion are shackled by US and Japanese hostility. Exploring a broad range of subjects including the historical and political framework of North Korea, the development of the nuclear crisis, human rights issues, drug trading, as well as its shifting relationship with South Korea, this is an ideal book for anyone who wants a thorough introduction to the daunting challenges faced by this country. ","torrent":{"xt":"urn:btih:49ff0d437e69333723cc7a01196e29392b361948","amp;dn":"North+Korea+-+The+Struggle+Against+American+Power+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"49ff0d437e69333723cc7a01196e29392b361948","infoHashBuffer":{"type":"Buffer","data":[73,255,13,67,126,105,51,55,35,204,122,1,25,110,41,57,43,54,25,72]},"announce":[],"urlList":[]}}