{"title":"Dave Brubeck - 1955 - Jazz Red Hot &amp; Cool (2001) FLAC","uid":9565261,"size":269594466,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4a8f1cc764af9c50b3a96ffa9ecdeab096af02bf&amp;dn=Dave+Brubeck+-+1955+-+Jazz+Red+Hot+%26amp%3B+Cool+%282001%29+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"eika256","files":-1,"time":1391499621,"description":"Dave Brubeck - 1955 - Jazz: Red Hot &amp; Cool (2001)\n\nRecorded during three different stays at New York's Basin Street, Jazz: Red, Hot and Cool is making its first appearance in the U.S. on CD. It documents -- with the addition of two additional performances that were previously unissued -- the original Brubeck quartet in its final years. In 1956 Joe Morello would replace Joe Dodge, and in 1958 Eugene Wright would take over the bass chair from Bob Bates. What strikes the listener about this band, is a having been seasoned for five years when the first of these performances were recorded, the Brubeck quartet was far more immersed in the blues than anyone -- at least the critics of the time -- had given them credit for. Paul Desmond's alto tone had yet to take on the dry martini velvety texture that became his trademark, and Brubeck was not yet inserting the totality of his classical ideas about the extrapolation of dissonance from consonance and its resulting harmonic theory that was built on an elaborate contrapuntal system. These ideas, that were introduced to him by the French composer and instructor Darius Milhaud and the music of Shostakovich and Stravinsky would later result in the wildly inventive tonal identity expressed in his compositions on Jazz Impressions of Eurasia, Jazz Impressions of New York, and even Time Out. On this set, while Brubeck is playing with large augmented chords and without the use of arpeggios, his strident melodic sense keeps him rooted in the American vernacular musically. There is the gorgeous, post-bop blues in &quot;Lover,&quot; and the Gershwin-esque balladic structure employed in &quot;Little Girl Blue.&quot; Desmond, for his part was a constant, the most rock steady part of the band. His solos were the epitome of melodic improvisation even then. His break on &quot;Fare the Well, Annabelle,&quot; carries the melody and harmony in its venturing. Brubeck, never content to just comp, offers Desmond a few additions on the diminished seventh and he goes for them stitching his counterpoint through them, taking the tune's body into an entirely new intervallic mode. Brubeck's solo quotes Mozart's &quot;Eine Kleine Nacht Musik,&quot; Pachelbel's &quot;Canon,&quot; and variations on a classical theme from the Orient -- Korea, in fact, which was provocative, given the time. The beautiful reading given here of &quot;Love Walked In&quot; is worthy of note because it features the band at its most intimate, hunkered down inside the tune's melody, reworking it to close it off even more from undue influence while re-creating its harmonic architecture. And then there's &quot;The Duke,&quot; offered to Gil Evans, a simple stroll through the blues with a nod to both Gershwin and Rogers &amp; Hart. As the band launches into &quot;Indiana&quot; the classic quartet flourish becomes evident; the rhythm section keeps it all steady no matter what happens, and, in Desmond's solo, crossing rhythmic patterns, full time signatures, and meter at lightning speed, this was no mean feat. The two added performances &quot;Taking a Chance on Love&quot; and &quot;Closing Time Blues&quot; were recorded a month after the previous four in August of 1955. Both of them display Brubeck's now trademark two-part counterpoint and Desmond's &quot;in flight&quot; manner of response. They are worthy additions to a record that was already wonderful for its inspiration and the way in which it displayed the band's innovative energy that was unique to live situations. (AllMusic)\n\nTrack list:\n01 - Lover\n02 - Little Girl Blue\n03 - Fare Thee Well, Annabelle\n04 - Somteimes I'm Happy\n05 - The Duke\n06 - Indiana\n07 - Love Walked in\n08 - Taking a Chance on Love\n09 - Closing Time Blues\n\nPersonnel:\nDave Brubeck piano; \nPaul Desmond alto saxophone; \nBob Bates bass; \nJoe Dodge drums\n\nEnjoy and share!","torrent":{"xt":"urn:btih:4a8f1cc764af9c50b3a96ffa9ecdeab096af02bf","amp;dn":"Dave+Brubeck+-+1955+-+Jazz+Red+Hot+%26amp%3B+Cool+%282001%29+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a8f1cc764af9c50b3a96ffa9ecdeab096af02bf","infoHashBuffer":{"type":"Buffer","data":[74,143,28,199,100,175,156,80,179,169,111,250,158,205,234,176,150,175,2,191]},"announce":[],"urlList":[]}}