{"title":"Dungeon Corp----DC - Apr 26, 2014 - Holly Wellin","uid":10091335,"size":222580351,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:4ab7a2eb63e0e20d6f9959215fbe158b52a611a8&amp;dn=Dungeon+Corp%5C----DC+-+Apr+26%2C+2014+-+Holly+Wellin&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"merzedes","files":-1,"time":1399201898,"description":"Dungeon Corp  DC - Apr 26, 2014 - Holly Wellin\n\n\nPreview for &quot;Using Holly&quot; \nDOC Redux\n Holly Wellin\n\n\nOnly Mp4 480p\n\nA new client, John West, makes a request for the british hottie, Holly Wellin. I'm sure we can understand why he would want to have her all to himself to be tied and fucked, but the hard part is understanding why he is late to do so. So we get Holly all dressed up in Latex for him and we tie her standing. And we wait. But it seems that John isn't going to show, so Ogre decides not to waste the occasion. He begins spanking and whipping Holly. He undresses her and uses a vibrator to make her scream and cum. Then she screams and cums some more with thick drool flowing out from her ball-gagged mouth. Then he strips Holly and hangs her upside down by her ankles. Her body is strapped up tight and Ogre gets ready to have his cock sucked by the helpless slave. But Mr. West finally arrives. It seems LA traffic got the best of him. He sees that Holly is ready to go so he jumps right in. He swings Holly around as he removes his clothes and he shoves his cock right into her mouth. Holly sucks like a champ as John eats her pussy. He pushes her across the room and as she swings back, she catches his cock in her mouth. Back and forth then back and forth and Holly never misses. As a reward, John grabs her by the back of the head and forcefully fucks her face. Holly's eyes go wide as she tries not to gag and then she begs to be fucked. We bend her over in stocks with her legs spread off the ground. John sinks right in from behind and pounds her fragile body. He moves around front for some head and goes right back to fucking her. Holly screams as he rams her pussy over and over. Then John pulls out and drops a load on her back. Then he leaves her there, no doubt late for his next appointment...\n\n\nScreens \n &lt;a href=&quot;\nhttp://www.dungeoncorp.com/updates14/DRE/HOL_0107/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.dungeoncorp.com/updates14/DRE/HOL_0107/index.html&lt;/a&gt;\n\n\n\n14 000 down, but how much more to come ?? You decide ;) \n\nThe more you appreciate it, the more we want to do it. Can we get to 15k ??? \n\nWell, if you still like what Shallow2 and I upload, how about leaving us a nice \n\ncomment below ? :)\n\n\nAny Questions ?? Read our FAQ!!\n                &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-) \t","torrent":{"xt":"urn:btih:4ab7a2eb63e0e20d6f9959215fbe158b52a611a8","amp;dn":"Dungeon+Corp%5C----DC+-+Apr+26%2C+2014+-+Holly+Wellin","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ab7a2eb63e0e20d6f9959215fbe158b52a611a8","infoHashBuffer":{"type":"Buffer","data":[74,183,162,235,99,224,226,13,111,153,89,33,95,190,21,139,82,166,17,168]},"announce":[],"urlList":[]}}