{"title":"Pa Chin - Family (pdf)","uid":10168392,"size":6049473,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4b6fb4874466729ef8c15184a02d63c832d74f3b&amp;dn=Pa+Chin+-+Family+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pharmakate","files":-1,"time":1400375518,"description":"Pa Chin - Family (Anchor, 1972). 329 pp.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\n\nClassic Chinese novel by the anarchist Pa Chin (also spelled Ba Chin). First published in 1931.\n\n\ndescription:\n\nAn essential work for anyone interested in the society and history of modern China. The first half of the twentieth century was a period of great turmoil in China. Family, one of the most popular Chinese novels of that time, vividly reflects that turmoil and serves as a basis for understanding what followed. Written in 1931, Family has been compared to Dream of the Red Chamber for its superb portrayal of the family life and society of its time. Drawn largely from Pa Chin's own experience, Family is the story of the Kao family compound, consisting of four generations plus servants. It is essentially a picture of the conflict between old China and the new tide rising to destroy it, as manifested in the daily lives of the Kao family, and particularly the three young Kao brothers. Here we see situations that, unique as they are to the time and place of this novel, recall many circumstances of today's world: the conflict between generations and classes, ill-fated love affairs, students' political activities, and the struggle for the liberation of women. The complex passions aroused in Family and in the reader are an indication of the universality of human experience. This novel illustrates the effectiveness of fiction as a vehicle for translating the experience of one culture to another very different one.\n\nReview\n\nPa Chin's Family--one of the most celebrated novels of the May 4th Movement--continues to be indispensable reading. Its clash of the traditional and the modern, of age and youth, of Confucianism and individualism remains relevant to any understanding of how China struggled, and continues to struggle, to escape the constraints of stifling orthodoxy. --William N. Rogers II, Center for Asian Studies\n\nFamily excellently captures the crossroads faced by China in the early twentieth century. Every culture experiences generational conflict, but Pa Chin demonstrates the complexity of this conflict in a compelling and highly readable manner. Highly recommended. --Elizabeth Propes, Tennessee Technological University\n","torrent":{"xt":"urn:btih:4b6fb4874466729ef8c15184a02d63c832d74f3b","amp;dn":"Pa+Chin+-+Family+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b6fb4874466729ef8c15184a02d63c832d74f3b","infoHashBuffer":{"type":"Buffer","data":[75,111,180,135,68,102,114,158,248,193,81,132,160,45,99,200,50,215,79,59]},"announce":[],"urlList":[]}}