{"title":"Batman 478-490 (1992-05) (digital) (OkC.O.M.P.U.T.O.-Novus-HD) [","uid":10327621,"size":411216853,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:4c13163b79efe452ff065f9cc114c8656bf3875e&amp;dn=Batman+478-490+%281992-05%29+%28digital%29+%28OkC.O.M.P.U.T.O.-Novus-HD%29+%5B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dadrkhomr","files":-1,"time":1402374464,"description":"A Novus Release\n\n\n\n\nThis torrent includes the HD version.  \n\n\n*Note: You can download all or only choose which version you'd prefer by deselecting the one you don't want when you add the torrent to your client software. If you're adding the torrent via magnet link, you can deselect any undesired file in the list of files once the torrent has begun downloading.\n========================================================\n\n\n \n\n\n\n#478  One of the people trapped in the vault with Batman reveals the truth about the blood-sucking nightmare known as the Gargoyle. &quot;A Gotham Tale&quot; part 2. \n#479  A new vigilante appears in Gotham City, one looking to exact justice against those who have committed crimes specifically against women. \n#480  Tim Drake prepares for his father's release from the hospital, but with his dad in need of near constant assistance, it just might mean that Batman and Robin might be on their last adventure together. \n#481  Maxie Zeus is still running things from inside Arkham Asylum, and his mad assistant is up to something, leaving the Dark Knight to stop her. \n#482  Maxie Zeus' assistant becomes the villainous Harpy and wreaks havoc on the recalcitrant members of Maxie's gang. \n#483  Sparks fly when this irresistible force meets the immovable object that is Batman, who is determined to prevent their apocalyptic demise from injuring innocents. \n#484  The Black Mask returns, seeking to reclaim his old position as Gotham's mob boss, but the mobsters that took over while was in Arkham may have other ideas. \n#485  While trying to save Lucius Fox, Batman is caught in the lair of the Black Mask.\n#486  Obsessed with finding Black Mask, and unaware that he's losing control, Batman tears through Gotham until he meets a brutal killer also pursuing the Black Mask. \n#487  There's a contract out on the toughest man in Gotham City: Commissioner James Gordon. Batman must find Gordon before the Headhunter does! \n#488  Azrael joins Robin as the Boy Wonder shows him the ropes, and together they attempt to thwart industrial espionage at Wayne Tech. \n#489  Featuring the first appearance of Azrael as Batman! Bane steps in when Killer Croc becomes too much for Robin and the new Batman Jean-Paul Valley to handle, while Bruce Wayne tries to get some much-needed rest.\n#490  The Riddler is on the loose, but this time it's more than just a match-up of minds for the Dark Knight. Bane has pumped the villain full of venom and now it's a battle of brain AND brawn!\n\n\n\nThanks goes to OkC.O.M.P.U.T.O for this release.\n\n\n\n\n","torrent":{"xt":"urn:btih:4c13163b79efe452ff065f9cc114c8656bf3875e","amp;dn":"Batman+478-490+%281992-05%29+%28digital%29+%28OkC.O.M.P.U.T.O.-Novus-HD%29+%5B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c13163b79efe452ff065f9cc114c8656bf3875e","infoHashBuffer":{"type":"Buffer","data":[76,19,22,59,121,239,228,82,255,6,95,156,193,20,200,101,107,243,135,94]},"announce":[],"urlList":[]}}