{"title":"Materials for the Hydrogen Economy","uid":12128589,"size":9820216,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4cb6a59fa177a1a4925fa0b6377d2e92df4d5189&amp;dn=Materials+for+the+Hydrogen+Economy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1436983844,"description":"Materials for the Hydrogen Economy - Russell H. Jones, George J. Thomas (CRC, 2008).pdf\n\nISBN 9780849350245\n\nHydrogen offers a promising alternative for supplying clean and sustainable energy to meet increasing demands worldwide. However, materials are key to transforming the technology into a viable industry. Materials for the Hydrogen Economy describes the technical challenges and the current efforts in developing materials possessing the properties required for handling each stage of the hydrogen fuel chain. Thorough coverage offers newcomers as well as experienced engineers and researchers a reliable and fully scalable foundation in this field.\n\nThis book covers all seven of the current hydrogen production methods, as well as distribution, storage, and utilization technologies, particularly fuel cells. It details the chemical reactions, processes, types of feedstock, and commercial equipment involved in hydrogen production. It also covers methods, membranes, liners, and sensors used for separating, sealing, and purifying hydrogen. Several chapters examine corrosion effects in pipeline steels and other storage and transportation vessels, leading to discussions of hydrogen permeation barriers, barrier coatings, and hydrides for on-board hydrogen storage. The final chapters focus on electrolytes and component materials for solid-oxide fuel cells (SOFCs) and H2/O2 PEM fuel cells.\n\nMaterials for the Hydrogen Economy provides a broad review of material requirements for handling hydrogen from production to market. It explores the development of these materials alongside essential considerations and issues associated with their deployment","torrent":{"xt":"urn:btih:4cb6a59fa177a1a4925fa0b6377d2e92df4d5189","amp;dn":"Materials+for+the+Hydrogen+Economy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4cb6a59fa177a1a4925fa0b6377d2e92df4d5189","infoHashBuffer":{"type":"Buffer","data":[76,182,165,159,161,119,161,164,146,95,160,182,55,125,46,146,223,77,81,137]},"announce":[],"urlList":[]}}