{"title":"Literature to Go - Michael Meyer","uid":9247561,"size":6896903,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4cc424535bc2701508262ab6513e5bbe3f413ab5&amp;dn=Literature+to+Go+-+Michael+Meyer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1385401027,"description":"Drawn from our best-selling anthology, The Bedford Introduction to Literature, Literature to Go is a new brief and inexpensive collection of stories, poems, and plays supported by Michael Meyer's incomparable, class-tested instruction. With literature from many periods, cultures, and diverse voices, including today's funniest writers, the book is also a complete guide to close reading, critical thinking, and thoughtful writing about literature. Students discover literature as a diverse, lively, and often humorous reflection of their own lives.\n\nMICHAEL MEYER (Ph.D., University of Connecticut) has taught writing and literature courses for more than 30 years -- since 1981 at the University of Connecticut and before that at the University of North Carolina at Charlotte and the College of William and Mary. His scholarly articles have appeared in distinguished journals such as American Literature, Studies in the American Renaissance, and Virginia Quarterly Review. An internationally recognized authority on Henry David Thoreau, Meyer is a former president of the Thoreau Society and coauthor (with Walter Harding) of The New Thoreau Handbook, a standard reference source. His other books for Bedford/St. Martin's include The Bedford Introduction to Literature (2011); Poetry: An Introduction (2010), The Compact Bedford Introduction to Literature (2009); and Thinking and Writing about Literature (2001).","torrent":{"xt":"urn:btih:4cc424535bc2701508262ab6513e5bbe3f413ab5","amp;dn":"Literature+to+Go+-+Michael+Meyer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4cc424535bc2701508262ab6513e5bbe3f413ab5","infoHashBuffer":{"type":"Buffer","data":[76,196,36,83,91,194,112,21,8,38,42,182,81,62,91,190,63,65,58,181]},"announce":[],"urlList":[]}}