{"title":"Cheikh Lo - Ne La Thiass [FLAC] TQMP","uid":5781575,"size":317145240,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4d1c4a1a24c06eee70ba4a1ef5994f5f7d4230b8&amp;dn=Cheikh+Lo+-+Ne+La+Thiass+%5BFLAC%5D+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pastafari","files":-1,"time":1282431036,"description":"Cheikh Lo - Ne La Thiass\n1996\n\nKudos to 1stringman for this one. Enjoy!\n\nBrought to you by TQMP\nThe Quality Music Project\n\nThis strong debut from Senegalese singer Cheikh Lo is a healthy hybrid of African and Cuban rhythms. Lo's high, reedy vocals are immediately evocative of countryman Youssou N'Dour -- no surprise since N'Dour helms as producer. But the acoustic aesthetic here is warmer than N'Dour's usual high-gloss pop. If you're looking for an album to turn winter to spring, darkness to light, this disc is a safe bet.\n-- Allmusic.com\n\n\nCheikh Lo's debut international release Ne La Thiass does the new softer, more acoustic genre of Afropop proud. A true original, Lo grew up in Burkina Faso, far from the music industry bustle of Dakar, where he lives now. By the time Lo moved beyond his career as a freelance drummer, percussionist and singer, and broke out as a singing star in 1990, he was determined to advance the musical aesthetics of Senegalese pop. Mbalax, a dense weave of keyboard chirp-and-moan, lightly strumming guitar rhythms, and pummeling Sabar percussion, rules the airwaves in Dakar. When Lo went into the studio in 1995 to record Ne La Thiass, he axed the keyboards, toned down the percussion, substituted acoustic for electric guitars and brought in a flute and a small horn section. His producer, none other than Senegal's biggest star Youssou N'Dour, helped him get an exquisitely well-realized sound, but the genius here is all Lo's, and it goes well beyond these changes in the lineup. \n\nLo spent years playing what the Africans call variete, an international mix that has changed with the times--jazz and Afro-Cuban salsa in the '60s, Congolese rumba and more salsa in the '70s, reggae and more salsa in the '80s. Lo internalized all of this, and when he invests his arrangements with these influences, he does it so subtly that you can't quite pin them down. The music really moves. It proves that good arranging rather than force or bluster is what makes a groove deep. On the flamenco flavored title track, Lo's clear, slightly rough-edged voice rises from speech into song, and the music rises with it, cooling off periodically with each repeat of the song's delightful, descending refrain. \n\nWest Africa has produced the continent's most powerful singers, and Lo easily earns a high position in the pantheon. If his keening vocal in songs like &quot;Dokandeme&quot; or &quot;Cheikh Ibra Fall&quot; suggests a spiritual bent, that's because Lo is a Baye Fall, a member of an Islamic mystical brotherhood that champions hard work and simple living. Most of Lo's themes here stem from his faith, and that sense of visionary certainty fuels the music the way Rastafarianism fuels the best of reggae. Track after track, the music's brisk levity and Lo's sensationally committed vocals make for pop that soars, transcending all confinements of genre.\n-- Afropop.org\n\n\nTrack List\n01- Boul Di Tagale\n02- Ne La Thiass\n03- Ndogal\n04- Doxandeme\n05- Sant Maam\n06- Set\n07- Cheikh Ibra Fall\n08- Bamba Sunu Goorgui\n09- Guiss Guiss\n\nArtwork, EAC log and CUE sheet included.\n\nAudio format: FLAC (Free Lossless Audio Codec) &lt;a href=&quot;\nhttp://flac.sourceforge.net/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://flac.sourceforge.net/index.html&lt;/a&gt; \n\nEnjoy, seed and inhale!\n\nLegalise it!\nPastafariCubensis &lt;a href=&quot;\nhttp://thepiratebay.se/user/pastafari/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/pastafari/&lt;/a&gt;\n","torrent":{"xt":"urn:btih:4d1c4a1a24c06eee70ba4a1ef5994f5f7d4230b8","amp;dn":"Cheikh+Lo+-+Ne+La+Thiass+%5BFLAC%5D+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d1c4a1a24c06eee70ba4a1ef5994f5f7d4230b8","infoHashBuffer":{"type":"Buffer","data":[77,28,74,26,36,192,110,238,112,186,74,30,245,153,79,95,125,66,48,184]},"announce":[],"urlList":[]}}