{"title":"Non-Newtonian Flow and Applied Rheology 2nd ed","uid":12014921,"size":9060879,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4d7f821d0c004fb4fc109033ca599e52d2e17083&amp;dn=Non-Newtonian+Flow+and+Applied+Rheology+2nd+ed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1434292537,"description":"ISBN 0750685328\n\nThis book bridges the gap between the theoretical work of the rheologist, and the practical needs of those who have to design and operate the systems in which these materials are handled or processed. It is an established and important reference for senior level mechanical engineers, chemical and process engineers, as well as any engineer or scientist who needs to study or work with these fluids, including pharmaceutical engineers, mineral processing engineers, medical researchers, water and civil engineers. This new edition covers a considerably broader range of topics than its predecessor, including computational fluid dynamics modelling techniques, liquid/solid flows and applications to areas such as food processing, among others.\n\n* Written by two of the world's leading experts, this is the only dedicated non-Newtonian flow reference in print.\n* Since first publication significant advances have been made in almost all areas covered in this book, which are incorporated in the new edition, including developments in CFD and computational techniques, velocity profiles in pipes, liquid/solid flows and applications to food processing, and new heat/mass transfer methods and models.\n* Covers both basic rheology and the fluid mechanics of NN fluids ? a truly self-contained reference for anyone studying or working with the processing and handling of fluids","torrent":{"xt":"urn:btih:4d7f821d0c004fb4fc109033ca599e52d2e17083","amp;dn":"Non-Newtonian+Flow+and+Applied+Rheology+2nd+ed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d7f821d0c004fb4fc109033ca599e52d2e17083","infoHashBuffer":{"type":"Buffer","data":[77,127,130,29,12,0,79,180,252,16,144,51,202,89,158,82,210,225,112,131]},"announce":[],"urlList":[]}}