{"title":"Learning Three.js - The JavaScript 3D Library for WebGL - 2nd Ed","uid":12546891,"size":95514264,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4e04efd0dbf1b75b8c8a8a77587d07f8aa88522b&amp;dn=Learning+Three.js+-+The+JavaScript+3D+Library+for+WebGL+-+2nd+Ed&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":3,"time":1444485520,"description":"Publisher: Packt Publishing - ebooks Account; 2 edition (March 31, 2015)\r\nLanguage: English\r\nISBN-10: 1784392219\r\nISBN-13: 978-1784392215\r\n\r\nCreate stunning 3D graphics in your browser using the Three.js JavaScript library\r\n\r\nAbout This Book\r\n\r\nEnhance your 3D graphics with light sources, shadows, advanced materials, and textures\r\nLoad models from external sources, and visualize and animate them directly from JavaScript\r\nEach subject is explained using extensive examples that you can use directly and adapt for your own purposes\r\nWho This Book Is For\r\nIf you know JavaScript and want to start creating 3D graphics that run in any browser, this book is a great choice for you. You don't need to know anything about math or WebGL; all that you need is general knowledge of JavaScript and HTML.\r\n\r\nWhat You Will Learn\r\n\r\nUse the different geometries that are provided by Three.js\r\nApply realistic lighting and shadows to the 3D objects you have created\r\nUse the different camera controls provided by Three.js to effortlessly navigate around your 3D scene\r\nMake use of advanced textures on materials to create realistic-looking 3D objects by using bump maps, normal maps, specular maps, and light maps\r\nImport and animate models from external formats, such as OBJ, STL, Collada, and many more\r\nCreate and run animations using morph targets and bone animations\r\nExplore the Physijs JavaScript library to apply physics to your 3D objects\r\nInteract directly with WebGL by creating custom vertex and fragment shaders\r\n\r\nIn Detail\r\n\r\nModern browsers support WebGL, which makes it possible to create 3D graphics in a browser without having to use plugins such as Flash and Java. Programming WebGL, however, is difficult, complex, and very difficult to debug. With Three.js, it is possible to create stunning 3D graphics in an intuitive manner using JavaScript, without the need to know the details of WebGL.\r\n\r\nLearning Three.js – the JavaScript 3D Library for WebGL, Second Edition, is a practical, example-rich book that will help you learn about all the features of Three.js. This book will show you how to create or load models from externally created models and realistic-looking 3D objects using materials and textures. You'll also learn how to use the HTML5 video and canvas elements as a material for your 3D objects, different ways of animating your models, skeleton-based animation, and how to add physics such as gravity and collision detection to your scene. By the end of the book, you'll know everything that is required to create 3D animated graphics that run in any browser using Three.js","torrent":{"xt":"urn:btih:4e04efd0dbf1b75b8c8a8a77587d07f8aa88522b","amp;dn":"Learning+Three.js+-+The+JavaScript+3D+Library+for+WebGL+-+2nd+Ed","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e04efd0dbf1b75b8c8a8a77587d07f8aa88522b","infoHashBuffer":{"type":"Buffer","data":[78,4,239,208,219,241,183,91,140,138,138,119,88,125,7,248,170,136,82,43]},"announce":[],"urlList":[]}}