{"title":"FALLOUT 3 (PAL, PS3, English) SillyRabbitTrixAreForKids","uid":6653517,"size":7846261636,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:4ed6cb6663a74d587dcba9b1a3f9f5c307749491&amp;dn=FALLOUT+3+%28PAL%2C+PS3%2C+English%29+SillyRabbitTrixAreForKids&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SillyRabbitTrixAreForKids","files":-1,"time":1315244090,"description":"Bought to you by Silly Rabbit,\n\nFALLOUT 3 for PlayStation 3 PAL\n\nFallout 3 is an action role-playing game released by Bethesda Game Studios, and the third major installment in the Fallout series. The game was released in North America on October 28, 2008, in Europe and Australia on October 30, 2008, in the United Kingdom and Ireland on October 31, 2008, and in Japan on December 4, 2008 for Microsoft Windows, PlayStation 3, and Xbox 360.\n\nFallout 3 takes place in the year 2277, 36 years after the setting of Fallout 2 and 200 years after the nuclear apocalypse that devastated the game's world in a future where international conflicts culminated in a Sino-American war in the second half of the 21st century. The player character is an inhabitant of Vault 101, a survival shelter designed to protect up to 1000 humans from the nuclear fallout. When the player character's father disappears under mysterious circumstances, the player is forced to escape from the Vault and journey into the ruins of Washington D.C. to track him down. Along the way the player is assisted by a number of human survivors and must battle a myriad of enemies that inhabit the area now known as the &quot;Capital Wasteland&quot;. The game has an attribute and combat system typical of an action strategy game but also incorporates elements of survival horror games.\n\nFollowing its release, Fallout 3 received positive reviews from critics and a number of Game of the Year awards, praising in particular the game's open-ended gameplay and flexible character-leveling system. The NPD Group estimated that Fallout 3 sold over 610,000 units during its initial month of release in October 2008, performing better than Bethesda Softworks' previous game, The Elder Scrolls IV: Oblivion, which sold nearly 500,000 units in its first month. The game has also received post-launch support with Bethesda releasing five downloadable add-ons.\n\nThe game received controversy upon release, including the use of morphine in the game for Australia, religious and cultural sentiments in India, and sensitivity in Japan due to a mission involving an atomic detonation.","torrent":{"xt":"urn:btih:4ed6cb6663a74d587dcba9b1a3f9f5c307749491","amp;dn":"FALLOUT+3+%28PAL%2C+PS3%2C+English%29+SillyRabbitTrixAreForKids","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ed6cb6663a74d587dcba9b1a3f9f5c307749491","infoHashBuffer":{"type":"Buffer","data":[78,214,203,102,99,167,77,88,125,203,169,177,163,249,245,195,7,116,148,145]},"announce":[],"urlList":[]}}