{"title":"The Welding Of Aluminium And Its Alloys{BBS}","uid":6671174,"size":3487985,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:51b883d7c83e7c65936d641781fee3020132a104&amp;dn=The+Welding+Of+Aluminium+And+Its+Alloys%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1315876837,"description":"The Welding of Aluminium and its Alloys provides a basic understanding of the metallurgic principles underpinning how alloys achieve their strength and how welding can effect their properties. A practical guide for the shop-floor engineer, the book covers weldability of aluminium alloys, process description, advantages, limitations, proposed weld parameters, health and safety issues, preparation for welding, quality assurance and quality control issues, and problem solving.\n\nThe book covers parent metal storage and preparation prior to welding, describes the more frequently encountered processes, and presents recommendations on welding parameters that may be used as a starting point for the development of a viable welding procedure. Providing hints and tips that help you avoid some of the pitfalls of welding these sometimes problematic materials, the book's content is both descriptive and qualitative. The Welding of Aluminium and its Alloys is a concise and effective reference for engineers who may have little prior understanding of metallurgy and only a brief acquaintance with the welding processes involved.\nFrom the Publisher\nIntroduction to the welding of aluminium - Introduction - Characteristics of aluminium - Product forms - Welding: a few definitions\n\nWelding metallurgy - Introduction - Strengthening mechanisms - Structure of metals - Aluminium weldability problems - Oxide film removal during welding - Hot cracking - Strength loss during welding\n\nMaterial standards, designations and alloys - Designation criteria - Alloying elements - CEN designation system - Specific alloy metallurgy - Filler metal selection\n\nPreparation for welding - Introduction - Storage and handling - Plasma-arc cutting - Laser beam cutting - Water jet cutting - Mechanical cutting - Cleaning and degreasing\n\nWelding design - Introduction - Access for welding - Welding Speed - Welding position - Edge preparation and joint design - Distortion - Rectification of distortion - Fatigue strength of welded joints\n\nTIG Welding - Introduction - Process principles - Mechanised/automatic welding - TIG spot and plug welding\n\nMIG Welding - Introduction - Process principles - Welding consumables - Welding procedures and techniques - Mechanised and robotic welding - Mechanised electro-gas welding - MIG spot welding\n\nOther welding processes - Introduction - Plasma-arc welding - Laser welding - Electron beam welding - Friction welding\n\nResistance welding processes - Introduction - Power sources - Surface condition and preparation - Spot welding - Seam welding - Flash butt welding\n\nWelding procedure and welder approval - Introduction - Welding procedures - Welder approval\n\nWeld defects and quality control - Introduction - Defects in arc welding - Non-destructive testing methods\n\nAppendices - A, British and ISO standards related to welding and aluminium - B, Physical, mechanical and chemical properties at 20 degrees - C, Principal alloy designations: cast products - D, Alloy designations: wrought products --This text refers to an alternate Hardcover edition.\nSee all Editorial Reviews\nProduct Details\n\n    * Hardcover: 236 pages\n    * Publisher: CRC Press; 1 edition (October 16, 2002)\n    * Language: English\n    * ISBN-10: 0849315514\n    * ISBN-13: 978-0849315510","torrent":{"xt":"urn:btih:51b883d7c83e7c65936d641781fee3020132a104","amp;dn":"The+Welding+Of+Aluminium+And+Its+Alloys%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"51b883d7c83e7c65936d641781fee3020132a104","infoHashBuffer":{"type":"Buffer","data":[81,184,131,215,200,62,124,101,147,109,100,23,129,254,227,2,1,50,161,4]},"announce":[],"urlList":[]}}