{"title":"TMS - Behold the Mighty Dinosaur","uid":6590796,"size":120901149,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:53e5a11e1d3f2aa974956c455432918f923aba46&amp;dn=TMS+-+Behold+the+Mighty+Dinosaur&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"programa","files":15,"time":1312816631,"description":"TMS - Behold the Mighty Dinosaur\nBy John Kricher\n\nFormat: MP3\nBitrate: 32 Kbps\n\n\t\t\t\t\nDinosaurs-the word means &quot;fearfully great reptile&quot;-have been a source of fascination ever since their discovery in England early in the nineteenth century. Aside from birds, all dinosaurs have been extinct for 65 million years, yet, before then, they dominated Earth's terrestrial habitats for about 160 million years, far longer than primates, or humans, have been around.\n\nDinosaurs present the ultimate puzzle in forensic science, but we have learned a great deal about them, especially in the last fifty years. Our view of dinosaurs has changed radically, and the evolution and biology of dinosaurs has become a popular topic in college curriculums. This series will explain how this changing view of dinosaurs developed, the evolutionary and ecological relationships among dinosaurs, what it might have been like to be present in the Mesozoic Era during the time of the dinosaurs, and the question of what ultimately brought about the total extinction of all of the non-bird dinosaurs and the end of the Cretaceous Period. Although extinct, dinosaurs have never been more a focus of science than they are today.\n\nJohn Kricher is a professor of biology at Wheaton College in Norton, Massachusetts. His books include Galapagos: A Natural History, A Neotropical Companion, three ecology field guides (Eastern Forests; Rocky Mountain and Southwestern Forests; and California and Pacific Northwest Forests), and First Guide to Dinosaurs. John is a fellow in the American Ornithologists Union and past-president of both the Association of Field Ornithologists and Wilson Ornithological Society. His interest in dinosaurs has taken him to virtually all of the major museum collections and he has ''hunted dinosaurs'' in Connecticut, Colorado, Utah, Wyoming, Montana, and along the Red Deer River in Alberta. He teaches about dinosaurs in his classes and he has amassed a large private collection of dinosaur models. He resides with his wife Martha Vaughan on Cape Cod. \n\n14 Lectures\n35 minutes/lecture\n\n1   What Is (or Was) a Dinosaur?\n2   Digging Up Dinos\n3   Dinosaurs Discovered\n4   The Bone Wars\n5   The Museum That Dinosaurs Built\n6   Dinosaurs Enter Pop Culture\n7   Dinosaur Origins\n8   In the Days of Dinosaurs\n9   Dinosaur Diversity\n10  Dinosaurs Become Dynamic\n11  Dinosaurs Become Airborne\n12  Dinosaurs as Living Animals\n13  T. REX Deconstructed and Reconstructed\n14  The Cretaceous Extinction Event","torrent":{"xt":"urn:btih:53e5a11e1d3f2aa974956c455432918f923aba46","amp;dn":"TMS+-+Behold+the+Mighty+Dinosaur","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53e5a11e1d3f2aa974956c455432918f923aba46","infoHashBuffer":{"type":"Buffer","data":[83,229,161,30,29,63,42,169,116,149,108,69,84,50,145,143,146,58,186,70]},"announce":[],"urlList":[]}}