{"title":"[ITA] CORSO MULTIMEDIALE PHOTOSHOP CS - TPB","uid":4580936,"size":3859283968,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:54fcf5e166a67b613962efaf450b0ac41afa8842&amp;dn=%5BITA%5D+CORSO+MULTIMEDIALE+PHOTOSHOP+CS+-+TPB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"golet","files":1,"time":1229426535,"description":"Descrizione\n\nPhotoshop ÃƒÂ¨ il software &quot;principe&quot; di casa Adobe: milioni di persone lo utilizzano ogni giorno grazie alla sua versatilitÃƒÂ  che gli permette di rientrare nei piÃƒÂ¹ svariati flussi di lavoro, dal web, alla grafica, al fotoritocco, al video.\n\nSe volete impadronirvi di tutte le tecniche e le funzioni di questo imprescindibile applicativo, ecco che Teacher-in-a-Box mette a vostra disposizione l'ampia preparazione di ben cinque Adobe Certified Experts: Elda Longo, Laura Brenna, Matteo Oriani, Ivan Fava e Ana Paula Tamburini.\n\nIl corso ÃƒÂ¨ dedicato alla versione di Photoshop denominata CS e in ben 14 ore copre le necessitÃƒÂ  di training di diverse tipologie di utenti, da quelli base a quelli avanzati. Grazie infatti a un programma didattico graduale, chi non ha mai utilizzato l'applicativo potrÃƒÂ  imparare da zero, mentre coloro che giÃƒÂ  lo conoscono, potranno approfondire tematiche complesse come la gestione del colore, il formato Camera Raw, l'automazione di operazioni ripetitive e l'uso di Photoshop CS per il web.\n\nCaratteristiche\n\nSupporto: DVD-ROM\nDurata: 194 filmati per circa 14 ore di lezione.\nSistema operativo: Mac e Win compatibile\nLingua dell'applicativo: Completamente in italiano\nRisoluzione video: Schermate video a 1024 X 768 pixel.\nPlaylist: per selezionare le lezioni preferite\nRicerca interna: per trovare velocemente le lezioni che riguardano uno specifico argomento.\n\nContiene gli stessi documenti usati nelle lezioni e la versione TryOut del programma (in inglese) valida per 30 giorni, per poter esercitarsi allo stesso modo mentre si segue il corso.\n\nTeachers\n\nLaura Brenna (Adobe Certified Expert)\nIvan Fava (Adobe Certified Expert)\nElda Longo (Adobe Certified Expert)\nMatteo Oriani (Adobe Certified Expert, Adobe Certified Instructor)\nAna Paula Tamburini (Adobe Certified Expert, Adobe Certified Instructor, Adobe Certified Instructor-Video Specialist)\n\nCORSO MULTIMEDIALE IN LINGUA ITALIANA\n\nSERIALE ALL'INTERNO DELLA ISO.","torrent":{"xt":"urn:btih:54fcf5e166a67b613962efaf450b0ac41afa8842","amp;dn":"%5BITA%5D+CORSO+MULTIMEDIALE+PHOTOSHOP+CS+-+TPB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"54fcf5e166a67b613962efaf450b0ac41afa8842","infoHashBuffer":{"type":"Buffer","data":[84,252,245,225,102,166,123,97,57,98,239,175,69,11,10,196,26,250,136,66]},"announce":[],"urlList":[]}}