{"title":"Sam Apple Pie - East 17 [1972][2005][320 KBPS]","uid":7984715,"size":164645578,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:55b814b4df2bf8cd09f15d1d3252f9da616e49c9&amp;dn=Sam+Apple+Pie+-+East+17+%5B1972%5D%5B2005%5D%5B320+KBPS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":5,"uploader":"LameDuck69","files":15,"time":1357258012,"description":"Sam Apple Pie - East 17 [1972][2005]\n\n\n\n\n\n01 Good Time Music\n02 Louise\n03 Out On The Road\n04 Route 66\n05 She's The Queen\n06 Old Tom\n07 Flying\n08 Call Me Boss\n09 Another Orpheus\n\n\n\n\n\n320 KBPS\n\nCover Art\n\n\n\n\nThis CD was originally uploaded by an &quot;Anonymous&quot; friend in WAV format so I converted it to .mp3 to share with whoever wants it, as it is a great album. Thank the original uploader, as I did.  A welcome addition to your collection.\n\n\n\n\n\n\n\nFrom Wikipedia:\n\n\n\nSam Apple Pie were a British blues-rock band, of the late 1960s and 1970s, noted for having played at the first Glastonbury Festival in 1970, and for playing a role in the early careers of several musicians including Gary Fletcher, Dave Charles and Malcolm Morley.\n\nFormed in Walthamstow, London, where they ran their own club 'The Bottleneck Blues Club', Sam Apple Pie soon attracted a large live following, with a mix of goodtime blues and boogie, interspersed with humour. In October 1969 they played the Amougies festival, in Belgium, where Frank Zappa jammed with them.\n\nThey wrote all but one of the songs on their first album Sam Apple Pie (1969) which featured lead singer Sam &quot;Tomcat&quot; Sampson with Mike &quot;Tinkerbell&quot; Smith and Steve Jolly on guitars, bassist Bob &quot;Dog&quot; Rennie, Malcolm Morley on keyboards and Dave Charles on drums.\n\nIn 1970 they played the first Glastonbury Festival, after which Morley and Charles left to form Help Yourself and Steve Jolly to join Procol Harum offshoot Freedom. After several more line up changes, the band recorded their second album East 17 in 1973, with Sam Sampson and Bob Rennie from the first album supported by Andy Johnson and Denny &quot;Pancho&quot; Barnes on guitars, and Lee Baxter Hayes on drums.\n\nThey disbanded in 1974, but reformed the next year. During the hiatus, from mid 1974 to February 1975, the band members performed with Vincent Crane as Vincent Crane's Atomic Rooster. Further line up changes included bassist Gary Fletcher, who subsequently joined The Blues Band and drummer Martin Bell. The band continued into the late 1970s, changing its name to The Vipers, (not to be confused with the new wave band of the same name) before disbanding.\n\nFormer member, Andy Johnson, died from throat cancer on Friday 5 March 2010 in Hastingwood, Essex, at the age of 62.\n\n","torrent":{"xt":"urn:btih:55b814b4df2bf8cd09f15d1d3252f9da616e49c9","amp;dn":"Sam+Apple+Pie+-+East+17+%5B1972%5D%5B2005%5D%5B320+KBPS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"55b814b4df2bf8cd09f15d1d3252f9da616e49c9","infoHashBuffer":{"type":"Buffer","data":[85,184,20,180,223,43,248,205,9,241,93,29,50,82,249,218,97,110,73,201]},"announce":[],"urlList":[]}}