{"title":"Rosewood","uid":4058445,"size":1476583424,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:576ef99a63135873d25d6867673b0d99b530a4e5&amp;dn=Rosewood&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Pharos2001","files":2,"time":1204484658,"description":"In 1923, a black town in Florida was burned to the ground, its people murdered because of a lie. Some escaped and survived because of the courage and compassion of a few extraordinary people. This film is for them. \n\nA dramatization of a 1923 horrific racist lynch mob attack on an African American community\n\nIt all started because of a lie.Rosewood is a quiet little town in Florida.One day a white woman lies that an Afro-American man raped her.That starts a war between the blacks and whites.Bunch of racists kill innocent black people. Ving Rhames plays Mann, a new comer in town who is hunted because he's black. Jon Voight plays John Wright, the only good white man in town who tries to safe the African-American community of the town.John Singleton's Rosewood from 1997 is amazing movie about the stupidity of people.This actually happened in 1923 which sounds unbelievable.How idiotic can people be?Some people still haven't learned.Here in Finland racism only seems to grow which makes me mad.Stop being idiots! There are some very touching moments in this movie.There are moments that may bring tears in your eyes.Acting work is brilliant in the movie.Jon Voight and Ving Rhames do very powerful role works.During Rosewood I had many feelings inside me.One of them was anger.I'm white and not always so proud of it. \n\n","torrent":{"xt":"urn:btih:576ef99a63135873d25d6867673b0d99b530a4e5","amp;dn":"Rosewood","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"576ef99a63135873d25d6867673b0d99b530a4e5","infoHashBuffer":{"type":"Buffer","data":[87,110,249,154,99,19,88,115,210,93,104,103,103,59,13,153,181,48,164,229]},"announce":[],"urlList":[]}}