{"title":"Maya Daykeeping - Three Calendars from Highland Guatemala (2009)","uid":5327175,"size":1387361,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:57903805a13fac359e3d3ad95effd093b89cd9f9&amp;dn=Maya+Daykeeping+-+Three+Calendars+from+Highland+Guatemala+%282009%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"malestrom_HH","files":2,"time":1265052804,"description":" &lt;a href=&quot;http://bayimg.com/eAkmIAACB&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/eAkmIAACB&lt;/a&gt;\n\nMaya Daykeeping: Three Calendars from Highland Guatemala (Mesoamerican Worlds) By John M. Weeks, Frauke Sachse, Christian M. Prager\nPublisher: University Press of Colorado 2009-05-30 | 221 Pages | ISBN: 087081933X | PDF |\n\nIn Maya Daykeeping, three divinatory calendars from highland Guatemala--examples of a Mayan literary tradition that includes the Popul Vuh, Annals of the Cakchiquels, and the Titles of the Lords of Totonicapan--dating to 1685, 1722, and 1855, are transcribed in K'iche or Kaqchikel side-by-side with English translations. Calendars such as these continue to be the basis for prognostication, determining everything from the time for planting and harvest to foreshadowing illness and death. Good, bad, and mixed fates can all be found in these examples of the solar calendar and the 260-day divinatory calendar.\n\nThe use of such calendars is mentioned in historical and ethnographic works, but very few examples are known to exist. Each of the three calendars transcribed and translated by John M. Weeks, Frauke Sachse, and Christian M. Prager--and housed at the University of Pennsylvania Museum of Archaeology and Anthropology--is unique in structure and content. Moreover, except for an unpublished study of the 1722 calendar by Rudolf Schuller and Oliver La Farge (1934), these little-known works appear to have escaped the attention of most scholars. Introductory essays contextualize each document in time and space, and a series of appendixes present previously unpublished calendrical notes assembled in the early twentieth century.\n\nProviding considerable information on the divinatory use of calendars in colonial highland Maya society previously unavailable without a visit to the University of Pennsylvania's archives, Maya Daykeeping is an invaluable primary resource for Maya scholars.","torrent":{"xt":"urn:btih:57903805a13fac359e3d3ad95effd093b89cd9f9","amp;dn":"Maya+Daykeeping+-+Three+Calendars+from+Highland+Guatemala+%282009%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"57903805a13fac359e3d3ad95effd093b89cd9f9","infoHashBuffer":{"type":"Buffer","data":[87,144,56,5,161,63,172,53,158,61,58,217,94,255,208,147,184,156,217,249]},"announce":[],"urlList":[]}}