{"title":"English Wikipedia (All Articles) - May 2011","uid":6430796,"size":6023415073,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:582a44460a29fa979d322aa4c400a40aac111b9e&amp;dn=English+Wikipedia+%28All+Articles%29+-+May+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"RaptorHunter","files":3,"time":1306641210,"description":"This torrent contains current revisions of all English Wikipedia Articles. It does not contain User, Talk. I wrote a script to cut out the project pages (for example: [[WP:Administrators\\\\\\' Noticeboard]]). You may have seen other torrents with sizes over 30 Gigs. These contain every revision ever made to Wikipedia and expand to over 5 Terabytes of text. Most people will not find these useful. If you just want to have the complete Wikipedia on your computer, then this is the torrent you want.\n\n\n\nI have included the program WikiTaxi with the torrent. WikiTaxi enables you to read, search, and browse Wikipedia offline. No Internet connection is needed; all pages are stored in a WikiTaxi database. Because Wikipedia is constantly growing, WikiTaxi uses compression to make sure that the database stays as small as possible.  \n\n\n\nThis torrent is being made available to simplify the process of downloading all of Wikipedia\\\\\\'s articles without wasting bandwidth. I will seed this for awhile, but I really am hoping that Wikipedia could publish an official torrent itself every year containing validated articles (checked for vandalism and quality), and then seed that torrent indefinitely. This will reduce strain on the servers and make the process of obtaining a database dump much simpler and easier. It would also serve as a snapshot in time, so that users could browse the 2010 or 2011 Wikipedia.\n\n\n\nInstructions:\n\n1. Do NOT unzip the .bz2 file!\n2. Instead, unzip the Wikitaxi program. \n  (You can also download it from: http://www.wikitaxi.org/delphi/doku.php/products/wikitaxi/index )\n3. Run WikiTaxi_Importer.exe and select the .bz2 file. \n   Click import and wait for a couple hours.\n4. Run WikiTaxi.exe and open the newly created database file.\n   (the .taxi file, not the .bz2 file)\n5. Enjoy Wikipedia without the Internet.\n","torrent":{"xt":"urn:btih:582a44460a29fa979d322aa4c400a40aac111b9e","amp;dn":"English+Wikipedia+%28All+Articles%29+-+May+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"582a44460a29fa979d322aa4c400a40aac111b9e","infoHashBuffer":{"type":"Buffer","data":[88,42,68,70,10,41,250,151,157,50,42,164,196,0,164,10,172,17,27,158]},"announce":[],"urlList":[]}}