{"title":"Fitness MILFS vol. 2 (2014) [DvdRip].mp4","uid":10351943,"size":1824397608,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:587e76eaa679b0507cbf775b8ee341a4e0805cb1&amp;dn=Fitness+MILFS+vol.+2+%282014%29+%5BDvdRip%5D.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Artrage","files":-1,"time":1402681514,"description":"\nFitness MILFS vol. 2 (2014) [DvdRip].mp4\n\n\nPosters and Screenshots\n &lt;a href=&quot;\nhttp://postimg.net/viewerr1.php?file=76057666408999679600.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.net/viewerr1.php?file=76057666408999679600.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://postimg.net/viewerr1.php?file=98778559619545622616.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.net/viewerr1.php?file=98778559619545622616.jpg&lt;/a&gt;\n\n\n\nCast\n\nEva Karera, Vicki Chase, Yasmine DeLeon, Sheila Marie, Lotus Lain\n\n\nDescription\n\n&quot;Lotus Lain In Her Very1st Anal Scene! Eva Karera is one of today's top MILFS, and for good reason. Eva stands at 5'8&quot; and she is packing a huge set of boobs. This super Busty MILF is fit with some long sexy legs. Eva also keeps her Anal Cavity fit by stuffing it with Big Black cock as much as possible. Eva loves a good workout but her favorite is the BBC workout as Eva displays for us in this movie by taking on the Jovan Jordan Monster cock before taking a huge Facial.Black and Filipino mixed Lotus Lain meet's up with Clark Spent aka Anthony Rosano for the 1st time. The two hit it off right away in this high-energy scene with great chemistry trying to out much each other's next nasty move. Anthony goes down on Lotus eating her MILF pussy and ass hole, Lotus responds by sucking the life out of Anthony's cock. Lotus then takes the cock in her pink pussy hole for a few positions with Anthony fingering her butthole and without hesitation Anthony slides his cock from her pussy and into her anal cavity. Lotus just goes along for the anal ride moaning and yelling yes fuck my ass you dirty bastard. Congratulations Lotus for doing your 1st Anal Scene.At 44 years old Hispanic MILF Sheila Marie has the ass of a 20 year old. When Sheila bends over she shows her perfectly round Hispanic ass and how smooth it is. Shelia also has a sweet tooth for chocolate, chocolate cock that is. Jovan Jordan just loves a good MILF so I pair them up to see what happens. Sheila is blown away by the BBC Jovan is packing but she tries her hardest to get all of it in her mouth before bending over and taking the BBC in her tight Latin vagina, Jovan long dicks Sheila's pussy before inching it into her Anal Cavity before giving Sheila a free protein shake for her belly after she swallows the load.Vicki Chase is no stranger to the cock and boy can she suck one. Vicki try's to get in her stretching before hitting the gym for a good MILF workout. However she gets interrupted by Vince Vouyer, Vicki is just trying to do the right thing but Vince wants her to do all the right things to his cock. So Vicki being the cock junkie that she is just cannot resist a stiff one, Vicki then slowly starts working the shaft and balls before deep throating the cock. Vicki then starts rimming Vince's ass hole going back and forth between the balls and butt hole and blowing bubbles on his cock and balls before sucking the load right out of his cock the gargling the load before swallowing it.Black and Hispanic mixed Yasmine De Leon bring her sexy black ass over for a BBC scene with Jovan Jordan. Jasmine starts things off by Butt fucking herself with a toy warming up her ass for Jovan's baby arm. After the two engage in some high-energy pussy fucking Jovan attempts to penetrate Yasmine's butt hole but the horny MILF just could not handle the Jovan girth so Jovan just continued pounding the pussy until he blew his load down her throat.&quot;\n\n\nTags \n\nHardcore, XxX, Hot, Blowjob, Anal, Interracial, Feature, MILF\n\n\nResolution  \n\n720x400\n\n\nDuration  \n\t\n03:05:33\n\n\nSize      \n\n1.69 GB\n","torrent":{"xt":"urn:btih:587e76eaa679b0507cbf775b8ee341a4e0805cb1","amp;dn":"Fitness+MILFS+vol.+2+%282014%29+%5BDvdRip%5D.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"587e76eaa679b0507cbf775b8ee341a4e0805cb1","infoHashBuffer":{"type":"Buffer","data":[88,126,118,234,166,121,176,80,124,191,119,91,142,227,65,164,224,128,92,177]},"announce":[],"urlList":[]}}