{"title":"Animal Collective - Centipede Hz [24 bit FLAC] vinyl","uid":8182858,"size":1092651554,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:58f637c31607e6b0ecf6c5ed99034580842185a4&amp;dn=Animal+Collective+-+Centipede+Hz+%5B24+bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"24.96","files":-1,"time":1361661572,"description":"  Animal Collective - Centipede Hz (2012) [24 bit FLAC] vinyl\n\n  Released: 2012\n  Genre: Pop/Rock\n  Style: Experimental Rock, Indie Rock\n  Codec: FLAC\n  Bit Rate: ~ 2,800 kbps\n  Bits Per Sample: 24\n  Sample Rate: 96,000 Hz\n\n  01. Moonjock\n  02. Today's Supernatural\n  03. Rosie Oh\n  04. Applesauce\n  05. Wide Eyed\n  06. FatherTime\n  07. New Town Burnout\n  08. Monkey Riches\n  09. Mercury Man\n  10. Pulleys\n  11. Amanita\n\n  With 2009's Merriweather Post Pavilion, Animal Collective delivered on the seemingly unattainable level of promise that had grown with each release since their beginnings. Ever-shifting, the woolly freak folk of 2003's Sung Tongs gave way to subsequent albums Feels and Strawberry Jam, which were influenced in equal parts by minimal techno and Syd Barrett-esque psychedelic rock. Big beats, pop hooks, heightened production, and Animal Collective's patented freakiness combined into a perfect storm with MPP, and countless new fans were exposed to the band for the first time. Expectations for a similarly brilliant follow-up were bound to be huge, but the band's mercurial approach would never allow for any album to sound too much like the last. Ninth studio album Centipede Hz finds AC returning to a face-to-face writing style, rather than collaborating through file exchanging due to distance. Also returning to the fold is longtime contributor Josh Dibb (aka Deakin), who sat out the last album entirely. Deakin's presence is noticeable on the far busier new songs, and he even contributes his first lead vocal ever for the band on the swirling bounce of &quot;Wide Eyed.&quot; Noah Lennox has expanded the stripped-down percussion of earlier releases into a makeshift drum kit (complete with the kick drum that was often absent in the past), and live keyboards replace the MIDI-sequenced arpeggios that decorated the last album. All of these elements add to a maximized sound that Centipede Hz sometimes drowns under. The digital rush of &quot;Monkey Riches&quot; is so heavy with ornamental sounds that they suffocate the song, while the trudging pulse of album-closer &quot;Amanita&quot; piles processed guitar lines and nervous rhythmic samples on top of an already weary skeleton, obscuring the song's strengths. Still, manicured pop moments abound, kicking off with the road trip nostalgia of the incredibly catchy &quot;Moon Jock,&quot; and one-two punching into the more aggressive, distorted, melodic scatter of &quot;Today's Supernatural.&quot; The roomy acoustic percussion of &quot;Father Time&quot; collides with booming electronic drums and Avey Tare's nasally, geeky vocals in a series of carefree hooks. Centipede Hz is an album of numerous skittering layers, replacing the ambient pop elements of previous albums with slight Brazilian touches, fuzzy electronic bashing, and even more unrecognizable gurgling samples than usual. Despite the return of MPP producer Ben Allen, there's nothing as direct or bounding as &quot;My Girls&quot; or even as trippily infectious as &quot;Summertime Clothes.&quot; In the context of their greater body of work, Centipede Hz is yet another strange and oozing collection of experiments, most of which succeed. There's a higher percentage of anxiety and queasiness mixed in amid the moments of pop bliss, and though fans of the glassy perfection of MPP may be initially disappointed, Centipede Hz sounds like another logical step in the band's evolution.","torrent":{"xt":"urn:btih:58f637c31607e6b0ecf6c5ed99034580842185a4","amp;dn":"Animal+Collective+-+Centipede+Hz+%5B24+bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58f637c31607e6b0ecf6c5ed99034580842185a4","infoHashBuffer":{"type":"Buffer","data":[88,246,55,195,22,7,230,176,236,246,197,237,153,3,69,128,132,33,133,164]},"announce":[],"urlList":[]}}