{"title":"Atom Resolved Surface Reactions - Nanocatalysis","uid":15480647,"size":5757731,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5a54832fb73101f8b468db81c7ea2b54d699c4ee&amp;dn=Atom+Resolved+Surface+Reactions+-+Nanocatalysis&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1470249972,"description":"Atom Resolved Surface Reactions - Nanocatalysis - P.R. Davies, M.W. Roberts (RSC, 2008).pdf\r\n\r\nThis book offers a unique perspective of the impact of scanning probe microscopies on our understanding of the chemistry of the surface at the nanoscale. Research oriented, with the concepts gleaned from Scanning Tunnelling Microscopy being related to the more established and accepted views in surface chemistry and catalysis the authors have addresses the question &quot;How do the models based on classical spectroscopic and kinetic studies stand up to scrutiny at the atom - resolved level?.&quot; In taking this approach the reader, new to the field of surface chemistry, should be able to obtain a perspective on how the evidence from STM confirms or questions long standing tenets. An emphasis is given to &quot;how did we get to where we are now&quot; and a large number of figures from the literature are included along with suggestions for further reading. Topics discussed include: - the dynamics of oxygen chemisorption at metal surfaces - control of oxygen states and surface reconstruction - dissociative chemisorption of diatomic and hydrocarbon molecules - nanoparticles and chemical reactivity - STM at high pressures - structural studies of sulfur containing molecules and molecular templating This book will appeal to all those who wish to become familiar with the contribution Scanning Tunnelling Microscopy has made to the understanding of the field of surface chemistry and heterogeneous catalysis and also to those who are new to catalysis, a fascinating and important area of chemistry","torrent":{"xt":"urn:btih:5a54832fb73101f8b468db81c7ea2b54d699c4ee","amp;dn":"Atom+Resolved+Surface+Reactions+-+Nanocatalysis","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a54832fb73101f8b468db81c7ea2b54d699c4ee","infoHashBuffer":{"type":"Buffer","data":[90,84,131,47,183,49,1,248,180,104,219,129,199,234,43,84,214,153,196,238]},"announce":[],"urlList":[]}}