{"title":"Ziggurat v1.0u2.1","uid":11419978,"size":377811974,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5a78cf01f3491db39cbd5de1b2cd30efa2648515&amp;dn=Ziggurat+v1.0u2.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Lamasu","files":-1,"time":1415612333,"description":"&quot;Ziggurat is a dungeon crawling FPS, with procedurally generated scenarios and encounters. You'll face dozens of dangerous enemies while you find new and powerful spells, and learn helpful perks in your quest to overcome this deadly test.\nBecome a neophyte sorcerer, and get ready for your rite of passage: Enter the labyrinth and face dangerous challenges to prove your worth and become a powerful wizard.\nThe game focuses on fast-paced first person shooting, with an old-school vibe, and updated handling and game mechanics. Dungeon crawling and RPG/Roguelike elements are added into the mix, resulting in a fun, challenging and varied game, with lots of content to discover.\nFight almighty bosses, get through rooms filled with traps, and treasures that may help you in your journey... Each game is a whole new experience.\nUnlike most rogue-thingies, on Ziggurat your combat skills will be the most important asset to keep advancing. Leveling up and randomly generated content is there to improve variety and make each game different, not to make the game a roll dice or an unbearable grind.\nMost perks are designed to change the way you have to play or the weapons you'll want to use. Do you want more speed in exchange for less health, or maybe is better to have mana regeneration? Increase drop rate, or refill ammo here and now? No number game here, simple and direct choices.\nWe've also ensured that, as a proper FPS game, the experience is quick and direct. There's no inventory to manage or the need to compare two almost equal item drops, just weapon selection, and mana/health are usually the bargaining chip.\nA whole arsenal of magic and alchemic weapons will be at your disposal. Wreak havoc among your enemies, but watch your mana reserves or you might regret it later.\nMagic staves, spellbooks, magic wands... dozens of weapons with different attack strategies that help keeping the game fresh.&quot;\n\nThis is post-release Update 2.1, which addresses the issues of Update 2.\n\nChangelog:\nUpdate 2.1 (07.11.2014):\n- Fixed new room issues (pathfinding, door, holes, monster spawns).\n- Fixed Shield Skeleton not having an attack animation.\n- Fixed minor issues with destructible objects. \nUpdate 2 (06.11.2014):\n- Added plenty of new rooms (more than 15). These ones have more verticality than usual.\n- Added lots of new perks, making a total of 100 different perks available.\n- Changed unlock system to guarantee a new weapon if you unlock at least 3 items, and a new amulet if you unlock 5 items.\n- Fixed Mirror of Fate perk breaking saved games.\n- &quot;Clear saved data&quot; also clears game stats now.\n- Changed shielded skeletons attack pattern, so they aren't as tedious to kill.\n- Changed Easy Peasy achievement requirements (now it's easier to get)\n- Now Sound effects volume setting doesn't apply to music.\n- Added a Smooth Mouse option in Control settings.\n- Other minor bugfixes and improvements.\n\nIf you like the game, support the developer, buy it!              &lt;a href=&quot;\nhttp://store.steampowered.com/app/308420/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://store.steampowered.com/app/308420/&lt;/a&gt;","torrent":{"xt":"urn:btih:5a78cf01f3491db39cbd5de1b2cd30efa2648515","amp;dn":"Ziggurat+v1.0u2.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a78cf01f3491db39cbd5de1b2cd30efa2648515","infoHashBuffer":{"type":"Buffer","data":[90,120,207,1,243,73,29,179,156,189,93,225,178,205,48,239,162,100,133,21]},"announce":[],"urlList":[]}}