{"title":"In Vlaamse Velden(2014) DVD5 NR3 (NL gespr)NLtoppers","uid":11009605,"size":4681763424,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:5ce90b8e5185160a823d543eaf9cabde6fb01c78&amp;dn=In+Vlaamse+Velden%282014%29+DVD5+NR3+%28NL+gespr%29NLtoppers&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Yakomo","files":-1,"time":1410329753,"description":"In Vlaamse Velden(2014) DVD5 NR3 (NL gespr)NLtoppers\n\n\nJuni - september 1915\nGuillaume heeft bij een gasaanval van de Duitsers een huidaandoening opgelopen. Bij toeval ontmoet hij zijn broer opnieuw in De Panne. Vincent verliest intussen steeds meer van zijn soldaten aan het front. Marie gaat nog een stapje verder en smokkelt geheime documenten het land uit. Ze gaan hiervoor met de trein naar haar grootmoeder in Nederland. Wanneer Virginie en haar grootmoeder deze documenten ontdekken, zijn ze ontzet. Om aan de universiteit te kunnen beginnen, moet dokter Boesman onderzoek doen naar geslachtsziekten. Hij nodigt daarom zwangere vrouwen en jonge moeders uit bij zijn huis, waarbij hij ook prostituees onderzoekt die deze ziekten hebben. De universiteit blijft echter nog voor onbepaalde tijd dicht. In een bui van razernij snijdt dokter Boesman zich aan de buisjes met bloedstalen ...\nDecember 1915 - oktober 1916\nTerwijl Vincent een hard leven leidt in de loopgraven, zet Guillaume de bloemetjes buiten als chauffeur van majoor Colle. Hij is present op de feestjes die zijn Britse kameraad John Woods organiseert. Hier leert hij ook Anna en Jozefien kennen. Dokter Boesman tekent een manifest, samen met enkele andere prominenten, om een Vlaamse universiteit te openen in Gent, dit zeer tegen de zin van Virginie. Toch besluit ze haar man te volgen en haar ontslag te geven als voorzitster van het commiteit. Hans-Peter en Marie groeien steeds dichter bij elkaar en verklaren elkaar de liefde. Toch voelt Hans-Peter zich gebruikt door Marie, als hij erachter komt dat Marie smokkelde voor de vijand. De kolenboer die de smokkel organiseerde is opgepakt en na mishandeling tijdens het verhoor bezweken. Zijn zoon leeft nog. Marie hoopt dat hij zwijgt over haar medeplichtigheid ...\n***************************************\n10 delige reeks bestaande uit 5 DVD's \nBeeldformaat : 16:9\nspeelduur volledig : +/- 8 uur\nAudio Dolby Digital 2.0\nTaal : Nederlands\nOndertiteling voor doven en slechthorende\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt2253780/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt2253780/&lt;/a&gt;\n\n\nHeeft u deze film gezien en wilt u ergens een recensie achterlaten?\nga dan eens naar http://www.pheunix.nl\n\n[IMG]http://img411.imageshack.us/img411/5893/phpthumbgeneratedthumbnw.gif[/IMG]   \n\nNLtopper Yakomo","torrent":{"xt":"urn:btih:5ce90b8e5185160a823d543eaf9cabde6fb01c78","amp;dn":"In+Vlaamse+Velden%282014%29+DVD5+NR3+%28NL+gespr%29NLtoppers","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ce90b8e5185160a823d543eaf9cabde6fb01c78","infoHashBuffer":{"type":"Buffer","data":[92,233,11,142,81,133,22,10,130,61,84,62,175,156,171,222,111,176,28,120]},"announce":[],"urlList":[]}}