{"title":"Clips4Sale - Naughty, little girls having the BIG, BLACK SAUSAGE","uid":13997643,"size":1506737964,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:5d7b985acaa273c0bcfdf08ac0de48cd164060d9&amp;dn=Clips4Sale+-+Naughty%2C+little+girls+having+the+BIG%2C+BLACK+SAUSAGE&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"distinc","files":1,"time":1458755290,"description":"\n.......:::Screenshots:::.......\r\n\r\n \nhttp://imagedisco.net/?v=4240680230\r\n \nhttp://imagedisco.net/?g=945355180\r\n\r\n\r\n\r\nDescription:\r\n\r\nAfter the pajama girl's party.....I having so much fun with my girlfriend....we always making phone calls to the most popular guy in the school! In the most exiting moment my mom just call and remind me to let in the guy to fix our sink!!! Ohh.....she just destroyed all the fun now......well....we told at the moment! And then.....the best think happened! The repairman comes....oh my gosh!!! He is black!!! Me and my girlfriend never saw black guy before! ....Just let him work!!! Now is going to be a real fun for us! We were reading in the girl's magazine that the black guy have a huge....huge cock! Here is the time to find out the truth! We fight a bit who will be first to touch it....to feel the monster! For the first time!!! He get really mad after the second time and wanted to leave!!! But as the daddy's rich bitches as we are.....he can leave just like that! We blackmail him and he has no other choice then to play with us! Actually......we are going to play with his big black monster!!! Sucking that huge black cock and licking all of it.....make him suffer by our bitchy mouths and tongues!!! We seduce him....well....blackmail him to take our tight little pussies! That huge ....black sausage....we never feel to big dick inside! And this is like a best toy ever! That black dick inside the white pussy is the most rousing thing what could happen! But is like.....you have never enough.....we almost fight for that cock! Is it true then.....if you once try the black man, you never want other one! Ohh.....he just make my pussy so full.....there was so much pressure.....I told it is going to brake me! But I was just coming over and over again and my girlfriend too! You can see that ecstasy on our faces! No just because we just use and blackmail him and make it all so exited.....but because of the pleasure we been feeling with his big, black cock!!! And his sperm....he couldn't control him self with the two little sluts like us....he cum before we allowed to him...inside! But there was some more of him.....he keep the best shot for out mouths!!! Mmm....so tasty!!! Of course.....we want his treasure! All of it!!! And as we want both taste that cum....a lot of it.....we just swapping.....just drooling that tasty sperm from each other mouth!!!\r\n\r\nScene includes Blowjob, Threesome, Doggy style, Cowgirl, Missionary, Cum in mouth","torrent":{"xt":"urn:btih:5d7b985acaa273c0bcfdf08ac0de48cd164060d9","amp;dn":"Clips4Sale+-+Naughty%2C+little+girls+having+the+BIG%2C+BLACK+SAUSAGE","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d7b985acaa273c0bcfdf08ac0de48cd164060d9","infoHashBuffer":{"type":"Buffer","data":[93,123,152,90,202,162,115,192,188,253,240,138,192,222,72,205,22,64,96,217]},"announce":[],"urlList":[]}}