{"title":"The Ultimate Johnny Carson Collection Vols. 1-2 (2003) DVDRip","uid":13036107,"size":1853899957,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:5dbe06d0246b00189ac8a87a73f722d8ceea490b&amp;dn=The+Ultimate+Johnny+Carson+Collection+Vols.+1-2+%282003%29+DVDRip&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"sartre7","files":6,"time":1450479796,"description":"STARS.........: Johnny Carson, Ed McMahon\r\nGENRE.........: Comedy | Biography\r\nRUNTIME.......: 2h 39mn\r\nSIZE..........: 1.72GB\r\nVIDEO CODEC...: x264 (  )\r\nRESOLUTION....: 640x480\r\nBITRATE.......: 1300 Kbps (CRF)\r\nFRAMERATE.....: 29.970 fps\r\nAUDIO.........: English AC3 2.0 192kbps\r\nSOURCE........: DVD9\r\nSUBTITLES.....: N/A\r\nCHAPTERS......: Yes\r\nENCODED BY....: Sartre\r\nENCODE DATE...: 2014-10-11\r\nENCODING NOTE.: Deinterlaced with QTGMC\r\n\r\n\r\n\r\nCulled from 30 years of material, this collection of moments from The Tonight Show Starring Johnny Carson contains some of most inspired bits of lunacy ever recorded. Whether cajoling with Hollywood's biggest stars or normal folk with special talents, Carson was a master of finding the right joke, with timing second to none. Along with bits of his opening monologues, skits, and early standup appearances from the likes of David Letterman and Eddie Murphy, there are many highlights with perhaps the perfect Carson guest--exotic animals that stole the show. This collection was released shortly after Carson's reign ended in 1992. Although most of the tapes from his first decade are lost, there are plenty of highlights from the '70s through the '90s. Although many followed--and a few have even succeeded--Carson's Midwest charm made him the king of TV in a period when America was defined by television.\r\n\r\n\r\nThe Best of The '60s &amp; '70s - Return to origins of the Tonight Show in black and white broadcasting the world's biggest stars from Studio 6-B, Rockefeller Center, New York City. Guest List: Bob Hope, Dean Martin, Dolly Parton, Ed Ames, Buddy Hackett, Jack Webb, Don Rickles, Jay Leno, Steve Martin, George Carlin, Pearl Bailey, and many more! \r\n \r\nThe Best of the '70s &amp; '80s - Follow The Tonight Show as it moved from New York to NBC's Studio One in &quot;beautiful downtown Burbank&quot; where it remained for the next 20 years. Guest List: Albert Brooks, Betty White, Charles Grodin, Drew Barrymore, Jimmy Stewart, Joey Lawrence, Richard Dawson, Stephanie Zimbalist, Bill Maher, Eddie Murphy, Garry Shandling, and many more! \r\n\r\nThe Best of The '80s &amp; '90s - Enjoy an all-star team of celebrity talent, more memorable moments and Johnny's comic impersonations of public figures and politicians. Guest List: Annie Potts, Ann-Margret, Bette Midler, Bill Clinton, Bob Newhart, Chevy Chase, Jane Fonda, Drew Carey, John Mendoza, Robin Williams, Roseanne and many more! \r\n\r\nExtra: Studio 1 Backstage","torrent":{"xt":"urn:btih:5dbe06d0246b00189ac8a87a73f722d8ceea490b","amp;dn":"The+Ultimate+Johnny+Carson+Collection+Vols.+1-2+%282003%29+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5dbe06d0246b00189ac8a87a73f722d8ceea490b","infoHashBuffer":{"type":"Buffer","data":[93,190,6,208,36,107,0,24,154,200,168,122,115,247,34,216,206,234,73,11]},"announce":[],"urlList":[]}}