{"title":"Isaac Asimov - Fantastic Voyage II - Destination Brain - Unb","uid":4778058,"size":353344505,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:5e1c1f9f6c1e6cb91736ed68287470cb7aa0a3f1&amp;dn=Isaac+Asimov+-+Fantastic+Voyage+II+-+Destination+Brain+-+Unb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"RamJamSam","files":11,"time":1237288947,"description":"Isaac Asimov - Fantastic Voyage II - Destination Brain - Unb\nRead By:  Roy Abers\nRuntime:  14 Hours and 1 Minute\n\n\n\nTwenty-one years ago when the movie Fantastic Voyage was released, Asimov was hired to do the novelization. The book was successful but, to Asimov, not satisfying, for &quot;I never felt it to be entirely mine.&quot; Now he has rewritten it his way, and it's good. The story concerns Albert Jonas Morrison, a 21st century neurophysicist, and otherwise an ordinary and unheroic man, who is kidnapped and taken to the Soviet Union. A major Soviet scientist, Pyotr Shapirov, is in an irreversible coma, and Morrison's special expertise could be of value. The Soviets believe that Morrison may be able to apply his controversial theories to retrieve vagrant thoughts that still may be floating in Shapirov's damaged brain and so provide clues to important work in which Shapirov was engaged. Morrison goes cold with fear because the plan calls for him to be miniaturizedalong with four Soviet scientiststo sub-molecular size, introducing them into Shapirov's body and, ultimately, into his brain. The snappish relationships between the scientists is wryly depicted, and the mission itself makes fascinating reading as both an actionadventure and an intellectually stimulating premise.\n\n\n\nGooD SeeDinG!","torrent":{"xt":"urn:btih:5e1c1f9f6c1e6cb91736ed68287470cb7aa0a3f1","amp;dn":"Isaac+Asimov+-+Fantastic+Voyage+II+-+Destination+Brain+-+Unb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e1c1f9f6c1e6cb91736ed68287470cb7aa0a3f1","infoHashBuffer":{"type":"Buffer","data":[94,28,31,159,108,30,108,185,23,54,237,104,40,116,112,203,122,160,163,241]},"announce":[],"urlList":[]}}