{"title":"Wifiway 2.0.3 alpha1 [MULTi]","uid":6717260,"size":712769536,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5e2d7c7fd71ed01e39bf7db2495ee7e60a8d3628&amp;dn=Wifiway+2.0.3+alpha1+%5BMULTi%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"webchella","files":1,"time":1317634069,"description":"Wifiway 2.0.3 alpha1 [MULTi]\n\n--------\nEnglish:\n--------\nCategory: Programs \nLanguage: English, Spanish \n\nWifiway has left the new 2.0.3 with a lot of developments and applications. It has completely changed the look and has many new features. \nThe visual aspect is nice, but since not everybody has \nto like it, will be optional, there will be a module called wifiway theme or style wifiway, removing the module will return to the traditional apecto blue windows. \n\nWifiway a live CD is based on the Linux operating system, can be run without installation directly from the CDROM or also from the hard drive as LiveHD, plus they can be installed on USB sticks or hard disk. \n\nWifiway is a linux live cd adapted for wireless and also with international support. \n\nIt is based on debian, mandriva, fedora and slax, this is a project created with linuxfromscratch. \n\nThe live CD was created with the Linux-live-scripts. \n\nAlso includes autologin. \nstartx (to start XWindows) \nautox (to set auto XWindows) \n\nDisclaimer: The use of this wireless analysis software should be a basic tool for professionals and users, ultimately, meet the security level of wireless facilities. The use of it for other purposes is strictly prohibited. \n\n\n* Includes support of drivers zydas, ipw2200, ipw3945 (ipwraw 2.0 - JMF). \n\n* Wifiway has 99% of its content with international support. \n\n* Keyboard configuration, help, graphical environment and the default language during the live boot CD. \n\n* Main menu in Spanish, while the internal menu has the choice of language at boot time, international support\n\n\n--------\nEspaÃƒÂ±ol:\n--------\nCategoria: Programas\nIdioma: Ingles, EspaÃƒÂ±ol\n\nHa salido el nuevo Wifiway 2.0.3 con un monton de novedades y aplicaciones. Se ha cambiado por completo el aspecto y tiene muchas novedades.\nEl aspecto visual es bonito,pero como no a todo el mundo le tiene\nque gustar,sera opcional,habra un modulo llamado wifiway theme o wifiway style,quitando ese modulo volvereis al apecto tradicional de ventanas azules.\n\nWifiway es un live CD que, basado en el sistema operativo Linux, puede ser ejecutado sin necesidad de instalaciÃƒÂ³n directamente desde el CDROM o tambiÃƒÂ©n desde el disco duro como LiveHD, ademÃƒÂ¡s de poderse instalar en memorias USB o en disco duro. \n\nWifiway es un linux live cd adaptado para el wireless y ademas con soporte internacional. \n\nNo esta basado en debian, mandriva, fedora ni slax, este es un proyecto creado con linuxfromscratch. \n\nEl live cd fue creado con las Linux-live-scripts. \n\nAdemÃƒÂ¡s consta de autologin. \nstartx (para iniciar XWindows) \nautox (para configurar auto XWindows) \n\nNota legal: La utilizaciÃƒÂ³n de este software de anÃƒÂ¡lisis inalÃƒÂ¡mbrico debe ser una herramienta bÃƒÂ¡sica para profesionales y usuarios que, a la larga, conocerÃƒÂ¡n el nivel de seguridad de sus instalaciones inalÃƒÂ¡mbricas. El uso de la misma con otros fines estÃƒÂ¡ totalmente prohibido. \n\n\n* Incluye soporte de los drivers zydas, ipw2200, ipw3945 (ipwraw 2.0 - JMF). \n\n* Wifiway tiene el 99% de su contenido con soporte internacional. \n\n* Configuracion del teclado, ayuda, entorno grafico y el idioma por defecto, durante el arranque del live CD. \n\n* MenÃƒÂº principal en espaÃƒÂ±ol, mientras que el menÃƒÂº interno tiene la posibilidad de eleccion de idioma durante el arranque, Soporte internacional.\n","torrent":{"xt":"urn:btih:5e2d7c7fd71ed01e39bf7db2495ee7e60a8d3628","amp;dn":"Wifiway+2.0.3+alpha1+%5BMULTi%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e2d7c7fd71ed01e39bf7db2495ee7e60a8d3628","infoHashBuffer":{"type":"Buffer","data":[94,45,124,127,215,30,208,30,57,191,125,178,73,94,231,230,10,141,54,40]},"announce":[],"urlList":[]}}