{"title":"Classical Film Violence Designing and Regulating Brutality in Ho","uid":11524678,"size":5265501,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5e6373029e0093780c6774f76500f5fc3030fed2&amp;dn=Classical+Film+Violence+Designing+and+Regulating+Brutality+in+Ho&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zombie_rox","files":1,"time":1416518807,"description":"Stephen Prince has written the first book to examine the interplay between the aesthetics and the censorship of violence in classic Hollywood films from 1930 to 1968, the era of the Production Code, when filmmakers were required to have their scripts approved before they could start production. He explains how Hollywood's filmmakers designed violence in response to the regulations of the Production Code and regional censors. Graphic violence in today's movies actually has its roots in these early films. Hollywood's filmmakers were drawn to violent scenes and &quot;pushed the envelope&quot; of what they could depict by manipulating the Production Code Administration (PCA).\n\nPrince shows that many choices about camera position, editing, and blocking of the action and sound were functional responses by filmmakers to regulatory constraints, necessary for approval from the PCA and then in surviving scrutiny by state and municipal censor boards.\n\nThis book is the first stylistic history of American screen violence that is grounded in industry documentation. Using PCA files, Prince traces the negotiations over violence carried out by filmmakers and officials and shows how the outcome left its traces on picture and sound in the films.\n\nAlmost everything revealed by this research is contrary to what most have believed about Hollywood and film violence. With chapters such as &quot;Throwing the Extra Punch&quot; and &quot;Cruelty, Sadism, and the Horror Film,&quot; this book will become the defining work on classical film violence and its connection to the graphic mayhem of today's movies.\n\nPublisher: Rutgers University Press (October 1, 2003)\nLanguage: English\nISBN-10: 0813532817\nISBN-13: 978-0813532813","torrent":{"xt":"urn:btih:5e6373029e0093780c6774f76500f5fc3030fed2","amp;dn":"Classical+Film+Violence+Designing+and+Regulating+Brutality+in+Ho","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e6373029e0093780c6774f76500f5fc3030fed2","infoHashBuffer":{"type":"Buffer","data":[94,99,115,2,158,0,147,120,12,103,116,247,101,0,245,252,48,48,254,210]},"announce":[],"urlList":[]}}