{"title":"K-Lite Codec Pack Full 4.7.5","uid":4805702,"size":14249858,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5fb31935fc57ee6af71dc3f1255877bb50303d2a&amp;dn=K-Lite+Codec+Pack+Full+4.7.5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"olofolleola4","files":1,"time":1238189458,"description":"Copied from K-Lite Codec Pack Homepage:\n\n\nAbout the K-Lite Codec Pack\n\nThe K-Lite Codec Pack is a collection of DirectShow filters, VFW/ACM codecs, and tools. Codecs and DirectShow filters are needed for encoding and decoding audio and video formats. The K-Lite Codec Pack is designed as a user-friendly solution for playing all your audio and movie files. With the K-Lite Codec Pack you should be able to play all the popular audio and video formats and even several less common formats.\n\nThe K-Lite Codec Pack has a couple of major advantages compared to other codec packs:\n\n*It is updated frequently. So it is always up-to-date with the newest and/or best components.\n\n*All components have been carefully selected for specific purposes.\nIt is not just a random bunch of stuff thrown together.\n\n*It is very user-friendly and easy to use.\n\n*The installation is fully customizable, meaning that you are able to install just those components that you really want.\n\n*The customization abilities even go beyond the component level.\nSome components are able to handle multiple formats.\nYou can specify exactly which components should handle which formats.\nThe pack can thus be fully tweaked to your own specific needs and preferences.\n\n*Uninstallation removes everything that was installed by the pack.\nIncluding all registry keys.\n\n*It is extremely easy to make a fully customized unattended installation with the integrated wizard.\n\n*It does not contain any bad, buggy or unstable codecs.\n\n*It tries to avoid potential conflicts with other codecs installed on your computer. The installation is able to detect and remove over 100 different codec and filter packs.\n\n*The pack is able to detect broken codecs and filters on your system, and helps you to remove them.\n\n*It is a very complete package, containing everything you need to play your movies.\n\n*This pack has a huge user base. This means that problems are found and resolved quickly.\n\n*There are different variants of the pack. From very small to large.\n\n*The pack is suitable for both novice and expert users.\n\n\nVariants\n\nThere are five variants of the K-Lite Codec Pack:\n\nThe basic variant contains everything you need to play all the common video file formats. Such as AVI, MKV, MP4, OGM, and FLV.\nThis pack is for those who like a small no-nonsense pack.\n\nThe standard variant contains some additional features compared to the basic variant. It contains Media Player Classic, which is an excellent player for video files. It also has (better) support for playback of DVDs.\nThis pack is recommended for the average user.\n\nThe full variant has many additional features.\nIt supports playback of several (lossless) audio formats.\nIt contains VFW/ACM codecs that can be used for encoding.\nIt has playback support for a few legacy audio and video formats.\nThis package is suitable for power users.\n\nThe corporate variant is a special version for use in a corporate environment.\nIt is similar to the full variant, minus a few items, but almost just as powerful. It has a strong focus on open source software.\n\nThe mega variant has almost the same contents as the full variant, but additionally contains Real Alternative and some extra VFW/ACM codecs.\n\n\nCompatible with Windows 2000, XP, 2003, Vista, and Seven.\n\n\n\nChangelog\n\n\n4.7.0 to 4.7.5 ~ 2009-03-27\n\n\n* Updated Media Player Classic Homecinema to version 1.2.1008.0\n\n* Updated Media Player Classic to version 6.4.9.1 rev. 99\n\n* Updated ffdshow to revision 2819\n\n* Added x264 encoding plugin for ffdshow\n\n* Updated Cyberlink MPEG-2 decoder to version 8.4.0.205\n\n* Updated MONOGRAM AAC decoder to version 0.9.6.0\n\n* Updated x264VFW to revision 1115\n\n* Updated MediaInfo Lite to version 0.7.12\n\n* Updated Codec Tweak Tool to version 2.5.1\n\n* Minor change\n\n\n4.6.2 to 4.7.0 ~ 2009-02-26\n\n\n* Updated Media Player Classic Homecinema to version 1.2.1005.0\n\n* Updated Media Player Classic to version 6.4.9.1 rev. 98\n\n* Updated ffdshow to revision 2732\n\n* Updated Gabest MPEG splitter to version 1.2.997.0\n\n* Updated Gabest Ogg splitter to version 1.2.997.0\n\n* Updated DirectVobSub to version 2.39.5.1\n\n* Updated x264VFW to revision 1114\n\n* Updated MediaInfo Lite to version 0.7.11\n\n* Fixed small issue with internal filter configuration in MPC\n\n* Fixed file association issue when using regular the version of MPC\n\n* Fixed crash with DVD playback that was present in version 4.6.2\n\n* Minor changes\n\n\n\nComments from the uploader (olofolleola4):\nI've uploaded all the variants here on TPB.\nSo here are the torrents.\n\nBasic:\nhttp://thepiratebay.se/torrent/4805699/K-Lite_Codec_Pack_Basic_4.7.5\n\nStandard:\nhttp://thepiratebay.se/torrent/4805700/K-Lite_Codec_Pack_Standard_4.7.5\n\nFull:\nhttp://thepiratebay.se/torrent/4805702/K-Lite_Codec_Pack_Full_4.7.5\n\nCorporate:\nhttp://thepiratebay.se/torrent/4805705/K-Lite_Codec_Pack_Corporate_4.7.5\n\nMega:\nhttp://thepiratebay.se/torrent/4805703/K-Lite_Mega_Codec_Pack_4.7.5\n\n\nIf you want a 64-bit version of K-Lite Codec Pack, then you have the new 2.2.0 version here: &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/4805821/K-Lite_Codec_Pack_64-bit_2.2.0_x64_(64-bit)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/4805821/K-Lite_Codec_Pack_64-bit_2.2.0_x64_(64-bit)&lt;/a&gt;","torrent":{"xt":"urn:btih:5fb31935fc57ee6af71dc3f1255877bb50303d2a","amp;dn":"K-Lite+Codec+Pack+Full+4.7.5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5fb31935fc57ee6af71dc3f1255877bb50303d2a","infoHashBuffer":{"type":"Buffer","data":[95,179,25,53,252,87,238,106,247,29,195,241,37,88,119,187,80,48,61,42]},"announce":[],"urlList":[]}}