{"title":"Behind the Sun (Christian Movie)","uid":4317767,"size":572981338,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:60a617f5a54cd26045b221497677ccb56b5be6d7&amp;dn=Behind+the+Sun+%28Christian+Movie%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"IndianChristian","files":1,"time":1217187147,"description":"\nOriginal Uploaders Comments:\n\nThis very well produced dramatic film follows the story of Samir Majan, a young man born and raised a Muslim in the Middle East who attended college in America. After receiving a degree from a university in Chicago, he begins his trip back home to see his family. But something has drastically changed in the young man?s life since coming to the States. As his welcoming committee awaits his arrival, the young man?s fear and concern is overwhelming. Samir knows trouble and persecution lie ahead because he has done the unthinkable. Samir has become....a \nChristian.\n\nThis movie details the fear and the troubles that Christians have to undergo in Muslim countries just to follow their religion. Worse is if a Muslim becomes a Christian. Then the entire Christian community is targetted by these scoundrels. Christians living in Christian countries are truly blessed as they have plenty of freedom to follow their religion. But the ones in non-christian ones are not so lucky. Persecution and terror follow them at every stage in their lives. These people truly live the gospel of Christ ... to live is Christ, to die is gain.\n\nKindly Seed for as long as possible.\n\nUploaded by Indian Christian","torrent":{"xt":"urn:btih:60a617f5a54cd26045b221497677ccb56b5be6d7","amp;dn":"Behind+the+Sun+%28Christian+Movie%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60a617f5a54cd26045b221497677ccb56b5be6d7","infoHashBuffer":{"type":"Buffer","data":[96,166,23,245,165,76,210,96,69,178,33,73,118,119,204,181,107,91,230,215]},"announce":[],"urlList":[]}}