{"title":"Stuart Sim - Empires of Belief [2006][A]","uid":10016583,"size":4006056,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:61334672750d17242177c1961cd5ed63bc9513e0&amp;dn=Stuart+Sim+-+Empires+of+Belief+%5B2006%5D%5BA%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Anette14","files":-1,"time":1398153746,"description":"Description\nProduct Details\nBook Title: Empires of Belief: Why We Need More Scepticism and Doubt in the Twenty-First Century\t\nBook Author: Stuart Sim (Author)\nHardcover: 176 pages\nPublisher: Edinburgh University Press (June 25, 2006)\nLanguage: English\nISBN-10: 0748623264\nISBN-13: 978-0748623266\n-----------------------------\nBook Description\nChallenges all forms of fundamentalism and unexamined belief systems from a philosophical and sceptical viewpoint. Is unquestioning belief making a global comeback? The growth of religious fundamentalism seems to suggest so. For the sceptically minded, this is a deeply worrying trend, not just confined to religion. Political, economic, and scientific theories can demand the same unquestioning obedience from the general public. Stuart Sim outlines the history of scepticism in both the Western and Islamic cultural traditions, and from the Enlightenment to postmodernism. Setting out what a sceptical politics might be like, Empires of Belief argues that we need less belief and more doubt: an engaged scepticism to replace the pervasive dogmatism that threatens our democracies.\n-----------------------------\nReview\nIn this vigorous and challenging book Stuart Sim calls for less belief and more doubt in a world that threatens to tear itself apart over competing certainties.\n(Richard Holloway, Former Bishop of Edinburgh)\n-----------------------------\nAbout the Author\nStuart Sim is Professor in the Department of English and Creative Writing at the Northumbria University\n-----------------------------\nMost Helpful Customer Review\nBeyond Beyond\nBy Z Hande on November 7, 2008\nFormat: Hardcover\nThis book is a warning against gullibility, the unquestioning acceptance of beliefs. The author's principal tool was philosophy, and the fine tool within it, skepticism. Scepticism has suffered from ignorance and its off-spring - super-scepticism, and Sim thus patiently retrieved the philosophical material from the history of philosophy to explain what this concept was. He had written with clarity and thoughtfulness; and, as in most things in life, fear subsides when knowledge and understanding emerge. The author's warning began with this passage: &quot;In the current world order we are confronted by an array of what can be called `empires' of belief. These empires - dominant organizations or groups led by the powerful that exercise dominion over ordinary people - are investing an immense amount of time and effort in trying to dictate how we should think, consume, and behave.&quot; The chapters that discussed Darwinism, and politics were especially blunt and unambiguous. Sim's references to skepticism were based on the philosophical definition of the term, broadly stated as &quot;the position which questions the possibility of there being any absolute ground for theories of truth or knowledge or belief&quot; but his central thesis required him to employ a looser definition, and that was to accept skepticism as an argument against authority, allowing the sceptic to have his own beliefs and principles so long as he placed himself under the same obligation to constantly examining them &quot;with the same open mind they do to those of others&quot;.\nSim draws special attention not only to religion and politics but also science as areas in which a dose of skepticism will be intellectually rewarding. The rise and success of evidenced based medicine is an aspect of medical science that Sim thought requires the scrutiny of sceptism. Here was an example of a critic of authority becoming the authority itself. What is left to keep it in check and true is scepticism. When Christians quote the Jesus mantra that &quot;He who does not see and yet believe will be blessed&quot; almost never warn the listener that people who do not see and yet believe are often taken for a ride. He provides clear reasons why one ought to be skeptical, not least of which is that many political systems are &quot;open to manipulation from fundamentalist religious groups that have no real interest in democratic debate or wider participation in political life. Their goal instead is to remove all trace of opposition to their own ideas&quot;. Citing numerous examples, of which the blocking of science based films on evolution at work from being screened in American cinemas, was an example. One viewer was quoted as saying, &quot;I really hate it when the theory of evolution is being presented as fact.&quot;\nSim acknowledged that scepticism also has its limits and is subject to the same tests it subjects belief systems, leading to such unwelcome conclusions as a denial of the Holocaust. Many skeptics stop short of becoming super-sceptics (`if there is an origin then there must be an origin of the origin') by turning to god. Berkeley is an example of using the supernatural as the route of escape from a rigid application of skepticism - Berkeley's skepticism was well analyzed in &quot;Scepticism and the Possibility of Knowledge&quot; by A C Grayling, 2008, Continuum. Sim, however, explained why theology should be taken out of the equation and how the sceptic can and should find its way of coping with relativism; as he said, &quot;divine intervention makes for poor philosophy&quot;.\nSim devoted the entire chapter three to a consideration of super-scepticism, its nature, problems and their solutions. In chapter six he ponders the idea of &quot;reasonable doubt&quot; and its application to religious beliefs. In that chapter he discusses the reliability of religious dogmas and documentation. He sees the irony that a book such as the Bible can be &quot;quoted with such authority, and accepted by so many believers as the unambiguous word of God and his chosen agents, when it is several times removed from its original language.&quot; The problem is compounded when one questions the reliability of the accounts and the story tellers, whose tales are spun with new words and new meanings each time they were repeated. Those were the days before the printing press and faithful reproduction. He noted that &quot;such thoughts rarely cross the mind of the devout, however, who continue to believe their sacred text is a repository of literal truth to be called upon to solve any and all problems that may arise in their lives.&quot;\nSim concluded his book with the view that skepticism is the means to a better world; for one thing, scepticism dampens arrogance for there are &quot;more reasons to doubt what we believe than to treat it as gospel truth&quot;. Before that, the author reminded us that the university, bastion of scepticism, must guard against funding from vested interests because &quot;belief tends to go unquestioned when there are vested interests to placate&quot;. The university is not only to spread knowledge but to scrutinize claims to knowledge.\n","torrent":{"xt":"urn:btih:61334672750d17242177c1961cd5ed63bc9513e0","amp;dn":"Stuart+Sim+-+Empires+of+Belief+%5B2006%5D%5BA%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61334672750d17242177c1961cd5ed63bc9513e0","infoHashBuffer":{"type":"Buffer","data":[97,51,70,114,117,13,23,36,33,119,193,150,28,213,237,99,188,149,19,224]},"announce":[],"urlList":[]}}