{"title":"Euphoria Hard Dance Awards 2009 (TRACKS &amp; MIXES) - (GAVB)","uid":4766791,"size":1311390692,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:631d2bf47beeef6df0099518366116baa5f4e91a&amp;dn=Euphoria+Hard+Dance+Awards+2009+%28TRACKS+%26+MIXES%29+-+%28GAVB%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GAVB","files":2,"time":1236897572,"description":"Mixed By Andy Whitby, Showtek &amp; Ed Real\n\nArtist - Various Artists\nLabel - Euphoria\nGenre - Hard Dance (Classic, Euro, German Trance, Hard House, Hard Trance, Hardstyle, Jumpstyle, NRG, Scouse, Vocal)\nReleased - Sunday, March 8, 2009\nLength - 555:27\nBit rate - 320kbps\n\nFeatured Track:\n41 UNMIXED HARD DANCE ANTHEMS! Plus of course three full length mixes from scene legends Andy Whitby, Showtek and Ed Real. NEARLY 10 HOURS OF TUNES! All the latest and greatest beats from the world of hard house, hardstyle, hard trance, bounce and much more!\n\nDisc O1 - Andy Whitby (Winner Best Resident 2009)\nWhitby's classic blend of bounce, Scouse and hard house has intoxicated the hard dance scene, and it's his position as resident at Frantic that earned him this award, for the second year running. His style crosses over into the euphoria of hardcore and highlights on his disk include collaborations with - and single\ntracks by - Liverpool-based Klubfiller, as well as tracks from legends like Dougal &amp; Gammer, and hard house heroes Amber D and Technikal.\n\nDisc 02 - Showtek (Winner Best DJ &amp; Best Track 2009)\nIn December 2008, Dutch brothers Showtek sold 8,000 tickets to their debut gig in Melbourne, Australia, so it's no wonder they scooped up the prestigious Best DJ and Best Track award (the latter for the second consecutive year). Winning Best DJ has earned the boys a high profile Essential Mix on Radio1, to be aired on 7th March. Residents at Q Dance in Holland they have created a new sound called Hardstyle - an ultra hard, but hyper melodic European rave sound. Their disc is a brutal but melodic 78 minutes of rave euphoria with highlights that include tracks from masters of hardstyle Zany, Southstylers, and Technoboy. The mix also includes their winning track of 2009 'Hold Us Back' and last year's winner 'FTS' (Fuck the System!).\n\nDisc Three - Ed Real (Promoter and host of Hard Dance Awards)\nThe people's choice! Disc three is compiled by votes from 10,000 hard dance fans in this year's awards. Hard house legend Ed Real has mixed 15 compilations already including the Hard House Anthems series for EMI, which took the scene overground in 2001. His disc is all highlights as it represents the people's choice with cuts from awards winners like Alex Kidd, Kidd Kaos, BK and Organ Donors, to cover all the sounds in between the bounce of Whitby and hardstyle of Showtek, to deliver a full thumping three disk product!\n\nbought fresh from here &gt;&gt;&gt; http://www.trackitdown.net/genre/hard_dance/track/905334.html\n\nand uploaded fresh to the piratebay full 320kbps quality\n\nEnjoy and seed ;)","torrent":{"xt":"urn:btih:631d2bf47beeef6df0099518366116baa5f4e91a","amp;dn":"Euphoria+Hard+Dance+Awards+2009+%28TRACKS+%26+MIXES%29+-+%28GAVB%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"631d2bf47beeef6df0099518366116baa5f4e91a","infoHashBuffer":{"type":"Buffer","data":[99,29,43,244,123,238,239,109,240,9,149,24,54,97,22,186,165,244,233,26]},"announce":[],"urlList":[]}}