{"title":"GÃƒÂ¸dland","uid":4771911,"size":399671525,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:631f330fa58e3da8a9c3ca094b211255e4309a1a&amp;dn=G%C3%83%C2%B8dland&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gilgamesh07","files":26,"time":1237069593,"description":"Ladies and Gentlemen, by request from the forums this torrent contains issues 1-25 of Image Comic's GÃƒÂ¸dland series.\n\nGÃƒÂ¸dland is an American comic book series by Joe Casey and Tom Scioli, published by Image Comics since 2005.\n\nThe main character of the series is astronaut Adam Archer. As the sole survivor of an ill-fated journey to Mars, Adam Archer meets the alien entities known as the Cosmic Fetus Collective, who transform him into a cosmic being and instruct him in the uses of his new powers. Archer is sent back to Earth as the first human to be touched by universal enlightenment.\n\nThe series starts four years later. Archer has become a famous superhero, but is distrusted by government and the public. The military have provided him with a base, Infinity Tower, from where Archer and his three sisters, Neela, Angie and Stella, protect the Earth from the invasion of robot zombies. Neela, an astronaut and military commander, resents that her brother's powers overshadow her own talents and that she is forced to keep an eye on him instead of pursuing her own career. Angie, a fighter pilot, is a rebellious spirit, while Stella, who oversees communication with her brother, is clear-headed and rational.\n\nOn his adventures, Adam comes into conflict with many bizarre supervillains like Basil Cronus, a floating skull in jar on a quest for the ultimate high, Friedrich Nickelhead, Discordia and her father the Tormentor and his army of Superman-Mice.\nOn his first adventure, Adam saves the giant, dog-like alien Maxim, who turns out to know about the Cosmic Fetus Collective. Maxim was enhanced by his own species and sent to Earth to contact Archer and prepare him for his destiny. He is rather disappointed with the human race though, who are further from enlightenment than he would have hoped. Nevertheless he is fully committed to his task as a mentor to Adam.\n\nThere is a space-god named Iboga who plays an important part in the series cosmology.\nNeela has left her family and joined up with a private consortium who want to fly to the stars. Villainess Discordia's head exploded during her trial, but Nickelhead has sent his servant to collect her body.\n\nAdam has saved the world from an alien invasion, only to be met with distrust and lawsuits. Archer has become annoyed with humanity's distrust of him and their worship of superhero Crashman, but Maxim is about to show him more about his origin.\n\nPublication history\n\nThe series was conceived as both a homage to and a revival of the Cosmic Superhero Epic as told by many great comic writers of the 1970s like Steve Engelhart, Jim Starlin and Jack Kirby. The style of the series is strongly inspired by Kirby's style in his Eternals and The Fourth World series. While obviously strongly inspired by this series, Casey and Scioli add their own twist on the stories with a little humor.\n\nIt was announced in the solicitations for issue #25 that the series would end with issue #36, which Scioli attributed to sales, although Casey suggested the end point and reasons were less clear-cut:\n \n&quot;Coming to a natural conclusion has nothing to do with sales or any other outside factors. Eventually, the monthly series will end and Adam's story will reach its climactic conclusion in a dramatic and satisfying way, and to have that end point to work toward is simply good storytelling. And despite what the solicitation for #25 states, I never said that the last issue was definitively #36. As we get closer to that climax, Tom and I together will determine how and when we'll wrap it up, and which issue we'll be wrapping it up in. \n\nHaving said that, I see the whole thing as more of a transition. I just can't see the end of the monthly series being the end of all things GÃƒÂ¸dland.&quot;\t \n\nThanks to the scanners and the original sources who wish to remain nameless.\n\nPlease seed. Please enjoy.","torrent":{"xt":"urn:btih:631f330fa58e3da8a9c3ca094b211255e4309a1a","amp;dn":"G%C3%83%C2%B8dland","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"631f330fa58e3da8a9c3ca094b211255e4309a1a","infoHashBuffer":{"type":"Buffer","data":[99,31,51,15,165,142,61,168,169,195,202,9,75,33,18,85,228,48,154,26]},"announce":[],"urlList":[]}}