{"title":"[Helena Dodziuk]Introduction to Supramolecular Chemistry(pdf){Zz","uid":11220295,"size":18040288,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:63e327744ccb56b5d4e2c1c0b118e2ad2b8a9e88&amp;dn=%5BHelena+Dodziuk%5DIntroduction+to+Supramolecular+Chemistry%28pdf%29%7BZz&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zombie_rox","files":1,"time":1413373602,"description":"A new rapidly progressing field on the crossroads among chemistry, biochemistry, physics and technology - supramolecular chemistry - has just emerged. You have to be involved, to know what's going on in this domain and to take part in the development. This book will show you in a condensed form exciting phenomena unthinkable within the realm of classical organic chemistry (for example, alkali metal anions or cyclobutadiene stable for month at room temperature) that not only provide the basis for revolutionizing numerous branches of industry but also improve our understanding of the functioning of living organisms and of the origin of life. Designing supramolecular systems with desired properties will among others make chemical industry cleaner and more safe, electronics smaller by developing devices composed of single molecule or molecular aggregate. It will also entirely change the way we use energy resources. In addition, it will also transform the pharmaceutical industry and medicine by developing new ways of drugs administration and new composite biocompatible materials which will serve as implants of new generation changing dentistry, surgery, and other branches of medicine. You cannot afford to stand apart.\nWith its brief but comprehensive and vivid presentation including the latest development, Introduction to Supramolecular Chemistry is the best method to get into this domain. This book provides an excellent summary of information scattered across the literature. The brief but comprehensive coverage of the whole field including practically all important group of compounds forming aggregates (in particular crown ethers, cavitands, fullerenes, cyclodextrins and their complexes) provisioning full references for the discussed subjects make this book of value not only for Ph.D. students and non-specialists in this domain but also for those working in the field. The book has been found to be a particularly useful resource for students and more generally for those wanting to get the up-to-date concise account of this exciting field. \n\nPublisher: Springer; Softcover reprint of the original 1st ed. 2002 edition (October 4, 2013)\nLanguage: English\nISBN-10: 904815913X\nISBN-13: 978-9048159130\n\nEditorial Reviews\nReview\n'A major strength of this work is its inclusion of literally hundreds of clearly drawn structures and diagrams to assist reader understanding of this complex area. In addition, the author has included hundreds of up-to-date references. It also has a useful and extensive index. The book is valuable not only to those working in the field of supramolecular chemistry, but also to chemists in unrelated areas of research who want a refreshingly well-written monograph on an emerging area of important research.'\nH.T. McKone, Saint Joseph College in Choice, September 2002","torrent":{"xt":"urn:btih:63e327744ccb56b5d4e2c1c0b118e2ad2b8a9e88","amp;dn":"%5BHelena+Dodziuk%5DIntroduction+to+Supramolecular+Chemistry%28pdf%29%7BZz","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"63e327744ccb56b5d4e2c1c0b118e2ad2b8a9e88","infoHashBuffer":{"type":"Buffer","data":[99,227,39,116,76,203,86,181,212,226,193,192,177,24,226,173,43,138,158,136]},"announce":[],"urlList":[]}}