{"title":"Family Guy S11E11","uid":8074319,"size":72577678,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:65306d5f7181eb985197231856adee914d5261da&amp;dn=Family+Guy+S11E11&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Angertek","files":-1,"time":1359345854,"description":"Season: 11 Episode: 11 \nTotal Episode Count: 199 \nFirst Aired: January 27, 2013 \n\n\nPlot: ( Spoiler ALERT! )\n\nWhen Peter discovers Joe has a student ID he took from a kid that gave him lip, Peter, Quagmire and Joe visit the Harvard University campus for lunch and have a wild night on the town, a drunken Quagmire accidentally marries a prostitute named Charmisse. She refuses to let go of their relationship and Quagmires starts to consider divorce until Joe points out that he could lose everything. Quagmire tries to make the best of it but Charmisse can't pull herself far enough out of the gutter for his tastes. When he is reluctant to pursue their relationship, she questions if he is gay and when she says the marriage would be over if true, Glenn gets the idea to pretend to be gay and she starts to leave, but catches him in the act of watching straight porn and demands he prove he is gay by having sex with a man.\n\nQuagmire approaches Peter with the idea and Peter agrees provided they have a date first which Glenn suffers through. Back at Quagmire's house, Charmisse insists they get on with the sex and the guys clumsily and reluctantly prepare. Just as they almost consummate their act, Charmisse calls off the charade, noting that it is obvious that they are straight but if Quagmire wants a divorce that badly she'll grant him one and appreciated Quagmire treating her decent. After Charmisse leaves, a nearly naked Peter and Quagmire embrace in relief as Peter suddenly noted the camera on Quagmire's laptop is on and back the Griffin home the family watches in horror. ","torrent":{"xt":"urn:btih:65306d5f7181eb985197231856adee914d5261da","amp;dn":"Family+Guy+S11E11","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"65306d5f7181eb985197231856adee914d5261da","infoHashBuffer":{"type":"Buffer","data":[101,48,109,95,113,129,235,152,81,151,35,24,86,173,238,145,77,82,97,218]},"announce":[],"urlList":[]}}