{"title":"Die Hard [1988] DVD9 PAL ENG GER","uid":9932620,"size":7181492224,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:654dd025a96fe9a1ca3bbd72153f6372f618e38a&amp;dn=Die+Hard+%5B1988%5D+DVD9+PAL+ENG+GER&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1397121473,"description":"audio: english,german DTS\n\nsubs: english,german\n\n\n\n\n\nDie Hard is a 1988 American action film directed by John McTiernan and written by Steven E. de Souza and Jeb Stuart, based on the 1979 novel Nothing Lasts Forever by Roderick Thorp. Die Hard follows off-duty New York City Police Department officer John McClane (Bruce Willis) as he takes on a group of highly organized criminals led by Hans Gruber (Alan Rickman), who perform a heist in a Los Angeles skyscraper under the guise of a terrorist attack using hostages, including McClane's wife Holly (Bonnie Bedelia), to keep the police at bay.\n\nDie Hard is based on Nothing Lasts Forever, the sequel to Thorp's 1966 novel The Detective, which itself had been adapted into a 1968 film of the same name starring Frank Sinatra. Fox was contractually obligated to offer Sinatra the lead role in Die Hard, but he turned it down and the film was instead pitched as a sequel to the 1985 action film Commando starring Arnold Schwarzenegger. When Schwarzenegger also turned it down, the film was pitched to, and rejected by, a host of the era's action stars before Willis was chosen. The studio did not have faith in Willis' action star appeal, as at the time he was known for his comedic role on television.","torrent":{"xt":"urn:btih:654dd025a96fe9a1ca3bbd72153f6372f618e38a","amp;dn":"Die+Hard+%5B1988%5D+DVD9+PAL+ENG+GER","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"654dd025a96fe9a1ca3bbd72153f6372f618e38a","infoHashBuffer":{"type":"Buffer","data":[101,77,208,37,169,111,233,161,202,59,189,114,21,63,99,114,246,24,227,138]},"announce":[],"urlList":[]}}