{"title":"Top Gear Southern Counties Radio Show","uid":7079243,"size":144488451,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:6732ade88186950ec0246ceae0a69b6911d095d3&amp;dn=Top+Gear+Southern+Counties+Radio+Show&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"czfxp","files":1,"time":1330966743,"description":"Clarkson was persuaded by fellow BBC TWO Top Gear presenter Richard Hammond to take to the airwaves and present the drivetime show for BBC Southern Counties Radio.\n \nAnd along with James May they spent three hours yesterday (Wednesday 26 April 2006) entertaining the audience in Surrey and Sussex from the station's Brighton studios.\n \nClarkson and Hammond took calls from the public for a phone in, wrote headlines - though Clarkson's 'Cliff Richard taken by bat' and 'Brighton pier turned into solid gold' did not make the bulletin - while May was immortalised in a jingle.\n \nClarkson said he joined up because he had never liked the travel news on radio and always thought he could do better.\n \n&quot;But I've come down here and found I can't! I thought you came and talked and when you ran out of things to say you put music on. It's not. We've made a real Horlicks of it,&quot; he said.\n \nHammond, who once manned the lamb adoption lines for BBC Radio Cumbria, had a head start in radio.\n \nBut he admitted it was much harder than he remembered it, and proved it by pressing buttons which played a Thin Lizzy track a dozen times an hour, and sometimes cut the sound altogether.\n \nTheir antics did win over the majority of the audience, though their performance was probably best summed up by caller Peter from Chichester - &quot;I'm enjoying the show, but I wouldn't want it every day.&quot;","torrent":{"xt":"urn:btih:6732ade88186950ec0246ceae0a69b6911d095d3","amp;dn":"Top+Gear+Southern+Counties+Radio+Show","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6732ade88186950ec0246ceae0a69b6911d095d3","infoHashBuffer":{"type":"Buffer","data":[103,50,173,232,129,134,149,14,192,36,108,234,224,166,155,105,17,208,149,211]},"announce":[],"urlList":[]}}