{"title":"Ultimate General Gettysburg v0.86 cracked","uid":10768974,"size":350660139,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6763acf0179e0151c9005d028ef5323b983e9e61&amp;dn=Ultimate+General+Gettysburg+v0.86+cracked&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Nimbleton","files":-1,"time":1408059556,"description":"Ultimate General Gettysburg v0.86 cracked\n\nExtract 7zip &amp; launch game with Ultimate General GettysburgLauncher.exe\n\nNEW FEATURES\n- Limited Multiplayer Functionality: When you launch the game you have the option to use the Multiplayer version. In two special multiplayer scenarios you can battle against your friends or other opponents. Multiplayer is not stable yet. We need your feedback about issues you may anticipate.\n\n- After Battle Statistics: You can now review the units performance after a battle. By default, the statistics list includes all the units for both armies sorted by number of kills. You can also sort by other categories and filter according to unit type.\n\n- Full Order of Battle: Before a battle you can review the armies organization of the units that will participate in the engagement. After a battle you have the option to review the full army for both sides including info such as casualties, morale, condition etc.\n\n- Decision Maps: You finally can see a map that will describe the available strategic decisions after a battle (There are 17 errors of Unavailable maps which we will fix in next patch).\n\nGAMEPLAY IMPROVEMENTS\n- Various AI improvements according to forum feedback. AI will be most active and responsive than ever.\n- Slight US/CS combat balances.\n- Artillery targeting tweaks.\n- Duration of battle increased for several Day 1 / Phase 2 scenarios.\n- Charge/Chase duration is now less. Units can no longer chase too far away their targets and isolate themselves.\n- Melee slight rebalance.\n- Pettigrew slight rebalance to be a little more effective in long range combat.\n- Final battle outcome has now better result calculations, based more on casualties.\n- Fatigue balances to make slow and defensive maneuvers more rewarding.\n- Balanced Victory points of 3rd day battle (in preparation for the 4th day).\n\nTEXT/CAMPAIGN BATTLE FLOW\n- Minor fixes in texts.\n- Some Battle Flow fixes.\n\nBUG FIXES\n- Fixed retreat freezing bug. In previous version it was possible to see units freeze in borders after a retreat with running animation.\n- Fixed another freeze bug that could happen when reinforcements were stuck at borders of the map.\n- Fixed problems that could result in wrong retreat paths. Full solution will arrive after a melee bug fix.\n- Fixed an AI issue of moving its units without seeing and reacting to close by bigger threats (Zombie effect). The issue is not fully solved but is much less frequent.\n- Fixed map not scrolling enough to the south.\n- Fixed resurrection of units in next battle after being totally destroyed.","torrent":{"xt":"urn:btih:6763acf0179e0151c9005d028ef5323b983e9e61","amp;dn":"Ultimate+General+Gettysburg+v0.86+cracked","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6763acf0179e0151c9005d028ef5323b983e9e61","infoHashBuffer":{"type":"Buffer","data":[103,99,172,240,23,158,1,81,201,0,93,2,142,245,50,59,152,62,158,97]},"announce":[],"urlList":[]}}