{"title":"Time Team - Season 04 (1997) - 6 Episodes","uid":8653646,"size":1891828134,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:67d688cd5dd02695839651914cca01b641f20db9&amp;dn=Time+Team+-+Season+04+%281997%29+-+6+Episodes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":4,"uploader":"bnaron","files":7,"time":1373163071,"description":"Time Team - Season 04 (1997) - 6 Episodes\n\nTime Team is back in action for a fourth run. Mick Aston, Professor in Archaeology at Bristol University and presenter Tony Robinson help solve six new challenges in a battle against the clock.\n\nAmong the sites of interest are a potential 13th century leper hospital in Cornwall, mysterious stones in a Glasgow graveyard and one of the most precious sites in English heritage - Malton in North Yorkshire.\n\nS04E01 - St Mary's City, Maryland USA - (1997) - Time Team - UK-Ch-4\n\n         The series begins with an unusual transatlantic departure when Time Team follow in the footsteps of some of the first English settlers in America. The journey takes them to the historic landing site of St Mary's City, Maryland, where they join American experts to unearth some important finds and challenge some of their original theories.\n\nS04E02 - Launceston, Cornwall - (1997) - Time Team - UK-Ch-4\n\n         Channel 4's archaeology-as-it-happens programme attempts to solve the secret history of a female skeleton found in Launceston, Cornwall.\n\n         In atrocious weather conditions, the team, try to determine if she was a leper from a 13th century colony, a casualty of the Civil War, a plague victim or put to death after being tried at the Launceston Assizes in the late I6th or early 17th century. After a thorough investigation, the team reach a conclusion and the body is then reburied in the consecrated ground of Launceston church.\n\nS04E03 - Soho, Birmingham - (1997) - Time Team - UK-Ch-4\n\n         Birmingham residents get an on-the-doorstep lesson in archaeology when Tony Robinson and Mick Aston call in the experts to try and locate one of the most important sites in the history of the Industrial Revolution - Matthew Boulton's 18th century mint.\n\n         But the task to find the site of the largest coin presser in the world isn't an easy one - given that it is buried beneath the houses and gardens of Soho, Handsworth. But curious to know what lies under their patios, gardens and glass houses, locals are only to willing to give Time Team permission to begin the three day dig in a race against the clock. They even invite them to a street party!\n\nS04E04 - Govan, Glasgow - (1997) - Time Team - UK-Ch-4\n\n         Tony Robinson and the Time Team face a fascinating conundrum that sends them spinning back into the dark ages of Scottish history. Their location is Govan, on the banks of the River Clyde, where several intriguing stone sculptures have been discovered in the graveyard of the parish church.\n\n         The 19th century minister unearthed no less than 30 of these large, intricately carved gravestones in two distinct styles, and the present incumbent, Rev Tom Davidson Kelly, has set the Team a challenge, to find out who was buried here, by whom, and why.\n\nS04E05 - Malton, North Yorkshire - (1997) - Time Team - UK-Ch-4\n\n         The intrepid archaeological treasure hunters, led by Tony Robinson, head for Malton in North Yorkshire where a swathe of nettle-infested jungle conceals 2,000 years of English history including a Roman fort.\n\n         The land is about to be turned into a park and the Time Team have been asked to uncover the area's other secrets, specifically a medieval castle and a Jacobean or possibly Tudor manor house. But with English Heritage breathing down their necks and a limit of five trenches they can dig, it could turn out to be their toughest assignment ever.\n\nS04E06 - Netheravon, Wiltshire - (1997) - Time Team - UK-Ch-4\n\n         For their final high-speed archaeological adventure of the series. Time Team find themselves inside a partially abandoned army barracks in Nethcravon in Wiltshire. It's not military memorabilia they're after but something much older and more interesting.\n\n         In 1907, a Colonel Hawley discovered part of a tessellated pavement - or mosaic - in the grounds which he believed was part of a Roman villa, built around AD 300.\n\n         Now for the first time the army have allowed archaeologists inside the barbed wire to check out the colonel's theory. They have only a few short months before the troops return and the site is once again off-limits to civilians. Tony Robinson, Mick Aston and the Time Team however, have just three short days!\n","torrent":{"xt":"urn:btih:67d688cd5dd02695839651914cca01b641f20db9","amp;dn":"Time+Team+-+Season+04+%281997%29+-+6+Episodes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67d688cd5dd02695839651914cca01b641f20db9","infoHashBuffer":{"type":"Buffer","data":[103,214,136,205,93,208,38,149,131,150,81,145,76,202,1,182,65,242,13,185]},"announce":[],"urlList":[]}}