{"title":"Shuriken School The Ninja's Secret (2007) 480p WEB-DL","uid":10594380,"size":924529404,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6839c42f95329ff889e82ccc28a48d2a19faf1dc&amp;dn=Shuriken+School+The+Ninja%27s+Secret+%282007%29+480p+WEB-DL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"apach1887","files":-1,"time":1405848796,"description":"Summer break, at last! But there is no rest for Eizan, Jimmy and Okuni! When Eizan's father gets kidnapped by some mysterious ninjas, our three courageous heroes set out on a rescue mission, putting into practise techniques learned during their first year at Shuriken School. They discover the existence of the Jade Shuriken, a precious object and renowned symbol of extreme Ninja power, which was stolen three hundred years ago from... Eizan's ancestor! And since that very day, a decree has been laid down - the Ninja Council, a secret organization, forbids any member of the Kaburagi family to become a ninja. If Eizan wants to stay at Shuriken School and pursue his dream of becoming a ninja, he has no choice but to find the Jade Shuriken, and of course the renegade ninjas who kidnapped his father are continually on the chase! With Pig's musical and pugilistic help, our three heroes manage to find the object and prove the innocence of Eizan's ancestor. Will they convince the Ninja Council to clear the Kaburagi family name and allow Eizan to be a Ninja? It's not that obvious... The Great Kaburagi's heir will have to show what he's worth, facing enemies of great cunning, malice and duplicity. Can Eizan survive the trials set before him?\n\nVideo: MPEG4 Video (H264) 640x480 23.976fps [V: English [eng] (h264 constrained baseline L3.0, yuv420p, 640x480) [default]]\nAudio: AAC 44100Hz stereo [A: English [eng] (aac, 44100 Hz, stereo) [default]]\nSubtitle: UTF-8 [S: CC [eng] (subrip) [default]]\n\nApparently, they will also release series in August 2014. If I find it, I'll rip it too","torrent":{"xt":"urn:btih:6839c42f95329ff889e82ccc28a48d2a19faf1dc","amp;dn":"Shuriken+School+The+Ninja%27s+Secret+%282007%29+480p+WEB-DL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6839c42f95329ff889e82ccc28a48d2a19faf1dc","infoHashBuffer":{"type":"Buffer","data":[104,57,196,47,149,50,159,248,137,232,44,204,40,164,141,42,25,250,241,220]},"announce":[],"urlList":[]}}