{"title":"Xposed installer Version 2.4.1 (Rooted Phones Only)","uid":9394503,"size":543253,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:6874803dd2e17ef3171e1a6c7c1f31b3f04e28ec&amp;dn=Xposed+installer+Version+2.4.1+%28Rooted+Phones+Only%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"allrockedout","files":-1,"time":1387953239,"description":"\nThis is for Stock Roms or Custom Rom. Must Be rooted.\n\n\n\n\nThe Xposed framework is a major boon to those of us who use an Android device that doesn't have a lot of support from the custom ROM community. It allows a lot of the things you want in custom ROMs - visual tweaks, interface changes, behavioral and button functions, fixes for annoying bugs, and a host of other things - via independent modules, with only root privileges. The latest beta release from developer &quot;Rovo89&quot; includes support for Android 4.4 and a bevy of performance improvements.\n\nXposed is definitely in the deep end of the Android modification pool, so there are a few things that aren't quite perfect in version 2.4B1. Naturally and unavoidably, Xposed modules that make changes to portions of Android that have been updated in KitKat, like the battery notification icon, won't work properly on a 4.4 device. This will have to be addressed by the module creators themselves. Also note that Xposed has a tendency towards unpredictable side effects, so make a backup of your rooted device (or get to know your friendly neighborhood Safe Mode) before activating any complex modules.\nThe developer claims that the app's performance has been dramatically improved, especially on older devices: one tester with a Galaxy S2 saw an improvement of approximately 500%. The new version of Xposed also has a debug.log viewer, which should give module developers and advanced users a better chance to see whether a particular module will work or not. Users can also save the log to the SD card (external or internal) for viewing later. Finally, Xposed now checks for the latest version and warns users if it's not installed.","torrent":{"xt":"urn:btih:6874803dd2e17ef3171e1a6c7c1f31b3f04e28ec","amp;dn":"Xposed+installer+Version+2.4.1+%28Rooted+Phones+Only%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6874803dd2e17ef3171e1a6c7c1f31b3f04e28ec","infoHashBuffer":{"type":"Buffer","data":[104,116,128,61,210,225,126,243,23,30,26,108,124,31,49,179,240,78,40,236]},"announce":[],"urlList":[]}}