{"title":"Mo-Do - Eins, zwei, polizei - unofficial bootleg album 1994","uid":5637961,"size":180301531,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:68ff9bb3250a7ca37f01b4da38371240374b38a9&amp;dn=Mo-Do+-+Eins%2C+zwei%2C+polizei+-+unofficial+bootleg+album+1994&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"Mo-Do","files":26,"time":1276965649,"description":"There was an album released (media casette format) back in end of 1994 in Lithuania, Russia and perhaps other eastern European countries entitled &quot;Mo-Do - Eins, zwei, policei&quot; (note the C in policei, not Z). I think this album was not officially released since it is not mentioned in any articles regarding Mo-Do (for instance http://en.wikipedia.org/wiki/Mo-Do).\n\nAfter doing some research in 2007 I found out that on that very casette the only song which is truly made by Mo-Do is the &quot;Eins, zwei, polizei&quot; (original mix and polizei mix) and the remaining songs are done by absolutely different artists whom were given no credit on the MC's cover.\n\nSince then I searched the internet every now and then in order to identify the true artists who made the remaining songs and I finally succeeded yesterday. I've managed to download most of these songs and release what happens to be a &quot;compilation-album&quot;. Though I was unable to find a correct mix of one song and did not find a decent quality of another song. All other songs have pretty decent quality.\n\nPlease, if any of you happen to have these songs in a lossless or better mp3 quality format then I've uploaded, I beg you to PM me and share it!\n\nIn this torrent I've included the whole album which is a MC-rip of the original casette that I've bought in 1994 with songs named as they were on the casette cover AND I've included the whole album (minus two songs which I couldn't find in acceptable quality) which I downloaded from various sources AND I included two bonus songs which are mixes of songs included in the album. I've also included two covers of MC casettes and some additional photos of the MC.\n\nTracklist:\n\nMC-rip\n\n[01] Mo-Do - Eins, zwei, polizei (new remix)\n[02] Mo-Do - Sexy danza\n[03] Mo-Do - Amar\n[04] Mo-Do - Anastais\n[05] Mo-Do - Navajo\n[06] Mo-Do - Power up\n[07] Mo-Do - Eins, zwei, polizei (original mix)\n[08] Mo-Do - Muchacha (cecureto mix)\n\nBetter quality:\n\n[01] Mo-Do - Eins, zwei, polizei (Polizei mix)\n[02] Einstein Dr. Dj - Automatic sex (Independent mix)\n[03] Insane - Amar (Majella club mix)\n[04] Mass Media - Anastasis (Cover mix)\n[05] Nostradamus 2 - Navajo (Ipnotic sint) (poor quality)\n[06] Techno G. feat. Monier - Power up\n[07] Mo-Do - Eins, zwei, polizei (Original radio mix)\n[08] Certuo - Muchacha (cecureto mix) - MISSING\n\nBonus:\n\nCertuo - Muchacha\nEinstein Dr. Dj - Automatic sex (Germany mix)\nMass Media - Anastasis\n\nPLEASE IF YOU HAVE THESE SONGS MENTIONED IN &quot;BETTER QUALITY&quot; LIST IN LOSSLESS OR 320 kbps - SHARE IT, PM ME or EMAIL ME AT ISIUKSLINE [ ETA ] GMAIL [ DOT ] COM!\n\nI hope you enjoyed my work!","torrent":{"xt":"urn:btih:68ff9bb3250a7ca37f01b4da38371240374b38a9","amp;dn":"Mo-Do+-+Eins%2C+zwei%2C+polizei+-+unofficial+bootleg+album+1994","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68ff9bb3250a7ca37f01b4da38371240374b38a9","infoHashBuffer":{"type":"Buffer","data":[104,255,155,179,37,10,124,163,127,1,180,218,56,55,18,64,55,75,56,169]},"announce":[],"urlList":[]}}