{"title":"Guild of Dungeoneering (Update 10 Inclu DLC)","uid":12786760,"size":721554410,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:69105f0d6b0ab07d3ca9419bea7fdb96a73b7e67&amp;dn=Guild+of+Dungeoneering+%28Update+10+Inclu+DLC%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dauphong","files":1,"time":1447873486,"description":"About This Game\r\nBecome the ultimate Dungeon Master as you bribe, entice and coax your heroes through their adventures on a quest to restore your guild to its ultimate glory!\r\nGuild of Dungeoneering is a turn-based dungeon crawler with a twist: instead of controlling the hero you build the dungeon around him. Using cards drawn from your Guild decks, you lay down rooms, monsters, traps and of course loot! Meanwhile your hero is making his own decisions on where to go and what to fight. But will he be strong enough to take on the dungeon's overlord? In between dungeon runs you manage your Guild, building new rooms to attract new classes of adventurer and to expand your decks of cards with more powerful items and events.\r\n\r\nFeatures\r\n• Restore your guild to its former glory as Dungeon Master by taking control of your fledgling group of heroes and leading them to victory! (after admitting to a few defeats of course)\r\n\r\n• Entice, coax and bribe your heroes to clear the dungeons you build by strategically placing rooms, monsters and loot from the cards you are dealt\r\n\r\n• Get to know each of your hero’s personality and traits, upgrade your existing heroes, and add new heroes while you try out new strategies to keep from sending them to their doom!\r\n\r\n• Manage your guild well and spend your hard earned ‘glory’ wisely to level up and unlock more rooms and equipment. Improving your guild means you’ll have a better chance at beating the harder dungeons as you progress and take down the ultimate dungeon overlord.\r\n\r\n• Game is currently locked at 30 FPS and we want to ensure you are aware of this prior to purchasing","torrent":{"xt":"urn:btih:69105f0d6b0ab07d3ca9419bea7fdb96a73b7e67","amp;dn":"Guild+of+Dungeoneering+%28Update+10+Inclu+DLC%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69105f0d6b0ab07d3ca9419bea7fdb96a73b7e67","infoHashBuffer":{"type":"Buffer","data":[105,16,95,13,107,10,176,125,60,169,65,155,234,127,219,150,167,59,126,103]},"announce":[],"urlList":[]}}