{"title":"Rain-Stronger-Promo-2006","uid":3586633,"size":75596098,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:69b7ed82f33528ab69f63bdcb976c397baeb96ea&amp;dn=Rain-Stronger-Promo-2006&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"PoisonI","files":14,"time":1167518523,"description":"Artist: Rain\nAlbum: Stronger\nLabel: MTM\nStyle: Hard Rock\nGrabber: EAC\nEncoder: LAME\nQuality: VBRkbps/44,1kHz\nReldate: 10-20-2006\nStreet: 11-10-2006\nSongs: 11\nSize: 72MB\n\nTracks:\n\n01. Do you like it                                     \n02. Insobriety                                         \n03. Get over it                                       \n04. Crazy                                              \n05. Die for you                                        \n06. Flesh and blood                                    \n07. Let me be your favorite                            \n08. The other side                                     \n09. Deserve                                           \n10. Right by your side                                \n11. Lovesong\n\nLine-Up:\nMichael Bormann: Vox, Bass, Keyboards\nPer Helge &quot;Peppa&quot; Bruvoll: Drums, Backingvox\nLars Forseth: Guitars, Backingvox\nTore Moren: Leadguitar, Backingvox\n\nRelease notes: RAIN was founded in 1997 as a result of a project started by Lars Forseth and Sonny Crow from the band Bankok Babes. They were soon joined by the Bangkok Babes drummer Per-Helge &quot;Peppa&quot; Bruvoll, and guitarist Tore Moren from Jorn, Arcturus and Carnivora among others. They looked around for a vocalist for some time without luck. Lars then went on a holiday to Rhodes to relax his soul. In the biggest live venue in Rhodes city, the Colorado Club, he saw and heard Michael Bormann (Jaded Heart, Bonfire, J.R. Blackmore, Zeno, etc.) perform some numbers that caught his im-mediate attention. The chemistry between Michael and the other guys was a sure thing from the first minute.\n\nThey were now joined by bass player Audun Norgaard. The boys had built up a strong set of own songs and cover songs, and was ready to meet the public.\n\nThe first gig they played together was at the legendary &quot;Smuget&quot; in Oslo in December 99. The following year RAIN played several concerts in the southern part of Norway and did studio recordings for the first album.\n\nIt was a busy time for all involved; Michael had his own band Jaded Heart, productions and other projects to take care of. Peppa was playing with different cover bands and went back and forth to USA to train as a commercial pilot. Tore, a renowned guitarist in Norway, was busy on multiple projects. Lars was writing songs for the forthcoming album with Sonny Crow, and Audun was keeping busy with his side project, Jet Surfers.\n\nThe band finally released their first album on the American label Kivel Records, titled &quot;House of dreams&quot;, in 2002 and got great reviews.\n\nOver the next two years they continued to play concerts in Norway and had several shows at Smuget in Oslo. Audun, the country soul that he is, decided in 2004 to leave RAIN and devote his time to his roots band Jet Surfers. RAIN was back to it&amp;#039;s original four members; Michael Borman, Tore Moren, Lars Forseth and Peppa Bruvoll and has since then hired bass players when performing live sets.\n\nIn March 2005 they played &quot;Rock the Boat&quot; in Oslo with bands like Return and Stage Dolls.\n\nThe recordings for their second album took place in Michael Bormann&amp;#039;s studio in Duisburg, Germany in 2005. The album is now being released by MTM MUSIC for the territory of Europe and in Japan by JVC/Victor. &quot;Stronger&quot; is a pure AOR Hardrock album and Michael Bormann continues with this great band where he stopped after the JADED HEART &quot;IV&quot; album.\n\nEnjoy and please seed.","torrent":{"xt":"urn:btih:69b7ed82f33528ab69f63bdcb976c397baeb96ea","amp;dn":"Rain-Stronger-Promo-2006","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69b7ed82f33528ab69f63bdcb976c397baeb96ea","infoHashBuffer":{"type":"Buffer","data":[105,183,237,130,243,53,40,171,105,246,59,220,185,118,195,151,186,235,150,234]},"announce":[],"urlList":[]}}