{"title":"Network Marketing Training - Eddy Chai in Mumbai (Video)","uid":5771085,"size":1387428455,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:6ce109df03e63cd3cf67f955d0cd5e654f6789a5&amp;dn=Network+Marketing+Training+-+Eddy+Chai+in+Mumbai+%28Video%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"DCLXVI","files":3,"time":1282113015,"description":"Eddy Chai in Mumbai\n\nEddy Chai is one of the most experienced and top-earning personalities in the MLM industry.\n\nHe was initially a small business owner, then he started his MLM career with Amway and was quite successful there. Later he shifted with Forever Living Products (FLP) when the company started its operations in Taiwan. During his association with FLP between 1987-2007, Eddy reached the pinnacle of success in his career as he helped his team expand to over 20 countries. He also went on to become the Managing Director of FLP-Taiwan.\n\nDuring his career with Forever, Eddy designed and conducted several valuable seminars focused on the business-aspect of the company. It was here that his reputation as a powerful speaker gained popularity. His liberal use of humour and anecdotes during his seminars brought home the point to the audience while entertaining them at the same time. His strong body language has been inspiration to many speakers in the company. Like all powerful &amp; original speakers, Eddy has never used the aid of a teleprompter for any of his stage appearances.\n\nIn 2008 Eddy ventured to start his own MLM company Diamond Lifestyle Corporation (DLC) to which he is dedicated to this day.\n\nHis personal website is http://dlcorp.com\n\n--\n\nEddy Chai in Mumbai is a video of a seminar that Eddy conducted when Forever had started its operations in India. There was no particular topic given to Eddy, rather his brief was only to motivate the audience positively towards doing the business. He was also given a time frame of 2 hours completely for himself. It's only an experienced speaker who can captivate his audience for a span of two hours without boring the crap out of them.\n\nThis is a good video for those training to be speakers. Remember in network marketing, all successful distributors are very powerful speakers.\nI have seen successful (read: rich) people in MLM who are completely blind and also people without limbs. But I have never come across any dumb/mute or deaf person who is successful in Network Marketing.","torrent":{"xt":"urn:btih:6ce109df03e63cd3cf67f955d0cd5e654f6789a5","amp;dn":"Network+Marketing+Training+-+Eddy+Chai+in+Mumbai+%28Video%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ce109df03e63cd3cf67f955d0cd5e654f6789a5","infoHashBuffer":{"type":"Buffer","data":[108,225,9,223,3,230,60,211,207,103,249,85,208,205,94,101,79,103,137,165]},"announce":[],"urlList":[]}}