{"title":"Gerald Kein - Ultra-Height Hypnosis","uid":10204743,"size":654306321,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:6cf281c5f05051ac5f284b82a8f0e7513029042b&amp;dn=Gerald+Kein+-+Ultra-Height+Hypnosis&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":2,"time":1400831935,"description":"Ultra-HeightÂ® Hypnosis is an exciting new method for the hypnotist to guide the client in accessing his capability to discover the cause of his problem. The client's discovery reveals to the hypnotism practitioner exactly what is needed  to set the client free. \n\nIt is also a powerful method for the client to accelerate the healing process.\n\nUltra-HeightÂ® Hypnosis involves guiding the client as deeply as possible into hypnosis. Optimally, into the hypnotic coma state, but, at least somnambulism. \n\nWhile guiding and directing the body to continue to relax deeper, the hypnotist guides the client's conscientiousness to rise higher. The client's mind is directed to rise well above the level of higher self and higher conscientiousness into a newly discovered level Jerry has labeled Ultra-HeightÂ®.\n\nAlthough all the potential aspects of this extremely high level of trance are still being discovered, there is no doubt it is an exciting higher conscientiousness hypnotic level that could lead to major new transformational breakthroughs and direction in the profession!\n\nUltra-HeightÂ® Hypnosis is the newest, most exciting discovery in hypnotism today!","torrent":{"xt":"urn:btih:6cf281c5f05051ac5f284b82a8f0e7513029042b","amp;dn":"Gerald+Kein+-+Ultra-Height+Hypnosis","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6cf281c5f05051ac5f284b82a8f0e7513029042b","infoHashBuffer":{"type":"Buffer","data":[108,242,129,197,240,80,81,172,95,40,75,130,168,240,231,81,48,41,4,43]},"announce":[],"urlList":[]}}