{"title":"Family Band - Grace &amp; Lies (2012)","uid":8241477,"size":93784669,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6db9ff3058a97e3c23fa387d32a395f1895f8c54&amp;dn=Family+Band+-+Grace+%26amp%3B+Lies+%282012%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pec2027","files":10,"time":1362966268,"description":"\nFamily Band is the collaboration between husband and wife Jonny Ollsin (Children, S.T.R.E.E.T.S.) and visual artist Kim Krans, joined by Scott Hirsch (the Court &amp; Spark, Hiss Golden Messenger). The couple met in the Catskills in 2005, first starting the band as a side project from Ollsin's time with heavy metal band Children, who later broke up and inspired the pair to play together more seriously. By 2008, Ollsin and Krans built a cabin in Delhi, a small upstate New York town, and met Hirsch, who helped flesh out the Family Band sound, a combination of folk-steeped ambient rock and Krans' moody alto. That year they self-released their debut EP, Blessed, returning in April 2010 with the self-released album Miller Path, named after a street near the cabin where most of the recording took place, followed that November by the audiovisual EP Cold Songs. Coverage in The FADER, NYLON, and Stereogum raised Family Band's profile, and by the following spring they supported like-minded atmospheric rockers Warpaint on tour. Sophomore album Grace &amp; Lies found the group signing to the No Quarter label, which released the record in July 2012, while ABC picked up songs from Miller Path for use in its crime docudrama series Final Witness. per allmusic\n\nimage included","torrent":{"xt":"urn:btih:6db9ff3058a97e3c23fa387d32a395f1895f8c54","amp;dn":"Family+Band+-+Grace+%26amp%3B+Lies+%282012%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6db9ff3058a97e3c23fa387d32a395f1895f8c54","infoHashBuffer":{"type":"Buffer","data":[109,185,255,48,88,169,126,60,35,250,56,125,50,163,149,241,137,95,140,84]},"announce":[],"urlList":[]}}