{"title":"The Secret Of El Dorado-(WTC-SWE)","uid":4522314,"size":587349301,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6fbe27159691c53360b7d2a333a1fb20b81169f9&amp;dn=The+Secret+Of+El+Dorado-%28WTC-SWE%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"WTC-SWE","files":-1,"time":1227211774,"description":"BBC:\n----\n\n\n                           THE SECRET OF EL DORADO\n                          -------------------------\n\n\nIn 1542, the Spanish Conquistador, Francisco de Orellana ventured along the Rio Negro, one of the Amazon Basin's great rivers. Hunting a hidden city of gold, his expedition found a network of farms, villages and even huge walled cities. At least that is what he told an eager audience on his return to Spain.\n\nThe prospect of gold drew others to explore the region, but none could find the people of whom the first Conquistadors had spoken. The missionaries who followed a century later reported finding just isolated tribes of hunter-gatherers. Orellana's story seemed to be no more than a fanciful myth.\n\nWhen scientists came to weigh up the credibility of Orellana's words, they reached the same conclusion. As productive as the rainforest may appear, the soil it stands in is unsuited to farming. It is established belief that all early civilisations have agriculture at their hearts. Any major population centre will have connections with a system of intensive agriculture. \n\nIf a soil cannot support crops sufficient to feed a large number of people, then that serves as an effective cap on the population in that area. Even modern chemicals and techniques have failed to generate significant food from Amazonian soil in a sustainable way . The thought that indigenous people could have survived in any number - let alone prospered - was dismissed by most scientists. Scientific consensus was sure that the original Amazonians lived in small semi-nomadic bands and that Orellana must have lied.\n\nBolivia's Llanos de Mojos (Mojos Plains) are 2,000km from Orellana's route down the main channel of the Amazon. The terrain is savannah grassland with extreme seasons - floods in the wet; fires in the dry. Crops are hard to grow and few people live there. But back in the 1960s archaeologist Bill Denevan noted that the landscape was crossed with unnaturally straight lines. Large areas were also covered with striped patterns.\n\n\n\n\nFile Size: 560 MB \nFormat:AVI\nVideo Length: 00:48:56\nVideo Codec:XviD\nVideo Resolution: 624x352\nVIdeo Bitrate: 1561 kbit/s\nFPS:  25.000\nAudio Bitrate: 136 kbit/s\nAudio Codec: Lame MP3\nSubtitles:(External English)\n\n\n       &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0605178/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0605178/&lt;/a&gt;\n\n\n\nENJOY:\n\n\n\n\nYOUR CHOICE\n\nWTC-SWE\n\n\n\n\n(Please seed so others can enjoy)\n\n                                                \n                                        \n\n\n\nNote: External English subtitles included.\n------------------------------------------\n","torrent":{"xt":"urn:btih:6fbe27159691c53360b7d2a333a1fb20b81169f9","amp;dn":"The+Secret+Of+El+Dorado-%28WTC-SWE%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6fbe27159691c53360b7d2a333a1fb20b81169f9","infoHashBuffer":{"type":"Buffer","data":[111,190,39,21,150,145,197,51,96,183,210,163,51,161,251,32,184,17,105,249]},"announce":[],"urlList":[]}}