{"title":"Lizardtech Djvu Document Express Enterprise v5.1.0 Build 946 Unl","uid":3395662,"size":212662578,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:703f12650fde2b64cd0fb73e47cf950bae189e45&amp;dn=Lizardtech+Djvu+Document+Express+Enterprise+v5.1.0+Build+946+Unl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rishi","files":1,"time":1129151146,"description":"http://www.lizardtech.com/products/doc/\n\nLizardTech Document Express with DjVu Enterprise 5.1.0 build 946\n\n201,161 KB\n\nSerial For DjVu Editor 5.1 (Enterprise):\n\n305-050-1364-138-860\n179-050-2714-511-463\n212-051-1866-337-472\n516-051-5611-099-295\n\nalso includes\n\n- Virtual Printer Pro (converts anything to .djvu)\n- pdf to djvu converter\n- IE/Netscape Browser plugin\n- IFilter (indexing &amp; search engine using MS Index Server)\n\nDjVu typically achieves compression ratios about 5 to 10 times better\nthan existing methods such as JPEG and GIF for color documents, and 3 to\n8 times than TIFF for black and white documents. Scanned pages at 300\nDPI in full color can be compressed down to 30 to 100KB files from\n25MB.. Black-and-white pages at 300 DPI typically occupy 5 to 30KB when\ncompressed.\n\nThis puts the size of high-quality scanned pages within the realm of an\naverage HTML page (which is typically around 50KB).\n\nFor color document images that contain both text and pictures, DjVu\nfiles are typically 5 to 10 times smaller than JPEG at similar quality.\n\nFor black-and-white pages, DjVu files are typically 10 to 20 times\nsmaller than JPEG and five times smaller than GIF. DjVu files are also\nabout 3 to 8 times smaller than black and white PDF files produced from\nscanned documents (scanned documents in color are impractical in PDF).\n\nIn addition to scanned documents, DjVu can also be applied to documents\nproduced electronically in formats such as Adobe's PostScript or PDF. In\nthat case, the file sizes are between 15 to 20KB per page at 300 DPI.\n\nThe DjVu plug-in is available for standard Web browsers on various\nplatforms. The DjVu plug-in allows for easy panning and zooming of\ndocument images. A unique on the fly decompression technology allows\nimages that normally require 25MB of RAM to be decompressed to require\nonly 2MB of RAM.\n\nConventional image viewing software decompresses images in their\nentirety before displaying them. This is impractical for high-resolution\ndocument images since they typically go beyond the memory capacity of\nmany PCs, causing excessive disk swapping. DjVu, on the other hand,\nnever decompresses the entire image, but instead keeps the image in\nmemory in a compact form, and decompresses the piece displayed on the\nscreen in real time as the user views the image. Images as large as\n2,500 pixels by 3,300 pixels (a standard page image at 300 DPI) can be\ndownloaded and displayed on very low-end PCs.\n\nThe DjVu format is progressive. Users get an initial version of the page\nvery quickly, and the visual quality of the page progressively improves\nas more bits arrive. For example, the text of a typical magazine page\nwould appear in just three seconds over a 56Kbps modem connection. In\nanother second or two, the first versions of the pictures and\nbackgrounds will appear. Then, after a few more seconds, the final\nfull-quality version of the page is completed.\n\nOne of the main technologies behind DjVu is the ability to separate an\nimage into a background layer (i.e., paper texture and pictures) and\nforeground layer (text and line drawings). Traditional image compression\ntechniques are fine for simple photographs, but they drastically degrade\nsharp color transitions between adjacent highly contrasted areas - which\nis why they render type so poorly. By separating the text from the\nbackgrounds, DjVu can keep the text at high resolution (thereby\npreserving the sharp edges and maximizing legibility), while at the same\ntime compressing the backgrounds and pictures at lower resolution with a\nwavelet-based compression technique.\n\nDjVu is used by many commercial and non-commercial web sites on the Web\ntoday. AND, Yes, You can view djvu-documents with the professional\nversion, but also with a (free) plugin within the enterprise version.\nProf. version is also capable to edit the files and sometimes ebooks\ncan't be opened with free plugin, just with prof. version, so I would\nrecommend to install both.\n\nThe enterprise version is just for those who want to CONVERT to djvu,\ne.g. from pdf, psd(photoshop), tif, jpg or whatever. But You have to\nhave a fast machine, or the time for conversion will tend to infinity or\neven break down (like on my old PIII).\n\nSo I rcommend to install all three versions, together with virtual\nprinter and to read the help files and learning by doing. DJVU is a nice\nformat and makes files very small and handle-able, compared to other\nformats, like pdf.\n\nFor best success, install all three versions. One for the browser, one\nfor opening &amp; possibly converting pictures and the complete set to\nconvert anything (The entreprise edition contains a virtual printer,\nsame serial as ent. edition).\n\nI have reduced my HD space by 3 by converting my pdf-textfiles and by up\nto 20 (normally 10) on jpg-files.\n\nBTW, djvu is also supported by IRFANVIEW (freeware), with the filter\npack. Djvu is a great format that ought to replace pdf if you could find\na way to spread the browser plug-in in an efficient way....","torrent":{"xt":"urn:btih:703f12650fde2b64cd0fb73e47cf950bae189e45","amp;dn":"Lizardtech+Djvu+Document+Express+Enterprise+v5.1.0+Build+946+Unl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"703f12650fde2b64cd0fb73e47cf950bae189e45","infoHashBuffer":{"type":"Buffer","data":[112,63,18,101,15,222,43,100,205,15,183,62,71,207,149,11,174,24,158,69]},"announce":[],"urlList":[]}}