{"title":"Agama Web Buttons and Web Menus","uid":7016775,"size":11722283,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:70ac5f3f0fd754a00ee4d01fe051e4d2159259c7&amp;dn=Agama+Web+Buttons+and+Web+Menus&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Tom_Da_Man","files":4,"time":1328692885,"description":" &lt;a href=&quot;http://www.agamabuttons.com/webbuttons.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.agamabuttons.com/webbuttons.jpg&lt;/a&gt;\n\n\n\nAgama Web Menus is an advanced and highly effective tool that will enable you to create perfect and fully functional DHTML menus (web menu) compatible with all commonly used browsers without being obliged to write even a single code line.  \n\nCross-browser and multi Doctype support!\nBeginner or Professional?\n\nOur software will make it possible even for a complete beginner to create professionally looking DHTML menus during several minutes only. Professional developers will praise highly more than a hundred attributes that bring absolute adaptability of menus up to the level of individual menu items. You need add only short HTML menu code to your web pages, of course with using your favorite sitebuilder like Homesite, Expression Web, Dreamweaver and others. \n\nHundreds of menu themes\n\nAgama Web Menus application contains hundreds of predefined menu templates in the styles of XP menu, Vista menu, Mac and many other styles of a high graphic quality. On the other hand you will be able to create and save hundreds of other, your own, personalized, original and repeatedly applicable menu styles. By the way, you may have a look at some Theme samples here. \n\nSitemaps Generator\n\nAgama Web Menus contains a sitemap generator for creating a Google sitemap and also a tool for creating any fully user-adaptable sitemaps. By the way, you may have a look at some samples here. \n\nComplex Solution of navigation\n\nUnlike most of competitive tools, Agama Web Menus brings you a really complex solution for web navigation. You can create not only traditional Popup menus, Dropdown menus, Navigation bars, Buttons menu or Bookmark menus with our program but also Tree menus or Dropdown tree menus. All of this is offered for the price of one single program! \n\n\t\t\nSave hundreds of hours spent with complicated development and a lot of money and start to create perfect and fully functional DHTML menus for your company or personal web pages right now.    a trial version of Agama Web Menus without time limitations just now.\n\t\t\n\nOne product, more kinds of menus\n\nYou will be able to create many kinds of DHTML menus with a single tool:\nPopup menu\nDropdown popup menu\nHorizontal navigation bar menu\nTree menu\nDropdown tree menu\nUnlimited Menus\n\nunlimited menus in the page\nunlimited submenus and Items\nunlimited submenu levels\nFull Compatibility of menu\n\nAll Doctypes in the quirk and strict mode supported include:\nHTML Transitional\nHTML Strict\nXHTML Transitional\nXHTML Strict\nSee compatibility list here \n\nAttributes Inspector\n\nis a control component of the program on which we worked quite hard. The resulting product offers a well-ordered, comfortable and effective access to more than a hundred configuration attributes that will enable you to customize each detail of your DHTML menu. See the sample of Attributes Inspector here. \n\nStyle Inheritance\n\nOur unique function of Style Inheritance makes it possible to apply appearance changes to all items in a DHTML menu by changing a single value of general style attribute. It is still possible to change each menu item separately exactly according to your wishes. Here you will learn more about Style Inheritance. \n\nAdvanced WYSIWYG functions\n\nAdvanced editing functions, such as copying parts of menu hierarchy, copying properties of individual menu items, copying the properties of whole submenus, or drag and drop functions for moving entire parts of menu structure, will enable you to compile a final DHTML menu in a fast and effective way and with minimal effort. You will see all the changes on the preview panel immediately. \n\nProgrammable interface and easy implementation into web pages\n\nAgama Web Menus will enable you to generate a single compact JavaScript file or a separate set of files one of which contains the configuration of the entire menu. This configuration file can be generated dynamically on the http server side. A number of user-configured events will then enable perfect interaction with the rest of your web pages. You may attach your own JavaScript code for events such as roll down/roll up a dropdown menu, viewing submenus, or moving the mouse across a menu item. You need add only short HTML code to your web pages with using your favorite site builder like Homesite, Expression Web, Dreamweaver and others. \n\nA fully commented DHTML menu script source code\n\nis available to the owners of a pro version licence. The JavaScript (DHTML menu script) created by us is an exclusively object oriented code that enables easy programming approach by means of member function and properties. See license compare table. \n\nTransparent licence policy\n\nOur product, as compared to the products of other producers, generates a JavaScript that does not refer in any way to other domains of the internet; neither does it so to verify the licence authenticity. Menu functionality is therefore fully dependent only on the availability of your web server, not on the availability of the software producer's server. \n\nDetailed documentation and in-built context help\n\nThe program is accompanied with detailed documentation describing the meanings of all configuration attributes, program function, and a number of hints that will enable to compile menus in a fast and effective way. The program itself is delivered with a help panel containing context help. Corresponding help is always offered for an active program element. This context help will enable you to master the program functions fast.\n\nInstall:\n========\nRun the setup\nGenerate license with CRD Keygen\nSay Thanks![/color][/size]\n\n\n\n","torrent":{"xt":"urn:btih:70ac5f3f0fd754a00ee4d01fe051e4d2159259c7","amp;dn":"Agama+Web+Buttons+and+Web+Menus","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"70ac5f3f0fd754a00ee4d01fe051e4d2159259c7","infoHashBuffer":{"type":"Buffer","data":[112,172,95,63,15,215,84,160,14,228,208,31,224,81,228,210,21,146,89,199]},"announce":[],"urlList":[]}}