{"title":"Brazil - An Inconvenient History","uid":5408329,"size":366193417,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:711ab81dfac19c41d622113ce8b793f5a10e17cd&amp;dn=Brazil+-+An+Inconvenient+History&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"zecarlos","files":-1,"time":1267674182,"description":"Portuguese-BR Subtitles included.\n\nAt first glance Brazil appears to be an alluring playground of exciting carnivals, sultry samba, divine football and a vibrantly diverse people.But behind this dazzling facade lies a disturbing story of history's largest-ever slave population. Astonishingly Brazil, a Portuguese colony, received ten-times more African slaves than the numbers transported to North America. This programme looks at those estimated 4 million people with whose blood, sweat and tears Brazil was built. Without them none of Brazil's present-day success and appeal would exist. Using contemporary testimonies, this film takes a hard look at Brazil s dark history through the eyes of those slaves. They lived in squalid conditions on remote plantations or in teeming cities harbouring fatal diseases. Most Africans survived only seven years in this 'New World'. Some, however, did survive to create a new culture a fusion of African and European. This new ethnicity permeates and explains the modern Brazilian way of life. This outstanding film, winner of the Houston Film Festival Gold Award, is directed by Phil Grabsky. His film throws light on Brazil s inconvenient history . ","torrent":{"xt":"urn:btih:711ab81dfac19c41d622113ce8b793f5a10e17cd","amp;dn":"Brazil+-+An+Inconvenient+History","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"711ab81dfac19c41d622113ce8b793f5a10e17cd","infoHashBuffer":{"type":"Buffer","data":[113,26,184,29,250,193,156,65,214,34,17,60,232,183,147,245,161,14,23,205]},"announce":[],"urlList":[]}}