{"title":"Jane Austen's Names Riddles, Persons, Places (2015) Gooner","uid":14617673,"size":11033254,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:719c5cd44f8c646f0f1bd874c885e21a7a9a7bcc&amp;dn=Jane+Austen%27s+Names+Riddles%2C+Persons%2C+Places+%282015%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":2,"time":1463228909,"description":"Jane Austen's Names Riddles, Persons, Places (2015) (Pdf &amp; Epub) Gooner\r\n\r\nPublisher: University of Chicago Press (21 April 2015)\r\nLanguage: English\r\nISBN-10: 0226157830\r\nISBN-13: 978-0226157832\r\n\r\nIn Jane Austen's works, a name is never just a name. In fact, the names Austen gives her characters and places are as rich in subtle meaning as her prose itself. Wiltshire, for example, the home county of Catherine Morland in Northanger Abbey, is a clue that this heroine is not as stupid as she seems: according to legend, cunning Wiltshire residents caught hiding contraband in a pond capitalized on a reputation for ignorance by claiming they were digging up a &quot;big cheese&quot; - the moon's reflection on the water's surface. It worked. \r\n\r\nIn Jane Austen's Names, Margaret Doody offers a fascinating and comprehensive study of all the names of people and places - real and imaginary - in Austen's fiction. Austen's creative choice of names reveals not only her virtuosic talent for riddles and puns. Her names also pick up deep stories from English history, especially the various civil wars, and the blood-tinged differences that played out in the reign of Henry VIII, a period to which she often returns. Considering the major novels alongside unfinished works and juvenilia, Doody shows how Austen's names signal class tensions as well as regional, ethnic, and religious differences. \r\n\r\nWe gain a new understanding of Austen's technique of creative anachronism, which plays with and against her skillfully deployed realism - in her books, the conflicts of the past swirl into the tensions of the present, transporting readers beyond the Regency. \r\n\r\nFull of insight and surprises for even the most devoted Janeite, Jane Austen's Names will revolutionize how we read Austen's fiction","torrent":{"xt":"urn:btih:719c5cd44f8c646f0f1bd874c885e21a7a9a7bcc","amp;dn":"Jane+Austen%27s+Names+Riddles%2C+Persons%2C+Places+%282015%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"719c5cd44f8c646f0f1bd874c885e21a7a9a7bcc","infoHashBuffer":{"type":"Buffer","data":[113,156,92,212,79,140,100,111,15,27,216,116,200,133,226,26,122,154,123,204]},"announce":[],"urlList":[]}}