{"title":"Women and the Vote: A World History by Jad Adams","uid":11163469,"size":3906567,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:71d6c3a9870048ffad3d384293dc2d7971ddb268&amp;dn=Women+and+the+Vote%3A+A+World+History+by+Jad+Adams&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"hello505","files":1,"time":1412596044,"description":"This is the story of how this momentous change came about. The first genuinely global history of women and the vote, it takes the story of women in politics from the earliest times to the present day, revealing startling new connections across time and national boundaries - from Europe and North America to Asia, Africa, Latin America, and the Muslim world post-9/11. \n\nA story of individuals as well as of wider movements, it includes the often dramatic life-stories of women's suffrage pioneers from across the world, painting vivid biographical portraits of everyone from Susan B. Anthony and the Pankhursts to hitherto lesser-known activists in China, Latin America, and Africa. \n\nIt is also the first major post-feminist history of women's struggle for the vote. Controversially, Jad Adams rejects the widely accepted idea that success was primarily a result of the pressure group politics of the suffragists and their supporters. Ultimately, he argues, it was nationalism, not feminism, that was the most important factor in winning women the vote.\nReadership: All those interested in the global struggle for women's voting rights - and how these rights have been achieved\n","torrent":{"xt":"urn:btih:71d6c3a9870048ffad3d384293dc2d7971ddb268","amp;dn":"Women+and+the+Vote%3A+A+World+History+by+Jad+Adams","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71d6c3a9870048ffad3d384293dc2d7971ddb268","infoHashBuffer":{"type":"Buffer","data":[113,214,195,169,135,0,72,255,173,61,56,66,147,220,45,121,113,221,178,104]},"announce":[],"urlList":[]}}