{"title":"Queen - Bohemian Rhapsody (Wayne's World Version)","uid":4344393,"size":222404612,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:71f031fd0e0a9475dc64c02c0c27852ee0fb494b&amp;dn=Queen+-+Bohemian+Rhapsody+%28Wayne%5C%27s+World+Version%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"2nafish","files":1,"time":1218789533,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Bohemian Rhapsody&quot; is a song written by Freddie Mercury and originally recorded by the band Queen for their 1975 album A Night at the Opera. The song is in the style of a stream-of-consciousness nightmare, and has unusual musical structure for popular music (it has no chorus, instead consisting of seemingly disjunct sections including operatic segments and an a cappella and heavy metal part). Despite this, it was released as a single and became a huge commercial success. In addition, the song is widely hailed as Queen&amp;#039;s magnum opus, and it marked a decisive point in the band&amp;#039;s career and set them on the way to become one of the world&amp;#039;s most popular music groups.\n\nThe song enjoyed renewed popularity in 1992 as part of the soundtrack to the film Wayne&amp;#039;s World. In connection with this, a new video was released, intercutting excerpts from the film with footage from the original Queen video, along with some live footage of the band. The Wayne&amp;#039;s World video version of &quot;Bohemian Rhapsody&quot; won Queen its only MTV Video Music Award for * Best Video from a Film. When surviving members Brian May and Roger Taylor took the stage to accept the award, Brian May was overcome with emotion and said that &quot;Freddie would be tickled&quot;.\n\nOn the Made in Heaven video documentary &quot;Champions of the World&quot;, Mike Myers talked about his horror at finding out that the record company had mixed clips from Wayne&amp;#039;s World with Queen&amp;#039;s original video, and his fear that this would upset the band. Myers himself said, &quot;they&amp;#039;ve just whizzed on a Picasso.&quot; As a result, he asked the record company to tell Queen that the video was not his idea, and that he apologized to them. He then said that, later, Queen sent a reply simply saying, &quot;Thank you for using our song,&quot; which shocked Myers, who said it should be more like him telling Queen, &quot;Thank you for even letting me touch the hem of your garments!&quot;\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:71f031fd0e0a9475dc64c02c0c27852ee0fb494b","amp;dn":"Queen+-+Bohemian+Rhapsody+%28Wayne%5C%27s+World+Version%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71f031fd0e0a9475dc64c02c0c27852ee0fb494b","infoHashBuffer":{"type":"Buffer","data":[113,240,49,253,14,10,148,117,220,100,192,44,12,39,133,46,224,251,73,75]},"announce":[],"urlList":[]}}