{"title":"Shit and Shine - Cunts with Roses (2007) [299kbps VBR]","uid":3930952,"size":63104173,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:71f466f5028dbf18e1fde1fdee70406f962a60ff&amp;dn=Shit+and+Shine+-+Cunts+with+Roses+%282007%29+%5B299kbps+VBR%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"JSC77","files":3,"time":1197470689,"description":"From Brainwashed:\n\nSo while my girlfriend is swamped in a bunch of paperwork I sneak up to my hideaway  for a fix of sonic filth. I pull out the new 12\\&quot; on Noisestar. This heavy duty slab of wax is limited to a measly 300 copies and was recorded live  on August 29th 2006 at  rehearsal in London. Everything about this record tells me that she\\&amp;#039;s not gonna appreciate it, the title, the sleeve, So I put on my headphones in a considerate moment.\n\nThis is pure primordial dirge. A pulverising military, almost tribal drum rhythm is pounded out of lord knows how many drum kits. (I saw footage of them in Berlin beating on 9 of them). Over the drums is a cochlea-annihilating distorted monster of a riff. This is heavier than a blue whale with a stomach full of lead.  Imagine mid-period Melvins recorded in a cave.\n\nThe track skips and stutters at various points. This is either some crazy editing or couldn\\&amp;#039;t give a shit warts and all attitude. It is raw, brutal and seriously nasty. The whole wall off sound is then put through a filter and then kicks back in. The occasional vocals are largely incoherrent and have a great \\&amp;#039;fuck you\\&amp;#039; charm to them. Then the last couple of minutes have drums that are so distorted they sound like scud missiles going off in your face. The flip-side is more of the same relentless repetition and ferocious distortion, drawing on the same elements and ideas of the first track much in the same way as Om\\&amp;#039;s mighty Variations On a Theme LP. It all ends in a lockgroove which may have possibly given me tinnitus.\n\n \nTracklisting:\n1. (00:28:10) Shit And Shine - Cunts with Roses\n\nPlaying Time.........: 00:28:10\nTotal Size...........: 60,17 MB\n\n","torrent":{"xt":"urn:btih:71f466f5028dbf18e1fde1fdee70406f962a60ff","amp;dn":"Shit+and+Shine+-+Cunts+with+Roses+%282007%29+%5B299kbps+VBR%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71f466f5028dbf18e1fde1fdee70406f962a60ff","infoHashBuffer":{"type":"Buffer","data":[113,244,102,245,2,141,191,24,225,253,225,253,238,112,64,111,150,42,96,255]},"announce":[],"urlList":[]}}