{"title":"C.T. Wente - Don't Order Dog- Don't Order Dog [Epub &amp; Mobi] ","uid":9936199,"size":1922313,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:726fd0253dc61a701244ee246993c82ea7c920b2&amp;dn=C.T.+Wente+-+Don%27t+Order+Dog-+Don%27t+Order+Dog+%5BEpub+%26amp%3B+Mobi%5D+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"krystine","files":-1,"time":1397163619,"description":"Twenty-six year old Jeri Halston is brilliant, with looks as stunning as her intellect. She should be killing it on Wall Street or speed-climbing the corporate ladder. But she isn't. Maybe her father's death the year before is to blame. Maybe it's a quarter-life crisis. Even Jeri doesn't know for sure. That's why she's pouring drinks for baby-faced co-eds and geriatric men at Joe's Last Stand Saloon. Tending bar at the old saloon on Historic Route 66 seems like the perfect way to sort things out. At least, that was the plan. But then the letters started arriving. Funny, rambling confessions of love from an unknown admirer, postmarked from every corner of the world. A Polaroid photo in each letter reveals a tantalizing glimpse of their sender, but never his identity. And always the same strange sign off - Don't order dog. Jeri can't help but be intrigued, and after posting the letters in the saloon, so is everyone else. But it isn't until an overzealous Homeland Security agent named Tom Coleman begins investigating the trail of Jeri's mysterious writer that a pattern starts to appear. A terrifying pattern. A pattern that will throw Jeri's life into turmoil and force her to question everything she knows about the world, her country, and even herself.","torrent":{"xt":"urn:btih:726fd0253dc61a701244ee246993c82ea7c920b2","amp;dn":"C.T.+Wente+-+Don%27t+Order+Dog-+Don%27t+Order+Dog+%5BEpub+%26amp%3B+Mobi%5D+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"726fd0253dc61a701244ee246993c82ea7c920b2","infoHashBuffer":{"type":"Buffer","data":[114,111,208,37,61,198,26,112,18,68,238,36,105,147,200,46,167,201,32,178]},"announce":[],"urlList":[]}}