{"title":"Dark Secrets Inside Bohemian Grove - Directors Cut","uid":4601931,"size":1470172803,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:73a26e940149e31a10333fe3a2e18d85265559cb&amp;dn=Dark+Secrets+Inside+Bohemian+Grove+-+Directors+Cut&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Protocol22","files":3,"time":1230257786,"description":"DARK SECRETS INSIDE BOHEMIAN GROVE - DIRECTORS CUT\n\n\n\nJones' Dark Secrets: Inside the Bohemian Grove documented the first ever hidden camera incursion into the Grove and the bizzare pagan ritual, the Cremation of Care, practiced by its members, all men, including both Presidents Bush, Bill Clinton, Jimmy Carter, Colin Powell, and Henry Kissenger to name but a few.\n\n\nMajor media from CBS television, magazines like People and Spy have attempted and failed to get the hard video evidence that Alex Jones and his team have gotten out of Bohemian Grove.\n\n\nAlex Jones: &quot;This is like something out of a Hollywood movie, where teenagers are out camping in the wilderness and come over a hill and witness some devil cult in black and red garb sacrificing some poor soul on a bloody altar.&quot;\n\n\nSEE THE TRUTH AS DOCUMENTED IN ALEX'S FILM, DARK SECRETS: INSIDE BOHEMIAN GROVE Since 1873, the Global Elite Has Held Secret Meetings in the Ancient Redwood Forest of Northern California. \nMembers of the so-called &quot;Bohemian Club&quot; include Former Presidents Eisenhower, Nixon and Reagan. \t\n\n\nThe Bush Family Maintains a Strong Involvement. Each Year at Bohemian Grove, Members of This All-Male &quot;Club&quot; Don Red, Black and Silver Robes and Conduct an Occult Ritual Wherein They Worship a Giant Stone Owl, Sacrificing a Human Being in Effigy to What They Call the &quot;Great Owl of Bohemia.&quot;\n\nNow, for the First Time in History, an Outsider Has Infiltrated Bohemian Grove with a Hidden Digital Video Camera and Caught the Ritual on Tape. That Man is Alex Jones, the Exclusive Digital Video is Just Part of His Shocking New Documentary: DARK SECRETS: INSIDE BOHEMIAN GROVE","torrent":{"xt":"urn:btih:73a26e940149e31a10333fe3a2e18d85265559cb","amp;dn":"Dark+Secrets+Inside+Bohemian+Grove+-+Directors+Cut","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"73a26e940149e31a10333fe3a2e18d85265559cb","infoHashBuffer":{"type":"Buffer","data":[115,162,110,148,1,73,227,26,16,51,63,227,162,225,141,133,38,85,89,203]},"announce":[],"urlList":[]}}