{"title":"Alison Krauss &amp; John Waite - Missing You  (2nafish)","uid":5378119,"size":156174340,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:74507b93d4d8dbdc92fbc56641b160480e07e49a&amp;dn=Alison+Krauss+%26+John+Waite+-+Missing+You++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1266644343,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Missing You&quot; is a song by British musician John Waite and was included in the album No Brakes. It peaked at number one on the Billboard Hot 100 for one week on September 22, 1984, and number nine on the UK Singles Chart.\n\nJohn Waite re-recorded the song with country/bluegrass artist Alison Krauss which appeared on her album A Hundred Miles or More: A Collection, and released it to country music radio in 2007. The re-recording peaked at #34 on the Hot Country Songs chart. It was also featured in the popular 1980s inspired video game Grand Theft Auto: Vice City.\n\nThe opening line is sometimes misheard as &quot;Everyime I hear your name, I always catch my breasts&quot;.\n\nJohn Charles Waite (born 4 July 1952; Lancaster, Lancashire, England) is an English rock singer and musician. He was lead vocalist for the bands The Babys and Bad English. As a solo artist, he scored a #1 hit in the United States with &quot;Missing You&quot; in 1984.\n\nAlison Krauss (born July 23, 1971 in Decatur, Illinois) is an American bluegrass-country singer and fiddler. She entered the music industry at an early age, winning local contests by the age of ten and recording for the first time at fourteen. She signed with Rounder Records in 1985 and released her first solo album in 1987. She was invited to join the band with which she still performs, Alison Krauss and Union Station (AKUS), and later released her first album with them as a group in 1989.\n\nShe has released eleven albums, appeared on numerous soundtracks, and helped renew interest in bluegrass music in the United States. Her soundtrack performances have led to further popularity, including the Grammy-winning O Brother, Where Art Thou? soundtrack, an album also credited with raising American interest in bluegrass, and the Cold Mountain soundtrack, which led to her performance at the 2004 Academy Awards. During her career she has won 27 Grammy Awards, making her the most awarded female artist (and the second most awarded artist overall, tied with Quincy Jones) in Grammy history.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:74507b93d4d8dbdc92fbc56641b160480e07e49a","amp;dn":"Alison+Krauss+%26+John+Waite+-+Missing+You++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"74507b93d4d8dbdc92fbc56641b160480e07e49a","infoHashBuffer":{"type":"Buffer","data":[116,80,123,147,212,216,219,220,146,251,197,102,65,177,96,72,14,7,228,154]},"announce":[],"urlList":[]}}