{"title":"Chris Young - The Man I Want To Be  (2nafish)","uid":5323340,"size":157890564,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:748ad172c3129c23179d5b12cc50c0497d3c1898&amp;dn=Chris+Young+-+The+Man+I+Want+To+Be++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1264898057,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;The Man I Want to Be&quot; is the title of a song written by Brett James and Tim Nichols and recorded by American country artist Chris Young. It was released in November 2009 as the third single from his second studio album, also titled The Man I Want to Be.\n\nThe music video, which was directed by Chris Hicky, premiered on CMT on December 3, 2009. In the video, Young takes a seat next to a man waiting for a bus, who hands Young a quarter and advises him to make a phone call to God (rather than trying to call his girlfriend). Young then goes to a telephone booth, and while he makes his call, scenes of his former love interest lying in her bedroom are shown. A sign from God comes in the form of a large arrow in the bed of a passing pickup truck. He continues to follow signs, which lead him to a downtown coffee shop, where he meets his love interest on the sidewalk. The video ends with him making amends with her, while the man from the bus stop looks through the window of a passing Greyhound and smiles to himself.\n\n&quot;The Man I Want to Be&quot; is a moderate up-tempo country song. The song's male narrator describes the kind of &quot;man [he] wants to be.&quot; The first verse finds him realizing that he hasn't been the man he should (&quot;I've spent my whole life gettin' it all wrong&quot;) and describing that he wants God's help to change. In the second verse, he longs to have his old lover back, and for him to be the perfect man for her (&quot;I wanna be the kind of man that she sees in her dreams&quot;).\n\n&quot;The Man I Want to Be&quot; debuted at #58 on the U.S. Billboard Hot Country Songs chart for the week of November 28, 2009.\n\nThe Man I Want to Be is the second studio album of American country music artist Chris Young. It was released on September 1, 2009 via RCA Nashville. The lead-off single, &quot;Voices&quot;, was released in May 2008, and peaked at #37 on the Hot Country Songs chart, becoming Young's first Top 40 country hit. The album was supposed to have been released in August 2008, but was delayed. A second single, &quot;Gettin' You Home (The Black Dress Song)&quot;, was released in January 2009, and has reached Number One on the country charts.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n\n\n","torrent":{"xt":"urn:btih:748ad172c3129c23179d5b12cc50c0497d3c1898","amp;dn":"Chris+Young+-+The+Man+I+Want+To+Be++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"748ad172c3129c23179d5b12cc50c0497d3c1898","infoHashBuffer":{"type":"Buffer","data":[116,138,209,114,195,18,156,35,23,157,91,18,204,80,192,73,125,60,24,152]},"announce":[],"urlList":[]}}