{"title":"Express Rising (2003, 2013) [FLAC]","uid":8770890,"size":491861662,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:75323c1cf1a4fb8b2f9644f6957b9873b4b69ca0&amp;dn=Express+Rising+%282003%2C+2013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1375452917,"description":"\n  Express Rising (2003, 2013) [FLAC]\n\n  Genres: Pop/Rock, Electronic\n  Styles: Beats, Downtempo, Instrumental\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bit Rate: ~ 900 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  2003 Express Rising\n  2013 Express Rising 2 \n\n  Wrapped in a cover bearing a blurry photo of a nature scene and holding little information inside, Express Rising appeared out of the mist in 2003 as a limited run, self-titled album. The cloudy instrumental sounds turned out to be the long-toiled-over work of Chicago-based deep funk and soul DJ/compilation curator Dante Carfagna, pulled from years of four-track recordings and other piecemeal media. The (also self-titled) follow-up arrived in an equally vaporous manner ten years later, again with a washed-out photo and little else for listeners to go on besides the music. While the obscurity of the project is of almost Jandek-ian proportions, the 11 tracks of Carfagna's sophomore effort as Express Rising defy the vagueness of his aesthetic as they slowly burn through their beautifully watercolored phases. Clearly the end result of months or even years of home recording, the production sounds eroded more than arrived at, be it the muffled four-track cassette drum beat of &quot;Left Right Behind&quot; or the pristine synth pads of &quot;Leland Sprinkle.&quot; One gets the sense that many long nights were spent in a bedroom studio refining, scrapping, and approaching songs afresh the next morning. \n\n  Somewhere between Boards of Canada's dream-like pastoral electronica and the grubbiest four-tracked beat tape found on the street, Express Rising maintains a mystical dichotomy between controlled composition and absentminded stargazing. The soft melancholy of &quot;Horse Opera&quot; builds a buzzing din of electric piano and organ tones while a meandering guitar lead floats lazily on top. Ambling drums push the song along, gently, everything coming together to evoke the auburn glow of a summer night fading into morning. With the same sense of subtlety and depth as Eno's Before and After Science era, Carfagna manages to make every sound he employs take on his own unique voice. Thus the brittle banjo and looming hip-hop beats of &quot;A Treasure Smile&quot; don't clash with the almost Stars of the Lid-style ambience of &quot;Winter the Heart.&quot; Though none of the sounds should make sense together, they all fit perfectly. Silently, almost invisibly, Carfagna has crafted another chapter of the insular masterpiece that is Express Rising. The album, though appearing to make every attempt at being ignored, is well worth seeking out. Spun on repeat, the sounds offer a unified voice so streamlined and crystalline they can't help but rise above their creator's self-imposed opacity.","torrent":{"xt":"urn:btih:75323c1cf1a4fb8b2f9644f6957b9873b4b69ca0","amp;dn":"Express+Rising+%282003%2C+2013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"75323c1cf1a4fb8b2f9644f6957b9873b4b69ca0","infoHashBuffer":{"type":"Buffer","data":[117,50,60,28,241,164,251,139,47,150,68,246,149,123,152,115,180,182,156,160]},"announce":[],"urlList":[]}}