{"title":"Fischer-Z - Going Red For A Salad (The UA Years)@320","uid":4219464,"size":190027666,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:76342b8a0159f1fee6911c674dc946ca75467da6&amp;dn=Fischer-Z+-+Going+Red+For+A+Salad+%28The+UA+Years%29%40320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"alekow1","files":27,"time":1212522181,"description":"Fischer-Z\n\nThe British rock band Fischer-Z released three quite successful albums between 1979 and 1981. The original lineup consisted of John Watts (vocals, guitar), David Graham (bass), Steve Skolnik (keyboards) and Steve Liddle (drums).\nFischer-Z&amp;#039;s biggest hit was &quot;The Worker&quot; one of the few records to actually go down the charts after being featured on Top Of The Pops then at the height of its influence. Watts later put this down to the remix of the song from the album version which put the emphasis on the keyboards rather than his guitar. Watts&amp;#039;s lyrics drew heavily on his experiences as a mental health care worker which may be one reason why the band failed to gain much airplay in the UK.\nThey were considerably more popular in mainland Europe - particularly Portugal, Belgium and Germany, where Watts continued to have hits as a solo artist after the band broke up. They were most successful of all in Australia, where they achieved two Top 20 hits with &quot;So Long&quot; and &quot;The Perfect Day&quot;. &quot;So Long&quot; continues to be a radio staple in Australia to this day.\nWatts founded a new band with the same name in 1987, with him being the only original member although Skolnik made a minor contribution to one track on their first album. The albums released with the new lineup were considerably less successful than the ones recorded with the original band.\n\n\n\n\nGoing Red For A Salad (The UA Years)\n\nCompiled in the early days of the CD boom, this compilation lifts some of the best tracks off of FZ&amp;#039;s first three albums - Word Salad, Going Deaf for a Living and Red Skies over Paradise,  hence the quirky title - and adds two from each of the subsequent John Watts solo albums.\n This is Fischer-Z in their early funky mood, think of The Police, with catchy tunes and catchier choruses.\nA great introduction into the talented world of early FZ/Watts.\n\n\n\n\n01. So Long                                       \n02. Acrobats                                      \n03. The Worker                                    \n04. Wax Dolls                                     \n05. Remember Russia                               \n06. Going Deaf For A Living                       \n07. Room Service                                  \n08. Pretty Paracetamol                            \n09. Marliese                                      \n10. You&amp;#039;ll Never Find Brian Here                  \n11. Berlin                                        \n12. Battalions Of Strangers                       \n13. Bathroom Scenario                             \n14. Wristcutter&amp;#039;s Lullaby                         \n15. Crazy Girl                                    \n16. One Voice                                     \n17. Involuntary Movement                          \n18. Mayday Mayday                                 \n19. I Smelt Roses (In The Underground)            \n20. Limbo             \n\n\n\nLabel: EMI\nReleased: 1990\n\n\nBITRATE: 320\n\nMy cd-rip (EAC and Lame)\nCovers Included\n\n\n\nEnjoy,Seed and Share\t\n\n","torrent":{"xt":"urn:btih:76342b8a0159f1fee6911c674dc946ca75467da6","amp;dn":"Fischer-Z+-+Going+Red+For+A+Salad+%28The+UA+Years%29%40320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76342b8a0159f1fee6911c674dc946ca75467da6","infoHashBuffer":{"type":"Buffer","data":[118,52,43,138,1,89,241,254,230,145,28,103,77,201,70,202,117,70,125,166]},"announce":[],"urlList":[]}}