{"title":"Tower of Babel - Bodie Hodge","uid":11773255,"size":5429831,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:76f841b8f5efccf50d584bca9c1f85856ba581cb&amp;dn=Tower+of+Babel+-+Bodie+Hodge&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"starxteel","files":2,"time":1427160098,"description":"\nThe Tower of Babel: The Cultural History of Our Ancestors reveals our shared ancestry as never before! Many are familiar with the Biblical account of Babel, but after the dispersal, there was a void beyond Biblical history until empires like Rome and Greece arose. Now, discover the truth of these people groups and their civilizations that spread across the earth and trace their roots back to Babel as well as to the sons and grandsons of Noah.\n\nMany of today?s scholars write off what occurred at the Tower of Babel as mythology and deny that it was a historical event. Beginning with the Biblical accounts, author Bodie Hodge researched ancient texts, critical clues, and rare historic records to help solve the mystery of what became of the failed builders of Babel. For the purpose of defending the Bible, Hodge presents these and other vital historical facts surrounding this much-debated event. Teens and older can use this layman?s reference for Biblical classes, ancient history, apologetics training, and to realize their own cultural connection to the Bible.\n\n\nAbout the author:\nMr. Bodie Hodge attended Southern Illinois University at Carbondale and received a B.S. and M.S. in mechanical engineering. His specialty was a subset of mechanical engineering based in advanced materials processing, particularly starting powders. Currently, Bodie is a speaker, writer, and researcher for Answers in Genesis USA. He is the author of The Fall of Satan and co-author of Dragons: Legends &amp; Lore of Dinosaurs","torrent":{"xt":"urn:btih:76f841b8f5efccf50d584bca9c1f85856ba581cb","amp;dn":"Tower+of+Babel+-+Bodie+Hodge","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76f841b8f5efccf50d584bca9c1f85856ba581cb","infoHashBuffer":{"type":"Buffer","data":[118,248,65,184,245,239,204,245,13,88,75,202,156,31,133,133,107,165,129,203]},"announce":[],"urlList":[]}}