{"title":"Polymer Science - A Comprehensive Reference [10 Vol. Set]","uid":13692489,"size":699723897,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7731f3bac874ce0a45f48553bcd9a988500d4100&amp;dn=Polymer+Science+-+A+Comprehensive+Reference+%5B10+Vol.+Set%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":10,"time":1456626765,"description":"The progress in polymer science is revealed in the chapters of Polymer Science: A Comprehensive Reference. In Volume 1, this is reflected in the improved understanding of the properties of polymers in solution, in bulk and in confined situations such as in thin films. Volume 2 addresses new characterization techniques, such as high resolution optical microscopy, scanning probe microscopy and other procedures for surface and interface characterization. Volume 3 presents the great progress achieved in precise synthetic polymerization techniques for vinyl monomers to control macromolecular architecture: the development of metallocene and post-metallocene catalysis for olefin polymerization, new ionic polymerization procedures, and atom transfer radical polymerization, nitroxide mediated polymerization, and reversible addition-fragmentation chain transfer systems as the most often used controlled/living radical polymerization methods. Volume 4 is devoted to kinetics, mechanisms and applications of ring opening polymerization of heterocyclic monomers and cycloolefins (ROMP), as well as to various less common polymerization techniques. Polycondensation and non-chain polymerizations, including dendrimer synthesis and various &quot;click&quot; procedures, are covered in Volume 5. Volume 6 focuses on several aspects of controlled macromolecular architectures and soft nano-objects including hybrids and bioconjugates. Many of the achievements would have not been possible without new characterization techniques like AFM that allowed direct imaging of single molecules and nano-objects with a precision available only recently. An entirely new aspect in polymer science is based on the combination of bottom-up methods such as polymer synthesis and molecularly programmed self-assembly with top-down structuring such as lithography and surface templating, as presented in Volume 7. It encompasses polymer and nanoparticle assembly in bulk and under confined conditions or influenced by an external field, including thin films, inorganic-organic hybrids, or nanofibers. Volume 8 expands these concepts focusing on applications in advanced technologies, e.g. in electronic industry and centers on combination with top down approach and functional properties like conductivity. Another type of functionality that is of rapidly increasing importance in polymer science is introduced in volume 9. It deals with various aspects of polymers in biology and medicine, including the response of living cells and tissue to the contact with biofunctional particles and surfaces. The last volume is devoted to the scope and potential provided by environmentally benign and green polymers, as well as energy-related polymers. They discuss new technologies needed for a sustainable economy in our world of limited resources.\r\n\r\nProvides broad and in-depth coverage of all aspects of polymer science from synthesis/polymerization, properties, and characterization methods and techniques to nanostructures, sustainability and energy, and biomedical uses of polymers\r\nProvides a definitive source for those entering or researching in this area by integrating the multidisciplinary aspects of the science into one unique, up-to-date reference work\r\nElectronic version has complete cross-referencing and multi-media components\r\nVolume editors are world experts in their field (including a Nobel Prize winner)","torrent":{"xt":"urn:btih:7731f3bac874ce0a45f48553bcd9a988500d4100","amp;dn":"Polymer+Science+-+A+Comprehensive+Reference+%5B10+Vol.+Set%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7731f3bac874ce0a45f48553bcd9a988500d4100","infoHashBuffer":{"type":"Buffer","data":[119,49,243,186,200,116,206,10,69,244,133,83,188,217,169,136,80,13,65,0]},"announce":[],"urlList":[]}}