{"title":"Rome Pop Festival 1968 DVD","uid":14517070,"size":2082379990,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:777436d8fdc2d80526f7dce4eafd8f5962275b73&amp;dn=Rome+Pop+Festival+1968+DVD&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GRNS3","files":15,"time":1462335915,"description":"Here is a nice bootleg. Check my account for more classic bootlegs.\r\n\r\nPlease enjoy, share with friends and please seed :)\r\n\r\n\r\n\r\nRome Pop Festival 1968 (Mr. Anonymous - voltarized)\r\nMay 4-6, 1968\r\nPalazzo Dello Sport,\r\nRome, Italy\r\nPAL DVD\r\n\r\n\r\n\r\nAn 18 minute overview of this legendary festival, I was told this copy came straight from the BBC's archives.\r\nThe very brief live performance snippets featured include Capt. Beefheart, Donovan, Pink Floyd, Julie Driscoll &amp; The Brian Auger Trinity, Samauri &amp; more.\r\n\r\nTwo different gig flyers suggest this was originally slated as a 4-day event; the film claims it was shortened by four whole days due to poor attendance + crowd control issues &amp; that The Move closed the festival on the third &amp; final night.\r\n\r\nI received this dvd with the notion that it was the long-lost festival documentary film &quot;Rome Goes Pop&quot;.\r\nAt a sparse 18min and with no mention of that title at any point of the film, I suspect this might just be an un-aired, lost or never re-aired BBC project that hasn't made it out of the vaults until now. The Beefheart clip featured here has circulated since the vhs days, but as a whole, I can find no mention of this complete 18 minute piece anywhere on the net.\r\n\r\n\r\nMost interesting &amp; controversial is the 1.5 minute clip of Pink Floyd performing &quot;It Would Be So Nice&quot;.\r\nTo my ears, the audio sounds like the studio version of the song played over top of a (absolutely un-heard of &amp; never-before-seen) live video rendition of the song. Watch the footage (specifically Richard's lips), there's no disputing that they are in fact performing this song &amp; that it happened at this festival.\r\n\r\nBut the heart of the controversy lies in a near 7 minute video rendition of &quot;Interstellar Overdrive&quot; that surfaced on youtube a few years back and was thought to be taken from the lost &quot;Rome Goes Pop&quot; film.\r\nClearly that 7 minutes of video and the 1.5 minutes of Floyd featured in this documentary are NOT from the same show.\r\nThree of the four Floyd members are in different dress and for added measure, the gear behind Nick's drum kit does not match. Finally the 7min &quot;IO&quot; footage incorporates all sorts of psychedelic imagery, while the performance sampled in the documentary offer no such shenanigans. A mystery.\r\n\r\nI've decided to include &quot;IO&quot; as a bonus anyway, to more or less re-spark what has long been a very debated &amp; analyzed performance in the history of The Floyd. It comes from the dvd bootleg, Pink Floyd &quot;Psychedelic Chronicles&quot; (by Apocalypse Sound).\r\n\r\n\r\ndocumentary running time : 18.19\r\n&quot;bonus&quot; running time : 6.57","torrent":{"xt":"urn:btih:777436d8fdc2d80526f7dce4eafd8f5962275b73","amp;dn":"Rome+Pop+Festival+1968+DVD","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"777436d8fdc2d80526f7dce4eafd8f5962275b73","infoHashBuffer":{"type":"Buffer","data":[119,116,54,216,253,194,216,5,38,247,220,228,234,253,143,89,98,39,91,115]},"announce":[],"urlList":[]}}