{"title":"2014 - The Year In Christian Music (Bundle 48)","uid":10857292,"size":1060949794,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:77cc06b91c6e5c25e017278ac1897a7402b4adec&amp;dn=2014+-+The+Year+In+Christian+Music+%28Bundle+48%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TorrentTracts","files":132,"time":1408848491,"description":"-----------------------------------------------------------------------\n2014 - THE YEAR IN CHRISTIAN MUSIC\n-----------------------------------------------------------------------\n\nSome of you might have noticed that today's 48th bundle is only one gigabyte.  Where as I have always made these two gigabyte offerings since I began doing so back in 2011.  So it's only half of the size that it normally is.  And there's a reason for that.\n\nI recently ran across a Christian Music sharing website that appeared all but dead.  It's emptiness, and lack of active users spoke to my heart, perhaps no different than a Church with empty seats, and a Pastor with no one to preach to.  I knew I could personally make a difference, and get some traffic flowing through that website.  But to do so meant I'd be cutting into my sharing time here on The Pirate Bay.  So it's something I've been praying on for a couple of weeks now.  And I feel lead to doing something about it...\n\nBecause if that, this will be my final bundle here on The Pirate Bay until October.  During that time, any and all new music that I come across will be shared at christiantunes.in  The other half of this bundle is now being uploaded there as we speak.  It won't be in torrent format, but instead file download format via fileswap.  Each album will have it's own entry, so there will be no more bundles.  I'll be uploading daily, or as time permits.  And I don't intend on sharing here in October, what I will be sharing there in September.\n\nIn the event that the website gets too much traffic and shuts down, I'll return here to The Pirate Bay before September is up, and resume sharing here.  In the event everything goes smoothly, I won't share anything new here until October.\n\nThat all being said, I think this is a great opportunity for some of you to personally join me and share your music with us all.  New or old.  One album, or en, it doesn't matter.  And of course registration will be needed on the new christiantunes.in website, so if you're opposed to doing that, then please kick it back and enjoy all of the great music you've downloaded here from January through August.  As I said, I'll return in October.  Or sooner, should something come up.\n\nGOSPEL: Brent Jones, The Crabb Family, Kevin Spencer.  POP: Chayah Miranda, Hannah Stenman.  HIP-HOP/RAP: Daniel Anthony, Flo, True Blue.  CONTEMPORARY: Matthew Smith.  SINGER-SONGWRITER: Miracle House.  ROCK: Nate Gomes.  FOLK: North Side Baptist Church.  HARDCORE/METAL: Wovenwar.\n\nThis half-sized bundle includes the following 14 titles ...\n\n * Brent Jones - 2014 - Joy Comin\n * Chayah Miranda - 2014 - No Other Way\n * Crabb Family, The - 2014 - Icon\n * Daniel Anthony - 2014 - Brand New - Single\n * Flo - 2014 - Team Up - With Threat\n * Hannah Stenman - 2014 - I Must Have You - Single\n * Kevin Spencer - 2014 - Sings Songs With Mom And Dad Spencer\n * Matthew Smith - 2014 - Hiding Place\n * Miracle House - 2014 - E.T.A.T.B.D - Joy In Sorrow\n * Nate Gomes - 2014 - My Own Little Planet - Single\n * Nate Gomes - 2014 - The Summer Song - Single\n * North Side Baptist Church - 2014 - Lord Come Soon\n * True Blue - 2014 - Christ Invasion\n * Wovenwar - 2014 - Wovenwar\n\nGod Bless,\nTorrentTracts, August 2014\n","torrent":{"xt":"urn:btih:77cc06b91c6e5c25e017278ac1897a7402b4adec","amp;dn":"2014+-+The+Year+In+Christian+Music+%28Bundle+48%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"77cc06b91c6e5c25e017278ac1897a7402b4adec","infoHashBuffer":{"type":"Buffer","data":[119,204,6,185,28,110,92,37,224,23,39,138,193,137,122,116,2,180,173,236]},"announce":[],"urlList":[]}}