{"title":"Health Effects of Transport-Related Air Pollution","uid":14575429,"size":7631652,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:77f391fee7e1d1f5608833dd2cde098bd7f13b3e&amp;dn=Health+Effects+of+Transport-Related+Air+Pollution&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1462837976,"description":"Health Effects of Transport-Related Air Pollution - Michal Krzyzanowski et al. (WHO, 2005).pdf\r\n\r\nISBN 92-890-1373-7\r\n\r\nWhile transport is a vital part of modern life, policy-makers in the WHO European Region face the difficult challenge of reducing the related risks to health and the environment and meeting countries' requirements for effective transport systems. Diseases related to the air pollution caused by road transport affect tens of thousands of people in the Region each year. Policies for more effective action need to be based on a better understanding of the role of various pollutants in harming health and the determinants of exposure.\r\nThis book helps to meet this need. It provides a systematic review of the literature and a comprehensive evaluation of the health hazards of transport-related air pollution. The review addresses: factors determining emissions, the contribution of traffic to pollution levels, human exposure and the results of epidemiological and toxicological studies to identify and measure the health effects.\r\n\r\nThis book is designed for two main audiences: policy-makers and experts in transport-related air pollution and public health. Accordingly, it offers both summary information for the former and full discussion, primarily for the latter. A separate summary for policy-makers is also available. For both groups, this book identifies the key facts emerging from the accumulated evidence, and uses them to suggest both topics for further research and well-justified short-term action to protect health. It can help both groups play their part in making and implementing transport policies in the European Region that maximize the benefits to health","torrent":{"xt":"urn:btih:77f391fee7e1d1f5608833dd2cde098bd7f13b3e","amp;dn":"Health+Effects+of+Transport-Related+Air+Pollution","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"77f391fee7e1d1f5608833dd2cde098bd7f13b3e","infoHashBuffer":{"type":"Buffer","data":[119,243,145,254,231,225,209,245,96,136,51,221,44,222,9,139,215,241,59,62]},"announce":[],"urlList":[]}}