{"title":"Resident Evil Novelizations - Genesis, Apocalypse, and Extinctio","uid":8083020,"size":2461981,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:78390ee52406b0df58f6e725f27b4620f06d796e&amp;dn=Resident+Evil+Novelizations+-+Genesis%2C+Apocalypse%2C+and+Extinctio&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"analog0","files":-1,"time":1359543885,"description":"All three Keith R. A. DeCandido Resident Evil film novelizations in PDF format. Provide great insight into characters and past events not covered in theA great read for fans of the franchise.\n\n-----------------------------------\n\nResident Evil: Genesis | (2004)\n\nThe Hive: a subterranean genetic research facility owned and operated by Umbrella, an immensely powerful corporation with interests in everything from human longevity to bio-warfare. With computerized defences and heavily armed human backup, the Hive is impregnable and invulnerable. Or so Umbrella believes. But something has gone fatally wrong. The Hive has lost containment of its most lethal and horrific creation: a virus that kills and reanimates human life, reducing the entire facility staff of five hundred men and women to mindless creatures with a single driving force: hunger. And the key to stopping them rests with one young woman who cannot even remember who she is.\n\n\nResident Evil: Apocalypse | (2004)\n\nFailure of the Hive to contain the Umbrella Corporation's most deadly viral creation has led to an outbreak of apocalyptic proportions. Now the streets of Raccoon City swarm with the living dead, compelling Umbrella to deploy another of its bio-weapons, a hulking prototype soldier code-named 'Nemesis' that kills anything in its path. Jill Valentine of the RCPD and several others are determined to get out of Raccoon alive, but only if they can escape the city's hordes of undead, Umbrella's unleashed creatures, and the relentless pursuit of Nemesis itself. Their one chance is with one of the only survivors of the Hive - a young woman named Alice, who learns a terrifying secret behind her connection to Umbrella.\n\n\nResident Evil: Extinction | (2007)\n\nFollowing the events of the first two films, Resident Evil and Resident Evil Apocalypse, the genetic research facility owned and operated by Umbrella Corporation has failed to contain the horrifying T-virus...leaving the streets of Raccoon City swarming with the living dead before the metropolis is eventually and utterly destroyed. Now the survivors of the catastrophe, including the mysterious Alice, must fight their way across the Nevada desert and to safety, even as Umbrella's conspires to bring about their complete annihilation...","torrent":{"xt":"urn:btih:78390ee52406b0df58f6e725f27b4620f06d796e","amp;dn":"Resident+Evil+Novelizations+-+Genesis%2C+Apocalypse%2C+and+Extinctio","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"78390ee52406b0df58f6e725f27b4620f06d796e","infoHashBuffer":{"type":"Buffer","data":[120,57,14,229,36,6,176,223,88,246,231,37,242,123,70,32,240,109,121,110]},"announce":[],"urlList":[]}}