{"title":"Virginia Macgregor - Vad Milo såg - Svensk","uid":14683213,"size":588110478,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:784d2fb895037a91514e4ace74772235650bd47c&amp;dn=Virginia+Macgregor+-+Vad+Milo+s%26aring%3Bg+-+Svensk&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"totomas1","files":129,"time":1464110011,"description":"Virginia Macgregor - Vad Milo såg\r\n\r\nMilo formade tummen och pekfingret till ett litet titthål och höll upp det framför Als ögon. Titta här igenom. Det är vad jag ser, typ, fast sämre.\r\nWow, det måste vara helt otroligt. Milo ryckte på axlarna. Inte direkt.Jag menar, du kan verkligen fokusera, eller hur? Jag kan slå vad om att du ser alla möjliga saker som andra människor missar.\r\n\r\nNioåriga Milo Moon har retinitis pigmentosa: hans syn blir successivt sämre och han kommer så småningom att bli helt blind. För tillfället ser han världen genom ett litet titthål och lägger märke till saker som andra människor missar.\r\nNär Milos älskade gammelfarmor Lou blir dement och flyttar in på vårdhemmet Förgätmigej inser han snart att något inte står rätt till på boendet. De vuxna vill inte lyssna, så med vårdhemskocken Tripi och sällskapsgrisen Hamlet till hjälp bestämmer sig Milo för att avslöja missförhållandena och demaskera den lömska syster Thornhill.\r\n\r\nFörfattaren Virginia Macgregor växte upp i Tyskland, Frankrike och England med en mamma som aldrig slutade berätta sagor. Från det att hon var gammal nog att hålla i en penna började hon att skriva egna berättelser. Hon är döpt efter Virginia Wolf och Virginia Wade, med förhoppningen att hon skulle bli antingen författare eller tennisproffs.\r\nVirginia bor i Berkshire med sin man och dotter. Vad Milo såg är hennes första roman för vuxna.\r\n\r\n\r\nMp3-CD\r\nUppläsare: Mattias Linderoth\r\nSpeltid: Ca 10 timmar","torrent":{"xt":"urn:btih:784d2fb895037a91514e4ace74772235650bd47c","amp;dn":"Virginia+Macgregor+-+Vad+Milo+s%26aring%3Bg+-+Svensk","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"784d2fb895037a91514e4ace74772235650bd47c","infoHashBuffer":{"type":"Buffer","data":[120,77,47,184,149,3,122,145,81,78,74,206,116,119,34,53,101,11,212,124]},"announce":[],"urlList":[]}}