{"title":"Oh, The Things I Know! by Al Franken (2002|Dutton) [EPUB] [PDF]","uid":10158663,"size":810397,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:78da4cf87f169dda4738fa3468d18b70ccdccf9f&amp;dn=Oh%2C+The+Things+I+Know%21+by+Al+Franken+%282002%7CDutton%29+%5BEPUB%5D+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"VikTSlick","files":-1,"time":1400199627,"description":"Title: Oh, the Things I Know! A Guide to Sucess or, Failing That, Happiness\nAuthor: Al Franken\nCategory: Non-Fiction/Humor\nHardcover: 128 pages\nPublisher: Dutton Adult; First Edition edition (April 29, 2002)\nLanguage: English\nISBN-10: 052594673X\nISBN-13: 978-0525946731\n\nimage\n\nPromotional info/Publisher's Summary - &quot;Al Franken, or Dr. Al Franken as he prefers to be called, has written the first truly indispensable book of the new millennium. Filled with wisdom, observations, and practical tips you can put to work right away, Oh, the Things I Know! is a cradle-to-grave guide to living, an easy-to-follow user's manual for human existence. \n\nWhat does a megasuccess like Al Franken-bestselling author, Emmy-award winning television star, and honorary Ph.D.-have to say to ordinary people like you? Well, as Dr. Al himself says, &quot;There's no point in getting advice from hopeless failures.&quot; \n\nJoin Mr. Franken-sorry, Dr. Franken-on a journey that will take you from your first job (&quot;Oh, Are You Going to Hate Your First Job!&quot;), through the perils and pitfalls of your twenties and thirties (&quot;Oh, the Person of Your Dreams vs. the Person You Can Actually Attract!&quot;), into the joys of marriage and parenthood (&quot;Oh, Just Looking at Your Spouse Will Make Your Skin Crawl!&quot;), all the way to the golden years of senior citizenship (&quot;Oh, the Nursing Home You'll Wind Up In!&quot;). Don't travel life's lonesome highway by yourself. Take Al Franken along, if not as an infallible guide, then at least as a friend who will make you laugh.&quot;\n\nBooklist Review - \n&quot;With a nod to Dr. Seuss and his popular tome for graduates of all ages, Franken offers his own advice guide, which covers pretty much anything anyone wants to understand about life. The aptly named chapters include &quot;Oh, the Mistakes You'll Keep Repeating,&quot; &quot;Oh, the Weight You Will Gain,&quot; and &quot;Oh, the Orgasms You'll Fake (For the Ladies).&quot; Franken tries to be nurturing, yet he can't avoid being blunt: &quot;Someone once said it is just as easy to fall in love with a rich person as with a poor one. Actually that's not true. It's easier to fall in love with a rich person. But to get them to love you back, that's harder.&quot; And when remarking on Babe Paley's comment, &quot;You can't be too thin or too rich,&quot; Franken adds, &quot;Nobody loves a fat, poor person.&quot; Nor does he shy away from debunking myths. What doesn't kill you will make you stronger? Franken had a friend who went in for back surgery, which made him stronger for a while, until the blood clot that formed in his leg during surgery collapsed his lung, making him weaker. This laugh-aloud take on advice books--it is dedicated simply &quot;For Oprah&quot;--is Stuart Smiley with an edge. Reviewer's advice: don't read it while sitting alone on a bus.&quot; - Ilene Cooper\n\nThis torrent pack contains the original PDF and a converted EPUB using Calibre that came out okay but with some weird pagestamp errors here and there. Still, very readable. The front cover and the generated metadata.opf are also included. Please seed, and enjoy! :-)","torrent":{"xt":"urn:btih:78da4cf87f169dda4738fa3468d18b70ccdccf9f","amp;dn":"Oh%2C+The+Things+I+Know%21+by+Al+Franken+%282002%7CDutton%29+%5BEPUB%5D+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"78da4cf87f169dda4738fa3468d18b70ccdccf9f","infoHashBuffer":{"type":"Buffer","data":[120,218,76,248,127,22,157,218,71,56,250,52,104,209,139,112,204,220,207,159]},"announce":[],"urlList":[]}}