{"title":"Documents Suppressed by Republicans - expanded","uid":7789893,"size":37764874,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:792d58eccade1ce21b4daf7864da443e984555fb&amp;dn=Documents+Suppressed+by+Republicans+-+expanded&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"twwtwwtww","files":1,"time":1351991781,"description":"Also known as the &quot;Why all Republicans can kiss mah big ol' White ass pack&quot;\n\n\n\nRe-release as one of the reports was inadvertently left out, but I've also added a few more bonuses to make it up to you, including pdfs on voter suppression, some economic charts, ect. (don't miss the .jpgs)\n\n\n----------------------\n\n\n\n\nRachel Maddow report on U.S.Government documents Suppressed by Republicans because they refute their ideology and some details on why Bush decided not to collect as much data regarding charter schools as reports detailed that charter schools do not perform any better than public schools.\n\n\n\nContains 2 U.S.Government reports as .pdfs, some copied web pages of major news orgs detailing the suppression and the Maddow Blog page.\n\n\nThe Government reports included are the 2003 U.S. State department report &quot;Patterns of Global Terrorism 2003&quot; that the Bush administration refused to release as it exposes the fact that world terrorism events did not decrease because of Bush's policies and the  U.S, Congressional Research Service report &quot;Taxes and the Economy: An Economic Analysis of the Top Tax Rates Since 1945&quot; which was recently pulled because Republicans in Congress became upset about it refuing their idiolical claims about tax cuts boosting the economy and bringing in more revenue to the government.\n\n\n\n\nAlso included as as a bonus is the 1976 thesis of Governor Bob McDonnell (aka &quot;Governor Ultrasound&quot;) &quot;The Republican Party's Vision for the Family The Compelling Issue of The Decade&quot; which details his vision for the GOP, much of what is being enacted today and gives some insight on the GOP's war on women, minorities, the LGBT community, labor and pretty much everyone else. \n\n\nHave you voted yet? \n\n\nYou do know that Romney showed his &quot;support&quot; for Medicare and women by choosing Paul Ryan, the &quot;kill Medicare and Social Security&quot; guy who also supported &quot;personhood&quot; legislation in the last two congressional sessions (co-sponsored several bills with Todd Akin) which is in line with the Republicans Party platform's stance on granting personhood rights to fertilized eggs and thus would outlaw ALL forms of hormonal bith control as well as ALL abortions, even to protect the life of the mother.\n\nDetails on specific legislation can be found at the U.S Congress site:\n &lt;a href=&quot;\nhttp://www.house.gov/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.house.gov/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://thomas.loc.gov/home/thomas.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thomas.loc.gov/home/thomas.php&lt;/a&gt;\n\nRelevant commentary can be found by Googling the terms:\n\n&quot;Paul Ryan personhood&quot;, &quot;Paul Ryan personhood bill&quot;, and &quot;Paul Ryan personhood birth control&quot; \n\n...and I'm sure you can think of a few other relevant search terms regarding the GOP platform\n\nYou have the internet, use it for something other than a porn machine and downloading games, books andit's YOUR student loans they're coming after and YOU and Your Parents' Medicatre, Social Security they've been trying to destroy ever since before they were enacted. \n\n","torrent":{"xt":"urn:btih:792d58eccade1ce21b4daf7864da443e984555fb","amp;dn":"Documents+Suppressed+by+Republicans+-+expanded","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"792d58eccade1ce21b4daf7864da443e984555fb","infoHashBuffer":{"type":"Buffer","data":[121,45,88,236,202,222,28,226,27,77,175,120,100,218,68,62,152,69,85,251]},"announce":[],"urlList":[]}}