{"title":"Forbidden Holywood Collection Vol. 1 - Disk 1 - Xvid 1cd - Red H","uid":9254221,"size":734332928,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:79e3c10ab578bd14922899f7769a0fed2b37cf80&amp;dn=Forbidden+Holywood+Collection+Vol.+1+-+Disk+1+-+Xvid+1cd+-+Red+H&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SaM","files":-1,"time":1385524008,"description":"Forbidden Holywood Collection Vol. 1 - Disk 1 - Xvid 1cd - Red Headed Woman (1932) [DDR]\n\nRed-Headed Woman is a 1932 American romantic comedy film, produced by Metro-Goldwyn-Mayer, based on a novel of the same name by Katherine Brush, and with a screenplay by Anita Loos. It was directed by Jack Conway, and stars Jean Harlow as a woman who uses sex to advance her social position. During the course of the film, Harlow breaks up a marriage, has multiple affairs and pre-marital sex, and attempts to kill a man.\n\nThe film proved difficult from its inception. Producer Irving Thalberg was concerned that the original story and the first draft of a script by F. Scott Fitzgerald were too serious, and offered the job of rewriting it to Anita Loos, instructing her to provide something that was more fun and playful and with a greater emphasis on comedy.\n\nBefore Harlow, MGM wanted Clara Bow, who agreed to do the part, but objected to the &quot;future services&quot; option the studio felt needed.\n\nPrior to its release he worked with the Will Hays Office to ensure it would receive approval for general release. Under the Production Code, a criminal could not be seen to profit from the crime, or to go unpunished, and sin must be punished. Adding further to the problem was Harlow's overtly sexual portrayal, with several scenes in which she was partially undressed, or making obvious sexual advances.\n\nAlthough the Hays Office could not ban a film as such, a refusal to issue approval for a particular film could lead exhibitors to refuse to screen it. Thalberg agreed to seventeen cuts to enable it to screen in the United States;[citation needed] however upon release, it still received a large number of complaints from affronted cinema patrons.[citation needed] The original theatrical release was banned in the United Kingdom, it was never resubmitted until 1965. The furor surrounding its release generated considerable publicity, and the film was a box-office success.\n\n    CAST:-\n    Jean Harlow as Lillian 'Lil' / 'Red' Andrews Legendre\n    Chester Morris as William 'Bill' / 'Willie' Legendre Jr.\n    Lewis Stone as William 'Will' Legendre Sr.\n    Leila Hyams as Irene 'Rene' Legendre\n    Una Merkel as Sally\n    Henry Stephenson as Charles B. 'Charlie' / 'C.B.' Gaerste\n    Charles Boyer as Albert\n    May Robson as Aunt Jane\n    Harvey Clark as Uncle Fred\n\n    Directed by Jack Conway\n    Produced by Paul Bern\n    Written by F. Scott Fitzgerald (uncredited)\n    Screenplay by Anita Loos\n    Based on Red-Headed Woman by Katherine Brush\n\nSYNOPSIS:- Red Headed Woman (1932)\nLilian 'Lil' Andrews (Harlow wearing a red wig) is a young woman who will do anything to improve herself. She seduces her wealthy boss William 'Bill' Legendre Jr. (Chester Morris) and cleverly breaks up his marriage with his loving wife Irene (Leila Hyams). Irene reconsiders and tries to reconcile with Bill, only to find he has married Lil that day.\n\nHowever, Lil finds herself shunned by high society, including Bill's father, Will Legendre Sr. (Lewis Stone), because of her lower class origins and homewrecking. When Charles B. Gaerste (Henry Stephenson), a nationally known coal tycoon and the main customer of the Legendres' company, visits the city, Lil thinks she has found a way to force her way into the highest social circles. She seduces him, then blackmails him into throwing a party at her mansion, knowing that no one would dare offend him by not showing up. It seems like a social coup for Lil, until her hairdresser friend and confidante Sally (Una Merkel) points out that all the guests have left early to attend a surprise party for Irene (who lives across the street).\n\nHumiliated, she decides to move to New York City, even if it means a temporary separation from her husband. Will finds Lil's handkerchief at Gaerste's place and correctly guesses what Lil has done. He shows his evidence to his son, who hires detectives to watch Lil. They find that she is conducting not one, but two affairs, with Charles and his handsome French chauffeur Albert (Charles Boyer). Bill shows Charles damning photographs.\n\nWhen Lil learns that Charles has found out about her, she returns to Bill, only to find him with Irene. Furious, she shoots him, but he survives and refuses to have her charged with attempted murder. However, he does divorce her and remarry Irene. Two years later, he sees her again, at a racetrack in Paris, in the company of an aged Frenchman. He discreetly hides Irene's binoculars. In the final scene, Lil and her elderly companion get into a limousine ... driven by Albert.\n\nTECHNICAL SPECIFICATIONS\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 855 kbps\nVideo Resolution: 640x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 23.976\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages: English\nRunTime 1:19:00\nSubtitles: None\nRipped by: Trinidad [DDR]\nDuration: 1:19:0","torrent":{"xt":"urn:btih:79e3c10ab578bd14922899f7769a0fed2b37cf80","amp;dn":"Forbidden+Holywood+Collection+Vol.+1+-+Disk+1+-+Xvid+1cd+-+Red+H","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"79e3c10ab578bd14922899f7769a0fed2b37cf80","infoHashBuffer":{"type":"Buffer","data":[121,227,193,10,181,120,189,20,146,40,153,247,118,154,15,237,43,55,207,128]},"announce":[],"urlList":[]}}