{"title":"DC Comics Helix Titles","uid":4608069,"size":604990041,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:7a58738b75cf8770b6c9742660c23877ead3fabd&amp;dn=DC+Comics+Helix+Titles&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ParrowJack","files":83,"time":1230539496,"description":"Helix was a short-lived, science fiction and science fantasy imprint of DC Comics, launched in 1996 and discontinued in 1998. In early promotional materials prior to the release of the first title, the imprint was called &quot;Matrix&quot; instead of Helix. It was renamed because of the upcoming film, The Matrix.\n\nDespite the involvement of successful SF/fantasy novelists Michael Moorcock, Lucius Shepard and Christopher Hinz, and established comics creators Howard Chaykin, Elaine Lee, Matt Howarth, Warren Ellis, Walt Simonson, and Garth Ennis, sales of the comic books were low, and most of the ongoing titles were cancelled after 12 or fewer issues. Limited availability of the books in bookstores that already sold science fiction, resistance among science-fiction readers to serialized monthly publication, the lower visibility of the line's deliberately muted cover color palette, and the lack of interest in genre SF among regular patrons of comic-book stores, were all cited by industry observers as factors in the imprint's demise.\n\nTransmetropolitan was switched to the Vertigo imprint and is therefore not contained in this pack. Pack includes:\n\n\nThe Black Lamb\nTimothy Truman's (Grimjack, Hawkworld, Jonah Hex: Two Gun Mojo) unique take on an action horror adventure. Set in the future it follows the adventures of The Black Sheep, a vampire who hunts vampire killers. Part of the short-lived science fantasy 'Helix' imprint of DC Comics.\n\n\nBloody Mary/Bloody Mary: Lady Liberty\nSet in the year 2012 in a fascistic (mainland) Europe, which is at war with the USA and England. Corporal &quot;Bloody Mary&quot; Malone, a former nun and current commando, is sent to Europe to retrieve a doomsday weapon now in the hands of her former commander. Written by Garth Ennis and illustrated by Carlos Ezquerra.\n\n\nBrainBanx\nWritten by Elaine Lee and featuring artwork by Temujin, the series narrates the tale of the Anna Elysian, a telepathic intelligence operative working undercover in a distant future world.\n\n\nCyberella\nCyberella is a techno-satire and a populist cyberpunk dystopia written by Howard Chaykin and drawn by Don Cameron. Sunny Winston is an 'ordinary citizen' who exhibits aberrant behaviour living in the insular consumer-driven society of a near-future Earth-like world. When her mind merges with a computer program designed to keep the human masses under its sway she becomes Cyberella' a being imbued with various 'super-powers' and who sets about undermining the ambitions of the company that created the program.\n\n\nDead Corps\nSet in a near-future earth where medical technology has opened the possibility for the re-animation of human beings and the dead play an active but sometimes unwilling role in everyday society. Written by Christopher Hinz and illustrated by Steve Pugh, the story follows Detective Sergeant CJ Rataan is the senior officer in a squad of the Paladin Dead Corps an elite but poorly respected team of mixed expired (re-animated) and vital (ordinary living human beings) police officers based out of North Nome, Alaska.\n\n\nThe Dome: Ground Zero\nThe Dome: Ground Zero, is a one-shot graphic novel written and laid out by Dave Gibbons and illustrated Angus McKie, The Dome was notable for its innovative use of computer-rendered graphics to augment McKie's illustrations. Despite suffering by its association with the poorly-received Helix line, The Dome won praise both for the high quality of its art and for its well-constructed storyline set in the south Pacific waters of a recognizably contemporary Earth environment, replete with the conflicting ideologies of US techno-military forces and Christian fundamentalist eco-warriors.\nThe US military successfully test-detonates a Quantum Bomb, an unpredictable new weapon, on a disused island deep in the Pacific ocean despite intervention from Elias Walsh and his congregation of activist ecological protestors. Cities around the Pacific Rim are soon damaged by a variety of seemingly natural phenomena. It becomes apparent to observing military forces that the Quantum Bomb has triggered fallout of a most unexpected kind - a gigantic reflective hemisphere, some ten-miles across and growing, has projected out of the ocean to cover ground zero at the site of the detonation.\n\n\nGemini Blood\nGemini Blood was written by Christopher Hinz and illustrated by Tommy Lee Edwards. It was placed in the same universe as Hinz's Paratwa Saga, featured in his trilogy of novels consisting of Liege-Killer, Ash Ock and The Paratwa. Then - In the last days before Earth's nuclear annihilation, the most feared bio-weapons were the Paratwa - genetically engineered assassins. Now - Earth is a blistered wasteland. The orbital colonies have rebuilt civilization and lived in peace and harmony for more than two hundred years. The deadly Paratwa are extinct, only the stuff of children's nightmares. But people are being butchered in ways that terrify the local authorities. Only one kind of creature could cause this mayhem, and as the body count grows, the name Paratwa is whispered once again.\n\n\nMichael Moorcock's Multivers\nWritten by Michael Moorcock, each monthly issue contained a chapter from three separate storylines featuring distinct groups of characters lifted from Moorcock's sprawling Eternal Champion novels. Whilst each story depicted an independent series of events set across different locations and time-lines, by the conclusion of the title the three plot threads had converged in a logical manner centred around their mutual search for the Silverskin, an enigmatic underworld crime figure and recurring protagnonist from Moorcock's novels.\n\n\nSheva's War\nSheva's War is a five-issue fully-painted limited series graphic novel published and was the final title to be released the Helix imprint. Created, written and painted by Christopher Moeller, the story is the second to be located in Moeller's futurustic Iron Empires universe following publication of the Faith Conquers limited series by Dark Horse in 1994.\nThe Iron Empires comprise eight nations of peoples scattered across the Milky Way galaxy; the remains of a decaying human civilization which was once immeasurably vast. For millennia, the alien Vaylen, a parasitic worm-like race, have rolled back the frontiers of inhabited human space, invading the minds of their conquered hosts and gradually eroding human control throughout the galaxy. Ahmi Sheva holds the rank of captain in the planetary Landwehr. Frustrated with life in the company of her much older husband and bored by dalliances with a string of younger lovers, Sheva assumes command of local forces when the Ganasch, the deformed ape-like minions of the Vaylen use to first infiltrate and then invade her planet.\n\n\nStar Crossed\nWritten and illustrated by Matt Howarth, Star Crossed recounts the surrealist tale of a deep-space romance between a genetically engineered ÃƒÂ¼ber-woman and a sentient asteroid.\n\n\nTime Breakers\nTime Breakers narrates the exploits of a self-recruited team of time travellers dedicated to the creation of time paradoxes in the belief that this is the only method to prevent the destruction of time itself. It was written by Rachel Pollack and illustrated by Chris Weston.\n\n\nVermillion\nVermillion is a dark science fantasy comic book series set in an eponymous city located in an imagined far future or alternate reality. The series was conceived and written by multi-award winning author Lucius Shepard.\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:7a58738b75cf8770b6c9742660c23877ead3fabd","amp;dn":"DC+Comics+Helix+Titles","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a58738b75cf8770b6c9742660c23877ead3fabd","infoHashBuffer":{"type":"Buffer","data":[122,88,115,139,117,207,135,112,182,201,116,38,96,194,56,119,234,211,250,189]},"announce":[],"urlList":[]}}