{"title":"Sexually Broken--Cute little Casey bound skullfucked Casey Calve","uid":8233802,"size":1556776064,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:7b5e556c8d820002d8acba0c554e2e0bd05949ad&amp;dn=Sexually+Broken--Cute+little+Casey+bound+skullfucked+Casey+Calve&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"merzedes","files":-1,"time":1362793986,"description":"\nCute little Casey Calvert gets bound, brutally skull fucked, made to cum and beg. Sub-spaced hard! | Casey Calvert | Matt Williams\n\nMarch 8, 2013 \n \n    \nMP4 only.\n     \n \nLittle Casey Calvert is new to the porn industry. She started out doing bondage modeling. Soon after, she made the jump to full boy/girl porn and hasn't looked back. Sometimes it's hard to believe that someone this beautiful and hot is a raging bondage slut.\n\nThis is the Meet and Greet with Casey. We do all the tying on screen and all the action happens in &quot;real time&quot;. We do edit it but, the scene is a flowing ad lib work of art that transpires before your eyes. From fully dressed to sexually destroyed, and you feel part of the action as you watch it play out in real time.\n\nWe make Casey put on her own gag, a huge ring. Then we make her blindfold herself. Before she realizes what is happening she is severely bound elbows touching, on her knees, and being throat fucked. She is completely helpless. The gag hold her mouth wide open, as the cock slides to the back of her throat and beyond. \n\nThe skull fucking is intense, poor little Casey has never had her skull fucked so hard and rough. We turn her throat into a pussy as the cock shows no mercy. Casey struggles, the hard cock punishing her tight throat. Casey finds her self loopy, disorientated as the cock robs her of her need air. Soon Casey is a drooling, eyes crossed and out of focus suck slut. \n\nWe pick Casey up off the floor and bend her over a padded stool. With her head up side down, the cock easily slides deeper down her throat. Huge globs of deep throat spit are now covering her entire face. Casey can do nothing at all but open her mouth for the skull fucking of a lifetime. We quickly move to the other side and the cock slides balls deep into her wet pussy, within seconds her first orgasm rips apart the last of her sanity, and now sweet innocent little Casey is a sex slave, we can make her do anything we want, her will has been broken and we own her sexual soul.\n\nWe never let up, we fuck her pussy, she cums, we move around and fuck her throat, she flashes, we fuck her pussy again, over and over, until liquid is dripping out of every hole and she is staring blankly into nothingness as the cock own hers. She is in sexual survivor cum mode, just a moaning and orgasming whore. \n\nWe tighten up the bondage and Casey find herself immobilized in a back arching tie from hell. The vibrator is pulled out and applied. Casey is transformed into a screaming cumming banshee, as we rip orgasm after orgasm out of her taunt tight helpless body. In the end Casey breath is labored, she is covered in her own spit and drool, her body still twitching involuntarily from the sexual overload we dropped upon her. She will recover, but we own her sexual soul, it is ours to do with what we please, when we please... \n \nScreens   &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/03_08ccalvert/SexuallyBroken-Casey-Calvert-Matt-Williams-Cute-little-Casey-Calvert-gets-bound-brutally-skull-fucked-made-to-cum-and-beg-Sub-spaced-hard.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/03_08ccalvert/SexuallyBroken-Casey-Calvert-Matt-Williams-Cute-little-Casey-Calvert-gets-bound-brutally-skull-fucked-made-to-cum-and-beg-Sub-spaced-hard.php&lt;/a&gt;\n\n10 000 uploads and counting, 11k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n\n","torrent":{"xt":"urn:btih:7b5e556c8d820002d8acba0c554e2e0bd05949ad","amp;dn":"Sexually+Broken--Cute+little+Casey+bound+skullfucked+Casey+Calve","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b5e556c8d820002d8acba0c554e2e0bd05949ad","infoHashBuffer":{"type":"Buffer","data":[123,94,85,108,141,130,0,2,216,172,186,12,85,78,46,11,208,89,73,173]},"announce":[],"urlList":[]}}