{"title":"RemixEvolution - Plummet Damaged 2012 Vocal Attack remix (Antill","uid":7164746,"size":16759118,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7b8a77f8b793bae839f290d7d9277bca646a3409&amp;dn=RemixEvolution+-+Plummet+Damaged+2012+Vocal+Attack+remix+%28Antill&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"RemixEvolution666","files":-1,"time":1333736028,"description":"--------------------------------------------------------\nvisit us on YouTube for more exclusive remixes in 2012!!\n--------------------------------------------------------\nYou should enjoy this one, I freaking love it!!! One of my all time favourite tracks, and one I remade in 2006 with great success (it's listed on the channel if you wish to play it)...this time around I take Fiora and Antillas re-worked 2012 remixes and combine those with some effects and vocals from each remix and the original, and re-order the track completely.  I also have taken around 10 hours to manually insert several background sounds and sections from the original to give this a much fuller sound and as a nod to the original, updating it in a better way IMO. Numerous staged build ups are setup with vocal climaxes. Taking a progressive line with the entire track this is great up very loud when you can appreciate the many nuances of background instrumental insertions and vocal loop overlays. I'm really happy with the end result on this, it comes off sounding better than either of the standalone remixes yet it is distinctly original and has its own unique feel and sound. Published in 720p/HD high quality HQ 44100khz, this is also available for download so inbox me if you want the link, otherwise watch in on here in 360p or preferably 720p to get the full audio quality.\nReleased just in time for Easter 2012!!! Enjoy!!! this track is so awesome!!!\nTags:\nPlummet Damaged 2012 new release &quot;plummet damaged&quot; &quot;vocal attack remix&quot; music damage &quot;plummet damage&quot; antillas vs fiora &quot;fiora damaged&quot; vocal attack remix remixing mix dub edit vinyl mashup mash up &quot;new releases&quot; &quot;2012 releases&quot; &quot;plummet remix&quot; &quot;damaged remix&quot; trance dance electronic vestax korg Kp3 virtualDJ Cooledit &quot;ableton live&quot; DJ mixing RemixEvolution 720p HQ HD &quot;high quality&quot; latest Feat club vocals &quot;high definitioon&quot; 1080p MP3 320kbps clubbing\n--------------------------------------------------------","torrent":{"xt":"urn:btih:7b8a77f8b793bae839f290d7d9277bca646a3409","amp;dn":"RemixEvolution+-+Plummet+Damaged+2012+Vocal+Attack+remix+%28Antill","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b8a77f8b793bae839f290d7d9277bca646a3409","infoHashBuffer":{"type":"Buffer","data":[123,138,119,248,183,147,186,232,57,242,144,215,217,39,123,202,100,106,52,9]},"announce":[],"urlList":[]}}