{"title":"First Fruit","uid":6575438,"size":850089,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7b92ce55fd0e0888c0a06ca7faebb996a899afe8&amp;dn=First+Fruit&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"_F1_","files":-1,"time":1312182610,"description":"Belinda Martineau, &quot;First Fruit: The Creation of the Flavr Savr Tomato and the Birth of Biotech Foods&quot; \nM,gH | 2001 | ISBN: 0071360565 | 269 pages | PDF | 1 MB \n\nIn 1994 a little California biotech startup called Calgene introduced the Flavr SavrTMtomato, the first genetically engineered whole food ever brought to market, and laid the groundwork for the entire agricultural biotechnology industry. \n\nIn a fast-paced narrative full of colorful characters, surprising twists and turns, and several eye-opening revelations, Belinda Martineau chronicles the story behind the making of the Flavr SavrTM, from its conception, through its much-heralded introduction to market, and its ignominious disappearance. As a member of the Calgene team that developed the Flavr SavrTM and secured its regulatory approval, Martineau underwent a transformation from an enthusiastic believer in biotechnology's promise to a battle-weary skeptic. Her account serves as a cautionary tale for the biotech age, offering a revealing look at how the science of genetic engineering is actually done, how corporate decisions are really made in biotech startups, and how the regulatory system in the U.S. does and doesn't work. \n\nMost importantly, First Fruit goes beyond the polarized debate currently surrounding genetically modified foods to illustrate both the benefits and the risks of this new technology.","torrent":{"xt":"urn:btih:7b92ce55fd0e0888c0a06ca7faebb996a899afe8","amp;dn":"First+Fruit","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b92ce55fd0e0888c0a06ca7faebb996a899afe8","infoHashBuffer":{"type":"Buffer","data":[123,146,206,85,253,14,8,136,192,160,108,167,250,235,185,150,168,153,175,232]},"announce":[],"urlList":[]}}