{"title":"The Gods of Ancient Greece: Identities and Transformations","uid":11715914,"size":7426980,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7bbff001255c20dbd794f1ce574f75b57cc0998b&amp;dn=The+Gods+of+Ancient+Greece%3A+Identities+and+Transformations&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1424581317,"description":"The Greek gods are still very much present in modern consciousness. Although Apollo and Dionysos, Artemis and Aphrodite, Zeus and Hermes are household names, it is much less clear what these divinities meant and stood for in ancient Greece. In fact, they have been very much neglected in modern scholarship. This book brings together a team of international scholars with the aim of remedying this situation and generating new approaches to the nature and development of the Greek gods in the period from Homer until Late Antiquity. The book looks at individual gods, but also asks to what extent cult, myth and literary genre determine the nature of a divinity. How do the Greek gods function in a polytheistic pantheon and what is their connection to the heroes? What is the influence of philosophy? What does archaeology tell us about the gods? In what way do the gods in Late Antiquity differ from those in classical Greece? This book presents a synchronic and diachronic view of the gods as they functioned in Greek culture until the triumph of Christianity","torrent":{"xt":"urn:btih:7bbff001255c20dbd794f1ce574f75b57cc0998b","amp;dn":"The+Gods+of+Ancient+Greece%3A+Identities+and+Transformations","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7bbff001255c20dbd794f1ce574f75b57cc0998b","infoHashBuffer":{"type":"Buffer","data":[123,191,240,1,37,92,32,219,215,148,241,206,87,79,117,181,124,192,153,139]},"announce":[],"urlList":[]}}