{"title":"Las Plantas De Los Dioses - Schultes y Hofmann - Spanish","uid":6848845,"size":104100680,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7c17c1bc000bae0c3be44ed0125fa5e9a44ddb40&amp;dn=Las+Plantas+De+Los+Dioses+-+Schultes+y+Hofmann+-+Spanish&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"unpoemaatualma","files":-1,"time":1322446107,"description":"Las Plantas De Los Dioses - Schultes y Hofmann - Spanish / EspaÃƒÂ±ol\n\nEste es uno de los libros mÃƒÂ¡s apreciados por los aficionados a la enteogenia. Y lo es tanto por la calidad de sus textos como por su cuidada ediciÃƒÂ³n, el sinnÃƒÂºmero de bellas imÃƒÂ¡genes que contiene, su gran formato y sus tapas duras. Escrito mano a mano por dos de las grandes eminencias del mundo enteogÃƒÂ©nico (R.E. Schultes, el padre de la etnobotÃƒÂ¡nica, y A. Hofmann, descubridor de la LSD), el libro estÃƒÂ¡ planteado como un tratado divulgativo de gran calidad, mÃƒÂ¡s que como un estudio cientÃƒÂ­fico apto sÃƒÂ³lo para minorÃƒÂ­as especializadas.\n\nSu parte central es el estudio de 14 plantas usadas por culturas antiguas, como el peyote, la ayahuasca, el San Pedro, la iboga, los hongos, la brugmanisa, la cannabis y la Amanita muscaria entre otras. Para cada planta, ademÃƒÂ¡s de un gran nÃƒÂºmero de excelentes imÃƒÂ¡genes, se ofrecen tanto los mitos sobre su origen, sus formas de uso, preparaciÃƒÂ³n, particularidades de las culturas que las han usado y descripciÃƒÂ³n de efectos. A destacar de estos apartados que se incluye informaciÃƒÂ³n referente a varias solanÃƒÂ¡ceas, plantas muy tÃƒÂ³xicas y de efectos poco deseables sobre las que existe poca informaciÃƒÂ³n.\n\nRodeando a este nÃƒÂºcleo central encontramos apartados referentes al estudio moderno de estas plantas, tanto a nivel quÃƒÂ­mico como religioso y antropolÃƒÂ³gico; tambiÃƒÂ©n al empleo actual de los visionarios en psiquiatrÃƒÂ­a. A destacar tambiÃƒÂ©n una secciÃƒÂ³n en la que se ofrece informaciÃƒÂ³n general sobre 91 plantas (localizaciÃƒÂ³n, breve descripciÃƒÂ³n botÃƒÂ¡nica, pueblos que las usan, ilustraciÃƒÂ³n, principios activos), muchas de ellas muy poco estudiadas.\n &lt;a href=&quot;\nhttp://i1195.photobucket.com/albums/aa385/unpoemaatualma/PlantasdelosDioses.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i1195.photobucket.com/albums/aa385/unpoemaatualma/PlantasdelosDioses.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:7c17c1bc000bae0c3be44ed0125fa5e9a44ddb40","amp;dn":"Las+Plantas+De+Los+Dioses+-+Schultes+y+Hofmann+-+Spanish","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c17c1bc000bae0c3be44ed0125fa5e9a44ddb40","infoHashBuffer":{"type":"Buffer","data":[124,23,193,188,0,11,174,12,59,228,78,208,18,95,165,233,164,77,219,64]},"announce":[],"urlList":[]}}