{"title":"The.Legend.Of.Heroes.Trails.In.The.Sky.UPDATE.8-CPY","uid":10701643,"size":100677387,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7c4e0b0008fcda829ce90c65c8e928375a85c30d&amp;dn=The.Legend.Of.Heroes.Trails.In.The.Sky.UPDATE.8-CPY&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mr.Stifmeister","files":6,"time":1407233958,"description":"\nU PRESENTS U\n\nRelease Name....... The.Legend.Of.Heroes.Trails.In.The.Sky.UPDATE.8-CPY\nRelease Date....... 05/08/2014\nShop Release Date..\nFormat.............\nRelease............ DOX\nKind............... RPG\nProtection......... Steam\nFiles N............ 02x15MB\n\nU INFORMATION U\n\nModern society owes much to a mystical technology known as &quot;orbal\nenergy&quot;. Fifty years ago, during what's come to be known as the\n&quot;Orbal Revolution&quot;, the invention of this technology and the &quot;orb\nments&quot; developed from it led to a period of rapid human advancement,\nbirthing innovations of all shapes and sizes, not the least of which\nwas the airliner, or &quot;orbalship&quot; industry. Although the positive\nimpact of this revolution is obvious, every coin has a flipside for\nevery beneficial device developed with these new materials, so too\nwere advanced weapons and other implements of war. Thus, the land\nbecame mired with turmoil, and remains in such a state even now\nEnter, the bracers: an organization established to serve as police\nand intermediaries alike, holding above all else the peace and safety\nof the lands under their jurisdiction. Whenever a citizen is in need\nof assistance, he or she may place a request at the local Bracer Guild\nand be it monster extermination, crime prevention or even peace talks\namong warring nations, the bracers will do whatever they can to resolve\nthe matter cleanly and efficiently\nSome matters require a gentler touch than others, however. When an\norbalship transporting a legendary &quot;S-rank&quot; bracer named Cassius Bright\nsuddenly goes missing, said bracer's daughter, Estelle, and adoptive\nson, Joshua, must join forces in search of him across the entire Kingdom\nof Liberl. And what they find along the way could change both of their\nlives forever\n\nInstructions\n\n-Install the update\n-Copy the crack\n-Enjoy\n\nNote: No changelog available as we speak\n\nU GROUP  U\n\nEstablished in 1999, we are possibly the oldest Italian-based\nrelease group still in activity.  We express a big THANK YOU to\nall those friends who helped us in various forms throughout these\nyears  Don't forget to support the companies and to keep the\nScene about FUN.\n\nFondato nel 1999, CPY e' probabilmente il piu' vecchio gruppo\nrelease in Italia ancora in attivita'.  Ringraziamo DI CUORE tutti\ngli amici che ci hanno aiutati in ogni maniera in questi anni\nRicordate di supportare le compagnie cinematografiche e di\nsoftware, e che la Scena dev'essere basata sul DIVERTIMENTO.\n\nContact: cpyhushmail.com\n\nUU\n\n","torrent":{"xt":"urn:btih:7c4e0b0008fcda829ce90c65c8e928375a85c30d","amp;dn":"The.Legend.Of.Heroes.Trails.In.The.Sky.UPDATE.8-CPY","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c4e0b0008fcda829ce90c65c8e928375a85c30d","infoHashBuffer":{"type":"Buffer","data":[124,78,11,0,8,252,218,130,156,233,12,101,200,233,40,55,90,133,195,13]},"announce":[],"urlList":[]}}