{"title":"Mystic River (2003) NTSC","uid":8265292,"size":7367538688,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:7c7c66a65e74117c63d20f5215c3e6a302cc26de&amp;dn=+Mystic+River+%282003%29+NTSC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"terrapin2012","files":-1,"time":1363475677,"description":"Childhood friends Jimmy Markum, Sean Devine and Dave Boyle reunite following the death of Jimmy's oldest daughter, Katie. Sean's a police detective on the case, gathering difficult and disturbing evidence; he's also tasked with handling Jimmy's rage and need for retribution.\n\nDuring a summer in 1975, Dave Boyle and two friends, Jimmy and Sean, are playing on a sidewalk in Boston when Dave is abducted by two men and subjected to sexual abuse over a period of several days. Eventually escaping, but haunted into adulthood by his trauma, Dave becomes a primary suspect when Jimmy's daughter, Katie, is found murdered. Sean, assigned to investigate the crime, finds himself facing both demons from the past and demons in the present as the circumstances surrounding Katie's death are uncovered.\n\nSummer, 1975: in a tight blue-collar Boston neighborhood, three kids are playing when one is abducted and sexually abused for several days. Jump ahead: the victim, Dave, is haunted by memories and protective of his own son. Jimmy's an ex-con, father of three. Sean is a homicide detective, estranged from his pregnant wife. When Jimmy's teen daughter dies, Sean investigates, Dave's a suspect, and Jimmy vows to find the killer before the cops. The dead girl has a boyfriend whose long-missing father has a history with Jimmy. The boyfriend's a suspect, and when ballistics turns up a link to a gun owned by the young man's father, the case breaks. In the background, wives move events along.","torrent":{"xt":"urn:btih:7c7c66a65e74117c63d20f5215c3e6a302cc26de","amp;dn":"+Mystic+River+%282003%29+NTSC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c7c66a65e74117c63d20f5215c3e6a302cc26de","infoHashBuffer":{"type":"Buffer","data":[124,124,102,166,94,116,17,124,99,210,15,82,21,195,230,163,2,204,38,222]},"announce":[],"urlList":[]}}