{"title":"New Orleans Funk 1960-75 (Soul Jazz) [FLAC] {MKOP}","uid":7588170,"size":304327983,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7ccf8ef07b64c8dcd7010c0767c1d4c6bebd0be6&amp;dn=New+Orleans+Funk+1960-75+%28Soul+Jazz%29+%5BFLAC%5D+%7BMKOP%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mudmashers","files":25,"time":1346466670,"description":"New Orleans Funk~The Original Sound Of Funk 1960-75 (Soul Jazz) [FLAC] {MKOP}\n\nCheck the title -- New Orleans funk is not the same thing as New Orleans R&amp;B or soul, so this may not be the sound that you're expecting. Even if it opens with the Meters, this isn't a compilation that plays to familiar sounds or expectations. Instead, it lays the groundwork for funk as it was known in the '70s or plays forgotten, possibly never-heard sounds from the '70s. So there ain't a single cut here that you will have heard or recognize unless you are an unrepentant New Orleans fanatic; some names are familiar -- the Meters, Lee Dorsey, Eddie Bo, Huey Piano Smith, Allen Toussaint, Dr. John, and Robert Parker -- but apart from Professor Longhair's &quot;Big Chief,&quot; there's not a single thing here that regularly makes New Orleans comps or that will be recognized by anyone outside of the devoted. All 24 selections were chosen on one basis -- whether their recorded grooves were funky enough to be sampled and reappropriated to something else. Most of them are, but that may be beside the point, since this is a collection for record collectors who don't specialize in this style -- they're just looking for grooves. And there are some really good grooves here, but as singles a lot of them fall flat, unless they're delivered by somebody as undeniably assured and engaging as Lee Dorsey, whose two cuts wind up sounding like actual songs because he gives them the illusion of structure, even if they're just jams. Some other songs have the same fate, such as Aaron Neville's &quot;Hercules,&quot; but this, by and large, is about sound, groove, and texture -- and on those terms it's pretty pleasing. Still, this is not a treasure trove of great lost singles, songs, and performances -- just a collection of good grooves worthy of sampling and making for good listening, providing you're into the sound and feel of the funkier side of New Orleans R&amp;B, not the songs. ~Stephen Thomas Erlewine (allmusic)\n\n01. Handclapping Song - The Meters\n02. Hip Drop - The Explosions\n03. Who's Gonna Help Brother Get Further - Lee Dorsey\n04. It's Gonna Rain - Gentleman June Gardner\n05. Check Your Bucket - Eddie Bo\n06. Big Chief - Professor Longhair\n07. Free, Single And Disengaged - Huey 'Piano' Smith &amp; His Clown\n08. Can I Be Your Squeeze - Chuck Carbo\n09. Hercules - Aaron Neville\n10. I've Got Reasons - Mary Jane Hooper\n11. Gator Bait - The Gaturs\n12. Get Out Of My Life Woman - Allen Toussaint\n13. Tell Me What's On Your Mind - Cyril Neville\n14. Handa Wanda - Bo Dollis &amp; Wild Magnolia Mardi Gras Indian...\n15. Love Lots Of Lovin - Lee Dorsey And Betty Harris\n16. Garden Of Four Trees - The Explosions\n17. Dap Walk - Ernie &amp; The Top Notes\n18. Just Kissed My Baby - The Meters\n19. Reborn - Marilyn Barbarin\n20. Mama Roux - Dr. John\n21. Natural Soul Brother - Danny White\n22. Hook 'N' Sling (Pt II)\n23. Here Come The Girls - Ernie K. Doe\n24. Hip-Huggin - Robert Parker\n\nMusic Keep On Playing*Thank You Seeders","torrent":{"xt":"urn:btih:7ccf8ef07b64c8dcd7010c0767c1d4c6bebd0be6","amp;dn":"New+Orleans+Funk+1960-75+%28Soul+Jazz%29+%5BFLAC%5D+%7BMKOP%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ccf8ef07b64c8dcd7010c0767c1d4c6bebd0be6","infoHashBuffer":{"type":"Buffer","data":[124,207,142,240,123,100,200,220,215,1,12,7,103,193,212,198,190,189,11,230]},"announce":[],"urlList":[]}}