{"title":"Memory Turbo 4.1","uid":7672648,"size":1950720,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7d3745e4bd2888d511b53daed58984d7f23d4018&amp;dn=Memory+Turbo+4.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"PoulGotter82","files":-1,"time":1348614951,"description":"######### MemTurbo #########     This effective memory optimization tool will boost your system's performance, but the demo disables some useful options. MemTurbo's well-designed interface logically places the important tools at the forefront, while making other functions easy to access. The program minimizes to your system tray for quick access if needed. Many users may find they use the wizard and let the utility operate unmanaged. Oddly, however, the wizard suggests Auto Recover and Target Free RAM levels, but doesn't automatically set those values.The concepts and information presented through the wizard and help screens is clear and helpful. The default memory optimization functions are easily set up and sufficient for most users. Advanced users will find it easy to further tweak settings to improve system performance. Many functions and tips are easily enabled with single-click buttons and option settings. In addition to tuning memory, this utility includes features to boost priority for active programs, reclaim RAM from idle programs, and force Windows to improve system cache use.","torrent":{"xt":"urn:btih:7d3745e4bd2888d511b53daed58984d7f23d4018","amp;dn":"Memory+Turbo+4.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d3745e4bd2888d511b53daed58984d7f23d4018","infoHashBuffer":{"type":"Buffer","data":[125,55,69,228,189,40,136,213,17,181,61,174,213,137,132,215,242,61,64,24]},"announce":[],"urlList":[]}}