{"title":"Directory Opus 10.0.1.0 Final x86","uid":6476613,"size":25394271,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7d4d6d656ef72e8bdcd1c94828254068f27c9d3f&amp;dn=Directory+Opus+10.0.1.0+Final+x86&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anacondaz","files":-1,"time":1308331280,"description":"Directory Opus 10.0.1.0 Final x86\n\nA file manager is, at its simplest, a utility program which presents lists of files and allows the user to perform actions of some kind on those files. File managers are useful for moving files between folders, making backup copies of files, viewing pictures and playing sounds, running other utility programs on lists of files, deleting unwanted files and many other &quot;housekeeping&quot; tasks.\n\nDirectory Opus goes beyond the simple file manager metaphor, and offers you a complete replacement for Windows Explorer and many other utility programs for handling FTP, ZIP, viewing files and images, running slideshows and more. It provides you with all this within a user-friendly and fully-configurable environment within which you can access and manage your important data with a minimum of effort. Harness the power of your computer like never before!\n\nWhat's New in Directory Opus 10:\n\nFile Management: Changes affecting core file management tasks (appearance and behaviour of the file displays).\nArchives: Changes relating to archive handling (improvements to Zip and support for additional formats like 7zip, etc).\nSearching and Filtering: Changes relating to searching and filtering the file lists (including integrated Windows Search support).\nFile Copying: Changes relating to copying and moving files (including the addition of Copy Queue functionality).\nMetadata: Changes relating to the display and editing of metadata (including the new Metadata Pane).\nLibraries: Expanded support for Windows 7 Libraries, including making the Libraries system available to Windows XP and Vista users.\nNavigation: Changes to folder navigation tasks.\nFolder Tree: Changes to the Folder Tree (improved performance on networks, FTP integration and additional options controlling the appearance).\nFTP: Changes to the FTP client including improved support for additional proxy types.\nWindows 7 Features: Changes to take advantage of new Windows 7 functionality like Jump Lists.\nUtility Panel: Changes relating to the Utility Panel.\nCosmetic Improvements: Changes that are largely cosmetic.\nPreferences: Changes that affect the Preferences system.\nViewer and Preview Panel: Changes that affect the image viewers.\nImage and Audio Formats: Support for additional image and audio formats in file displays and viewers.\nMiscellaneous: Miscellaneous changes and improvements.\nFunctions: Changes to Opus function scripting.\nRaw Commands: Changes to the internal command set.\n\nHome Page -\n","torrent":{"xt":"urn:btih:7d4d6d656ef72e8bdcd1c94828254068f27c9d3f","amp;dn":"Directory+Opus+10.0.1.0+Final+x86","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d4d6d656ef72e8bdcd1c94828254068f27c9d3f","infoHashBuffer":{"type":"Buffer","data":[125,77,109,101,110,247,46,139,220,209,201,72,40,37,64,104,242,124,157,63]},"announce":[],"urlList":[]}}