{"title":"Democracy Now - 18 oct 2011","uid":6753608,"size":457261498,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:7e78453e6df81d49933e968b094ff7ee615327b3&amp;dn=Democracy+Now+-+18+oct+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1318957988,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Oct 18, 2011\n\n- Israeli Soldier Gilad Shalit Released in Exchange for Hundreds of Palestinian Prisoners\n- Poll: Most New York City Voters Want Occupy Wall Street Encampment to Remain\n- Greece: Two Main Unions Prepare to Launch 48-Hour General Strike\n- U.S. Accused of Killing 16-Year-Old American Citizen in Yemen Drone Strike\n- U.S. Considered Cyber-Attack Before Bombing Libya\n- Syria: At Least 25 Killed, Medical Workers Report Harassment\n- Iraq Withdrawal Creates Rift Between White House, Pentagon\n- U.S. Supreme Court to Decide if Firms Can Be Held Liable For International Human Rights Violations\n- Republican Presidential Hopeful Emerges as Financial Industry Candidate of Choice\n- Iowa Republican Caucus to be Held on Jan. 3\n- Questions Remain Surrounding CIA Operative's Role in NYPD\n\n\nSpecial reports\n\n- Freed U.S. Hikers Speak at Occupy Oakland, Express Support for California Prisoners on Hunger Strike\n\nShane Bauer, Josh Fattal and Sarah Shourd, the three American hikers once imprisoned in Iran, made a surprise visit to Occupy Oakland on Monday, less than a month after Bauer and Fattal were released from prison. In July of 2009, the three were arrested while hiking near the Iran-Iraq border. Shourd was released last year. On Monday, the hikers were welcomed by a thrilled crowd of supporters at Occupy Oakland. &quot;These occupations were just starting when we got out, started in New York City, and we were hearing about it, little bit by little bit. But it wasn't until getting back here to this city [Oakland] that it really hit me that this is serious,&quot; Bauer said. &quot;This is big. And I feel proud of it. I feel proud of it, of this happening in my city.&quot; Bauer also criticized Iran for pressuring Masoud Shafii, his former attorney in Iran. Shafii was recently arrested and denied the right to travel abroad.\n\n\n- The New Libya: Exclusive Video on Challenges Facing a Nation Emerging From Gaddafi's 42-Year Rule\n\nU.S. Secretary of State Hillary Clinton is on a surprise visit to the Libyan capital of Tripoli today. She is expected to hold talks with the top officials from Libya's National Transitional Council (NTC). Clinton's visit comes a day after NATO-backed fighters loyal to the NTC claim they have captured most of Bani Walid, one of Col. Muammar Gaddafi's last remaining strongholds. Eight months into the uprising, Libya is peering into an uncertain future. After 42 years under Gaddafi's rule, Libyans long repressed under his regime are publicly speaking out. However, even Gaddafi's most consistent critics say the road ahead is paved with serious challenges. In this exclusive report from inside Libya, Democracy Now! correspondent Anjali Kamat and Jacquie Soohen of Big Noise Films speak with former Libyan exiles, Libyan human rights activists, NTC chair Mustafa Abdel Jalil, prisoners held by the rebel forces, and others.\n\n\n- Noam Chomsky on Israel-Palestine Prisoner Exchange, U.S. Assassination Campaign in Yemen\n\nMIT Professor Emeritus Noam Chomsky, the world renewed linguist and political dissident, spoke Monday night at Barnard College in New York City about the Israeli-Palestinian conflict, just hours before Israel and Hamas completed a historic prisoner exchange. &quot;I think [Israeli soldier Gilad Shalit] should have been released a long time ago, but there's something missing from this whole story. There are no pictures of Palestinian women, no discussion, in fact, in the story of, what about the Palestinian prisoners being released? Where do they come from?&quot; Chomsky says. &quot;There is a lot to say about that. For example, we do not know - at least I do not read it in The Times - whether the release includes the elected officials who were kidnapped and imprisoned by Israel in 2007 when the United States, the European Union, and Israel decided to dissolve the only freely elected legislature in the Arab world.&quot; Chomsky also discussed the recent U.S. assassination of U.S.-born cleric Anwar al-Awlaki in Yemen. &quot;Almost all of the critics, of whom there were not many, criticized the action or qualified it because of the fact that al-Awlaki was an American citizen,&quot; Chomksy says. &quot;That is, he was a person, unlike suspects who are intentionally murdered or collateral damage, meaning we treat them kind of like the ants we step on when we walk down the street - they're not American citizens. They are unpeople, therefore, they can be freely murdered.&quot;\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:7e78453e6df81d49933e968b094ff7ee615327b3","amp;dn":"Democracy+Now+-+18+oct+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e78453e6df81d49933e968b094ff7ee615327b3","infoHashBuffer":{"type":"Buffer","data":[126,120,69,62,109,248,29,73,147,62,150,139,9,79,247,238,97,83,39,179]},"announce":[],"urlList":[]}}