{"title":"Revolutionary Road (2008) 2Lions-Team","uid":5248591,"size":4682106924,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:7e899020923dc8ad1cf5553f901415b3b61d2065&amp;dn=Revolutionary+Road+%282008%29+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"JUULTJE","files":35,"time":1262246383,"description":" Revolutionary Road (2008)\n\nVerenigde Staten / Verenigd Koninkrijk\n119 minuten\n\ngeregisseerd door Sam Mendes\nmet Leonardo DiCaprio, Kate Winslet en Kathy Bates\n\nEind jaren vijftig, Amerika floreert.\nFrank en April Wheeler zijn een jong, aantrekkelijk en veelbelovend stel.\nZe hebben twee leuke kinderen en wonen in een welvarende buitenwijk ergens in Connecticut.\nMaar gelukkig, of zelfs maar tevreden zijn ze niet.\nFrank heeft een saaie kantoorbaan, April treurt om een gefnuikte carriÃƒÂ¨re als actrice.\nZe waren toch voorbestemd om anders te zijn, beter?\nIn een uiterste poging aan hun gezapige burgerbestaan te ontsnappen besluiten ze naar Frankrijk te gaan.\nIn Europa zullen hun bijzondere gaven zich wel kunnen ontwikkelen, ver van de oppervlakkige consumptie maatschappij die Amerika in hun ogen is.\nHun relatie verzandt echter in eindeloos gekibbel en jaloezie, en een drama lijkt onafwendbaar       \n\nEnglish\n\nIt's 1955. Frank and April Wheeler, in the seventh year of their marriage, have fallen into a life that appears to most as being perfect. They live in the Connecticut suburbs with two young children. Frank commutes to New York City where he works in an office job while April stays at home as a housewife. But they're not happy. April has forgone her dream of becoming an actress, and Frank hates his job - one where he places little effort - although he has never figured out what his passion in life is. One day, April suggests that they move to Paris - a city where Frank visited during the war and loved, but where April has never been - as a means to rejuvenate their life. April's plan: she would be the breadwinner, getting a lucrative secretarial job for one of the major international organizations, while Frank would have free time to find himself and whatever his passion. Initially skeptical, Frank ultimately agrees to April's plan. When circumstances change around the Wheelers, April decides she will do whatever she has to to get herself out of her unhappy existence\n\n\nAudio Format.........:English 5.1 DD \n\nVideo................:\n[X] 16:9\n[X] reencoded\n[6] passes\n[5204] bitrate\n\nSubs.................: English  Dutch Swedish  Norwegian  Finnish Danish \nMenu.................: Yes\nGenre................: Drama\nFormaat : DVD5 \nBron : Retail pal\n\n \nGenre : Drama\nWeblink : http://www.moviemeter.nl/film/42866\nWeblink : http://www.imdb.com/title/tt0959337\n \n***************************************** \n\nBrought to you by\n\n\n2Lions Team \n\n\n\n\n\n2Lions-Team for all your Dutch MOVIES and more \n\n***************************************** \n\nDON T HIT AND RUN Niet gelijk afhaken als de film binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!Info \nto the fakers , get a life !!!\t \n\n\n \n \n \n","torrent":{"xt":"urn:btih:7e899020923dc8ad1cf5553f901415b3b61d2065","amp;dn":"Revolutionary+Road+%282008%29+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e899020923dc8ad1cf5553f901415b3b61d2065","infoHashBuffer":{"type":"Buffer","data":[126,137,144,32,146,61,200,173,28,245,85,63,144,20,21,179,182,29,32,101]},"announce":[],"urlList":[]}}