{"title":"Wives and Daughters - Elizabeth Gaskell  (BBC 1999)","uid":6650955,"size":4083850692,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:7f0a88d63561241ae56b54b9130b084b5b0e7048&amp;dn=Wives+and+Daughters+-+Elizabeth+Gaskell++%28BBC+1999%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rosie1966","files":7,"time":1315145552,"description":"Storyline:\n\nFor many years, young Molly Gibson had lived a blissful sheltered life with her widower father. However, her world is shaken with the introduction of new acquaintances and situations. Molly becomes friends with a landed gentry family, which includes two brothers with very different temperaments. Meanwhile, her father marries a widow with a daughter close in age to Molly. Eventually, Molly becomes a trusted confidante for her new friends and family; but the secrets become burdensome, as the gossip begins to circulate about Molly herself.\n\nPBS Information:\n\nElizabeth Gaskell's enchanting tale of romance, scandal, and intrigue in a gossipy English town comes to Masterpiece Theatre in a lavish four-part production of Wives and Daughters, adapted by celebrated screenwriter Andrew Davies. \n\nDavies, who wrote the scripts for such Masterpiece Theatre classics as A Rather English Marriage, Moll Flanders, the House of Cards trilogy, and Middlemarch, found Wives and Daughters to be perfect costume-drama material. It posed a rather interesting problem: Gaskell died just before completing the book. She was obviously aiming at a happy ending, and Davies has supplied the lost denouement with surprise and style. \n\n&quot;Wives and Daughters is about the ordinary mysteries of life,&quot; says producer Sue Birtwistle, previously responsible for the BBC's Pride and Prejudice and Masterpiece Theatre's King Lear. &quot;[It's about] where love comes from, how it grows, how it can break our hearts, how it can bring happiness and fulfillment. It's about the mistakes we make and the secrets we have to keep.&quot;\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:7f0a88d63561241ae56b54b9130b084b5b0e7048","amp;dn":"Wives+and+Daughters+-+Elizabeth+Gaskell++%28BBC+1999%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f0a88d63561241ae56b54b9130b084b5b0e7048","infoHashBuffer":{"type":"Buffer","data":[127,10,136,214,53,97,36,26,229,107,84,185,19,11,8,75,91,14,112,72]},"announce":[],"urlList":[]}}