{"title":"A Historical Dictionary of Psychiatry, 1st Edition{BBS}","uid":6744134,"size":4516422,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7f1445e82653efb0c103d109f68697c5a1b61776&amp;dn=A+Historical+Dictionary+of+Psychiatry%2C+1st+Edition%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1318618887,"description":"This is the first historical dictionary of psychiatry. It covers the subject from autism to Vienna, and includes the key concepts, individuals, places, and institutions that have shaped the evolution of psychiatry and the neurosciences. An introduction puts broad trends and international differences in context, and there is an extensive bibliography for further reading. Each entry gives the main dates, themes, and personalities involved in the unfolding of the topic. Longer entries describe the evolution of such subjects as depression, schizophrenia, and psychotherapy. The book gives ready reference to when things happened in psychiatry, how and where they happened, and who made the main contributions. In addition, it touches on such social themes as &quot;women in psychiatry,&quot; &quot;criminality and psychiatry,&quot; and &quot;homosexuality and psychiatry.&quot; A comprehensive index makes immediately accessible subjects that do not appear in the alphabetical listing. Among those who will appreciate this dictionary are clinicians curious about the origins of concepts they use in their daily practices, such as &quot;paranoia,&quot; &quot;selective serotonin reuptake inhibitors&quot; (SSRIs), or &quot;tardive dyskinesia&quot;; basic scientists who want ready reference to the development of such concepts as &quot;neurotransmitters,&quot; &quot;synapse,&quot; or &quot;neuroimaging&quot;; students of medical history keen to situate the psychiatric narrative within larger events, and the general public curious about illnesses that might affect them, their families and their communities-or readers who merely want to know about the grand chain of events from the asylum to Freud to Prozac. Bringing together information from the English, French, German, Italian, and Scandinavian languages, the Dictionary rests on an enormous base of primary sources that cover the growth of psychiatry through all of Western society.\nSee all Editorial Reviews\nProduct Details\n\n    * Hardcover: 352 pages\n    * Publisher: Oxford University Press, USA; 1 edition (February 17, 2005)\n    * Language: English\n    * ISBN-10: 0195176685\n    * ISBN-13: 978-0195176681","torrent":{"xt":"urn:btih:7f1445e82653efb0c103d109f68697c5a1b61776","amp;dn":"A+Historical+Dictionary+of+Psychiatry%2C+1st+Edition%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f1445e82653efb0c103d109f68697c5a1b61776","infoHashBuffer":{"type":"Buffer","data":[127,20,69,232,38,83,239,176,193,3,209,9,246,134,151,197,161,182,23,118]},"announce":[],"urlList":[]}}