{"title":"idoo Full Disk Encryption v1.0 with Key [TorDigger]","uid":7947855,"size":984710,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7f209c3fa10692f8895c7090c093d54791509aa9&amp;dn=idoo+Full+Disk+Encryption+v1.0+with+Key+%5BTorDigger%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"TorDigger","files":3,"time":1356184809,"description":"idoo Full Disk encryption\n\ndoo Full Disk Encryption is a powerful hard disk encryption software which provides fully protection to your hard disks, and with its pre-boot user identity authentication, it also protect your operationg system from unauthorized access. With the 256-bit AES encryption algorithm, this outstanding hard disk encryption software can protect your data at the physical sector level. More than that, it also supports USB drive encryption, and even you lost your USB drive, no one can access to the data stored in it either.\n\nFunction:\n\n1. Full Disk Encryption.\n2. Pre-boot user identity authentication.\n3. USB drive encryption.\n\nFull Disk Encryption\n\nIt provides automatic security for all information stored in hard drives, including user data, operating system files, temporary and erased files, to give protection to your data to a great extent.\nPre-boot User Identity Authentication\n\nIn order to make sure that only the authorized users can access the system, the user identity must be authenticated before the launching the system.\nUSB Drive Encryption\n\nidoo Full Disk Encryption provides USB/hard drives encryption, with the pre-boot user identity authentication function, it is able to encrypt your whole drives and system files. Those features make it superior to other similar products..\nSuperior data security\n\nidoo Full Disk Encryption is a hard disk encryption software with the features of hardware encryption. Not only can it protect the data itself, but also the hard disks where the data stored. The drives possess a complete computing system, including a CPU used for data encryption and decryption. However, idoo Full Disk Encryption utilize its own CPU, makes the users free from performance issues brought by the software encryption. It is transparent to the users and independent of the operating system, without turning it on or off, it will always keep the data encrypted and protected. idoo Full Disk Encryption closely controls access to drive resources, with no direct memory access and separated program memory from data storage, it minimizes the risk of any backdoor data breach. It functions completely with its own memory, a multitasking operating system and an abundance of storage space, makes the hard disk a closed computing environment.\nSystem Compatibility\n\nWindows 2000/2003/XP/Vista/Windows 7/8 (32&amp;64)\nUser-friendly Interface\n\nidoo Full Disk Encryption possesses powerful function, while the installation and operation are easy. With the user-friendly interface, you can handle it readily.\n\nSystem Requirements:\n\nHardware Compatibility\n\n1.Fully supports Intel Pentium D Dual-Core Processor\n2.AMD Athlonâ„¢ 64X2 Dual-CoreProcessor\n\nSystem Compatibility\n\n1.Windows 7/8 32/64-bit\n2.Windows Vista 32/64-bit\n3.Windows XP 32/64-bit\n4.Windows 2000\n5.Windows Server 2000 32/64-bit\n6.Windows Server 2003 32/64-bit\n7.Windows Server 2008 32/64-bit\n\nHomepage: http://www.idooencryption.com/idoo-full-disk-encryption.htm\n\nInstallation Instructions:\n\n- Install program.\n- Use given key to register.\n- Done, Enjoy.\n","torrent":{"xt":"urn:btih:7f209c3fa10692f8895c7090c093d54791509aa9","amp;dn":"idoo+Full+Disk+Encryption+v1.0+with+Key+%5BTorDigger%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f209c3fa10692f8895c7090c093d54791509aa9","infoHashBuffer":{"type":"Buffer","data":[127,32,156,63,161,6,146,248,137,92,112,144,192,147,213,71,145,80,154,169]},"announce":[],"urlList":[]}}