{"title":"Starship - Sara (2nafish)","uid":5881670,"size":193660932,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:7f40a727c9a0a67b3907bde1f324f7657d98a504&amp;dn=Starship+-+Sara+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1286860923,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Sara&quot; is a #1 hit song by the band Starship. It was sung by Mickey Thomas, of the newly renamed band Starship, from their first album Knee Deep in the Hoopla. The song hit #1 on the Billboard Hot 100 chart on March 15, 1986 staying at that position for one week. It was the band's second #1 hit after the song &quot;We Built This City&quot; hit the mark a few months earlier in 1985. It also became the band's first number-one song on the adult contemporary chart, where it remained for three weeks. Although written by Peter and Ina Wolf, the song was named for Thomas's wife at the time, Sara (nÃƒÂ©e Kendrick).\n\nThe music video for &quot;Sara&quot; prominently features actress Rebecca De Mornay and Thomas in a storyline about a relationship ending, with frequent flashbacks to what is presumably Thomas's character's childhood and the tornado that wrecked his home.\n\nKnee Deep in the Hoopla is the first release by Starship in 1985, the successor band to Jefferson Airplane and later Jefferson Starship. It went platinum, and is best remembered for spawning the #1 hits &quot;We Built This City&quot; and &quot;Sara&quot;.\n\n&quot;We Built This City&quot; was written by Bernie Taupin, Martin Page, Dennis Lambert, and Peter Wolf. A line in this song is the basis of the album's title.\n\nThe track &quot;Desperate Heart&quot;, written by Michael Bolton &amp; Randy Goodrum, also appears on Bolton's album Everybody's Crazy, released the same year.\n\nJefferson Starship is an American rock band that was formed in the early 1970s. Although its recording career and popularity peaked in the early '80s, Jefferson Starship continues to tour as of 2010. The group is a spinoff from Jefferson Airplane and evolved from a 1970 science fiction-themed concept album by then-Airplane member Paul Kantner entitled Blows Against the Empire.\n\nIn June 1984, Paul Kantner, the last remaining founding member of Jefferson Airplane, left Jefferson Starship, and then took legal action over the Jefferson Starship name against his former bandmates. Kantner settled out of court and signed an agreement that neither party would use the names &quot;Jefferson&quot; or &quot;Airplane&quot; unless all members of Jefferson Airplane, Inc. (Bill Thompson, Paul Kantner, Grace Slick, Jorma Kaukonen, Jack Casady) agreed. The band briefly changed its name to Starship Jefferson while legal proceedings occurred, but ultimately the name was reduced to Starship. Freiberg stayed with the band after the lawsuit and attended the first studio sessions for the next album. He became frustrated with the sessions because all the keyboard work in the studio was being done by Peter Wolf (who had played on the sessions for Nuclear Furniture and briefly joined the band on the road for the followup tour) and that was the instrument Freiberg was supposed to be playing.  He left the band and the next album was finished with the five remaining members. In 1984, Gabriel Katona (who had previously played in Rare Earth and Player) joined the band to play keyboards and saxophone on the road with them through the end of 1986.\n\nThe next album, Knee Deep in the Hoopla was released in October 1985 and scored two #1 hits. The first was &quot;We Built This City&quot;, written by Bernie Taupin, Martin Page, Dennis Lambert, and Peter Wolf; the second was &quot;Sara&quot;. The album itself reached #7, went platinum, and spawned two more singles: &quot;Tomorrow Doesn't Matter Tonight&quot; (#26), and &quot;Before I Go&quot; (#68). The band hadn't had a #1 hit record since the original Jefferson Starship released Red Octopus in 1975.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:7f40a727c9a0a67b3907bde1f324f7657d98a504","amp;dn":"Starship+-+Sara+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f40a727c9a0a67b3907bde1f324f7657d98a504","infoHashBuffer":{"type":"Buffer","data":[127,64,167,39,201,160,166,123,57,7,189,225,243,36,247,101,125,152,165,4]},"announce":[],"urlList":[]}}