{"title":"Nouvelle Vague.1990.avi","uid":4625480,"size":732975104,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7fb3b01b74a692a8d7c8e1cb0e4be2d5d3e3edd4&amp;dn=Nouvelle+Vague.1990.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ab-resende","files":1,"time":1231194976,"description":"Godard's (or anyone's) greatest film features fading matinee-idol Alain Delon and the beautiful, enormously talented Domiziana Giordano as archetypal Man and Woman at the end of the twentieth century. The image track tells one story (a narrative involving characters who gradually swap dominant and submissive relationship roles) and the sound track another (the dialogue consists almost entirely of literary quotations from Dante to Proust to Rimbaud to Raymond Chandler, etc.) yet both frequently intersect to create a rich tapestry of sight &amp; sound. Godard uses dialectics involving man and woman, Europe and America, art and commerce, sound and image &amp; upper and lower class to create a supremely beautiful work of art that functions as an affirmation of the possibility of love in the modern world (and a new poetics of cinema) and that also serves as a curiously optimistic farewell to socialism. Unusual for late-Godard is the constantly tracking and craning camera courtesy of the peerless William Lubtchansky. \n\n","torrent":{"xt":"urn:btih:7fb3b01b74a692a8d7c8e1cb0e4be2d5d3e3edd4","amp;dn":"Nouvelle+Vague.1990.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7fb3b01b74a692a8d7c8e1cb0e4be2d5d3e3edd4","infoHashBuffer":{"type":"Buffer","data":[127,179,176,27,116,166,146,168,215,200,225,203,14,75,226,213,211,227,237,212]},"announce":[],"urlList":[]}}