{"title":"Antonio Hill - Inspector Salgado series (Retail)","uid":10376775,"size":5158769,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8004fa5d32145d64a7e4e9ce1d647da5d72a4c3b&amp;dn=Antonio+Hill+-+Inspector+Salgado+series+%28Retail%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TheRose88","files":2,"time":1403015748,"description":"Antonio Hill - Inspector Salgado series - Retail (epub)\n\n01 The Summer of Dead Toys\n02 The Good Suicides  (New June 17/14)\n\n\n\nThe Summer of Dead Toys\nA skillfully plotted tale of misdeeds and murder--introducing Inspector Hector Salgado, a detective with a complicated past, a love of cinema . . . and a tendency to violence. \n\nUnder a hot Barcelona sun, a killer is feeling the heat.\nWhen the death of a vulnerable young witness in a case of human trafficking and voodoo causes the normally calm Police Inspector Hector Salgado to beat someone up, he is moved off the project and sent instead to investigate a teenager's fall to his death in one of Barcelona's uptown areas. As Salgado begins to uncover the inconvenient truths behind the city's most powerful families, two seemingly unsolvable cases are set to implode under the hot Barcelona sun.\n\n\nThe Good Suicides\nThe author of The Summer of Dead Toys returns with the next intense and harrowing thriller in his Inspector Salgado series. \nYoung, free and . . . dead.\n\n\nSenior staff at Alemany Cosmetics company come home with a secret after a team-building course in a remote country house. Now, they are committing suicide, one by one. Soon, they may all be dead. Each has received a photo from an anonymous source of three dogs hanging dead from a tree near the house.\nDeciphering the personalities of these high-earning executives and their power structure, Inspector Salgado has his own way of making them speak. But Barcelona is now freezing cold and the city is hunkering against an unusually cold spell. Can Salgado break the ice before it's too late?","torrent":{"xt":"urn:btih:8004fa5d32145d64a7e4e9ce1d647da5d72a4c3b","amp;dn":"Antonio+Hill+-+Inspector+Salgado+series+%28Retail%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8004fa5d32145d64a7e4e9ce1d647da5d72a4c3b","infoHashBuffer":{"type":"Buffer","data":[128,4,250,93,50,20,93,100,167,228,233,206,29,100,125,165,215,42,76,59]},"announce":[],"urlList":[]}}