{"title":"Metro 2033 - Audiobook (English), read by Rupert Degas","uid":11088970,"size":578432134,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:800ac48c57ca3bd3f1e5440fc3bc5498a46cf1c7&amp;dn=Metro+2033+-+Audiobook+%28English%29%2C+read+by+Rupert+Degas&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"nokite","files":-1,"time":1411495815,"description":"Metro 2033 Audiobook \nIn English, read by Rupert Degas\nAll chapters - 0 to 20\nCompressed\n\nIncludes the Metro Map!\nAlso includes the Metro 2033 e-book in PDF format.\n\nQuality: 64kbps\nNote: This is sufficient quality for an audiobook. Making an audiobook in 192kbps quality does not improve the listening experience.\n\nThis torrent is only for review purposes. If you like it, go and buy the audiobook to support its creators. It's available for sale online.\n\n\nStory:\n\nThe year is 2033. The world has been reduced to rubble. Humanity is nearly extinct and the half-destroyed cities have become uninhabitable through radiation. Beyond their boundaries, they say, lie endless burned-out deserts and the remains of splintered forests. Survivors still remember the past greatness of humankind, but the last remains of civilisation have already become a distant memory.\n\nMan has handed over stewardship of the earth to new life-forms. Mutated by radiation, they are better adapted to the new world. A few score thousand survivors live on, not knowing whether they are the only ones left on earth, living in the Moscow Metro - the biggest air-raid shelter ever built. Stations have become mini-statelets, their people uniting around ideas, religions, water-filters, or the need to repulse enemy incursion.\n\nVDNKh is the northernmost inhabited station on its line, one of the Metro's best stations and secure. But a new and terrible threat has appeared. Artyom, a young man living in VDNKh, is given the task of penetrating to the heart of the Metro to alert everyone to the danger and to get help. He holds the future of his station in his hands, the whole Metro - and maybe the whole of humanity.\n\nÂ©2007 Dmitry Glukhovsky; (P)2012 Orion Publishing Group","torrent":{"xt":"urn:btih:800ac48c57ca3bd3f1e5440fc3bc5498a46cf1c7","amp;dn":"Metro+2033+-+Audiobook+%28English%29%2C+read+by+Rupert+Degas","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"800ac48c57ca3bd3f1e5440fc3bc5498a46cf1c7","infoHashBuffer":{"type":"Buffer","data":[128,10,196,140,87,202,59,211,241,229,68,15,195,188,84,152,164,108,241,199]},"announce":[],"urlList":[]}}