{"title":"Wadada Leo Smith's Golden Quartet","uid":4044622,"size":66448000,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8040d5168092920caafacfb18996be07e2a6825a&amp;dn=Wadada+Leo+Smith%5C%27s+Golden+Quartet&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dfcook","files":5,"time":1203847390,"description":"Wadada Leo Smith&amp;#039;s third Tzadik release finds him in a modern jazz quartet of seasoned jazz cats and legendary improvisers. Pianist Anthony Davis, bassist Malachi Favors Magoustous, and drummer Jack DeJohnette join Smith in creating an unhurried, mature and, frankly, atypical Tzadik release in that even though it may sound somewhat free to more conservative ears, it is hardly antagonistic and is unmistakably a piano jazz quartet. Regardless of classification, this is an album of excellent jazz that is so fresh and well executed as to define and remind what&amp;#039;s great about listening to the music. It&amp;#039;s a pleasant surprise that such an incredible lineup of musicians can come together and yield a musical sum still greater than what you would expect, when considering the individual &quot;parts.&quot; The opening cut, &quot;DeJohnette,&quot; is dedicated to the drummer and offers him a space to romp and roll during a busy solo. In fact, all of the musicians take quite active solos during this piece, which is followed by a tender and softly played number dedicated, appropriately, to Smith&amp;#039;s wife Harumi Makino Smith. Following this comes the upswing of &quot;Celestial Sky...,&quot; which begins with Smith&amp;#039;s muted trumpet that is soon joined by anticipatory drums and bass that seem to barely reign in their excitement and need to run ahead, with Davis taking a mind-filling piano solo that crowns him the standout of this song&amp;#039;s performance. The closing track, a hot, fast-moving piece named &quot;America&amp;#039;s Third Century Spiritual Awakening,&quot; is another highlight of this impressive album. Golden Quartet is Wadada Leo Smith&amp;#039;s strongest date as a leader in quite some time and certainly is his best among his releases on Tzadik.\n\n1 \tDeJohnette \tSmith \t15:15\n2 \tHarumi \tSmith \t6:57\n3 \tCelestial Sky and All the Magic: A Memorial for Lester Bowie \tSmith \t15:29\n4 \tThe Healer&amp;#039;s Voyage on the Sacred River \tSmith \t7:35\n5 \tAmerica&amp;#039;s Third Century Spiritual Awakening","torrent":{"xt":"urn:btih:8040d5168092920caafacfb18996be07e2a6825a","amp;dn":"Wadada+Leo+Smith%5C%27s+Golden+Quartet","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8040d5168092920caafacfb18996be07e2a6825a","infoHashBuffer":{"type":"Buffer","data":[128,64,213,22,128,146,146,12,170,250,207,177,137,150,190,7,226,166,130,90]},"announce":[],"urlList":[]}}