{"title":"Lucy V Morgan -Tousle Me LittleFairyRG","uid":9373514,"size":1459829,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8091ef1e299e9f5847c028440c07baacd5e4284b&amp;dn=Lucy+V+Morgan+-Tousle+Me+LittleFairyRG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SirHates","files":2,"time":1387574093,"description":"[img]http://d202m5krfqbpi5.cloudfront.net/books/1386536813l/18723826.jpg[/img]\n\nTousle Me by Lucy V. Morgan\n\nGenre: New Adult\n\nHe's exquisitely hot. Exquisitely tousled. Exquisitely screwed in the head...\n\nCammibelle Hicks just wants to survive her first year of college. Desperate to forget her troubled past, she throws herself into her degree and book review blog. So what if her life is one long Tumblr page of grumpy cat GIFs? She doesn't need to get out more, and she definitely doesn't need a man. \n\nHunter von Styles approaches life like he's spoiling for a fight: with a tempting scowl. A cage-fighting, ex-rocker billionaire, it's unclear why Hunter's at college. Frankly, it makes no sense. Then Cammie falls into him--literally--at a party, and he's obsessed. He needs her more than a moist towelette at a barbecue. \n\nThough Cammie's friends warn her against Hunter, she can't resist his charms; especially not when he buys her shoes. And Goodreads. And a unicorn. But when her handsome best friend, medieval re-enactor Archer Riddick, makes a play for her heart--and challenges Hunter to a jousting match--it turns out that Hunter has demons of his own. Demons that aren't real ones, but metaphorical ones--which are MUCH WORSE, when you think about it... \n\nJoin Hunter and Cammie on an emotionally exhausting journey into love.","torrent":{"xt":"urn:btih:8091ef1e299e9f5847c028440c07baacd5e4284b","amp;dn":"Lucy+V+Morgan+-Tousle+Me+LittleFairyRG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8091ef1e299e9f5847c028440c07baacd5e4284b","infoHashBuffer":{"type":"Buffer","data":[128,145,239,30,41,158,159,88,71,192,40,68,12,7,186,172,213,228,40,75]},"announce":[],"urlList":[]}}