{"title":"Community Tools + Security For Joomla + Cracks","uid":6572614,"size":12921381,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:809929ba923badfcc4b2424e859b15b3337eaf70&amp;dn=Community+Tools+%2B+Security+For+Joomla+%2B+Cracks&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ultimate__spy","files":-1,"time":1312036815,"description":"Here is some of the best joomla component's, and plugins, that I have collected over some time.\n\nPlease note that some of these plugins and components are crackt software. so with that in mind, use with caution\n\nRSFirewall 1.0.0 rev 28 is the most advanced Joomla! security service that you can use to protect your Joomla! website from intrusions and hacker attacks. RSFirewall! is backed up by a team of experts that are trained to be always up to date with the latest known vulnerabilities and security updates for Joomla!, thus making RSFirewall! the best choice in keeping your website safe.\n\n* Joomla! 1.5 / 1.6 /1.7 native\n* Offers a powerful protection service\n* Your website will be always protected against the newest threats\n* The Active scanner will track and block any intrusion attempt such as SQL injection\n* You won\\\\\\'t have to worry about security leaks once you set the website in Lock-down mode\n* Don\\\\\\'t worry about 3rd Party extensions vulnerability. RSFirewall! protects all your Joomla! website\n* Allows you to scan and fix vulnerabilities (no expert knowledge needed).\n* Actively scans Joomla! sensitive file and denies hacker attempts to change them.\n* Filters any request, such as POST, GET, etc. and blocks SQL injection attempts\n* Notifies you by e-mail or even by SMS when a certain level of Alert is generated\n* Always keeps you informed about the latest security updates\n* Sets the Joomla! Installation into Lockdown mode making it impossible for anyone to access your website\\\\\\'s protected areas\n* Denies administrator take-overs\n* Captcha after unsuccessful admin login attempt\n*  anti ddos attack Protect yourself from ddos\n\nJBolo v2.9.1 - Chat for JomSocial, Community Builder &amp; Joomla\n\nJBolo! is a really cool extension that will integrate Facebook &amp; Gmail like chat into Joomla Websites.\n\nThe name JBolo! is derived from the Hindi word \\\\\\'Bolo\\\\\\' which means to talk. Styled to look like the popular chat on Gmail &amp; Facebook, this application promises to be an exciting thing for Social Networks in Joomla.\n\nJBolo! integrates flawlessly with Joomla, CB, Jomsocial, Mighty / People Touch as per your choice.\n\nA Must have for Joomla!, JomSocial &amp; CB based Social Networking websites.\n\nJomsocial 2.2.3\n\nSocial networking sites are amazingly fun for you to set up and expand online relationships and network within your community.\n\nJomSocial makes it easier for you to install joomla social networking on your site. At a glance, we design the joomla social engine from ground up that come with many features out of the box. You can easily enable social networking to collaborate with your community with features such as activity streams, flexible templating &amp; design, photo gallery, video support, organic groups, event management, social graph management, customize profile, private messaging, external social network integration and many more. JomSocial makes top open source social networking software for you.\n\n\nhwdMediaShare PRO 2.2.2_r623 Share media on your Joomla website\n\nWelcome to the hwdMediaShare project. We develop media sharing extensions for the Joomla CMS. We empower Joomla webmasters allowing the easily creation of media-rich online communities. Use hwdMediaShare to give your website users a dynamic, interactive experience. Joomla video and Joomla photo components can vastly improve the appeal of your website. hwdMediaShare contains hwdVideoShare, hwdPhotoShare and hwdRevenueManager.","torrent":{"xt":"urn:btih:809929ba923badfcc4b2424e859b15b3337eaf70","amp;dn":"Community+Tools+%2B+Security+For+Joomla+%2B+Cracks","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"809929ba923badfcc4b2424e859b15b3337eaf70","infoHashBuffer":{"type":"Buffer","data":[128,153,41,186,146,59,173,252,196,178,66,78,133,155,21,179,51,126,175,112]},"announce":[],"urlList":[]}}