{"title":"Black Gods of the Asphalt (2016).epub Gooner","uid":14939207,"size":3772962,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:81995f317b732d865b939c40f3630bd777fc771a&amp;dn=Black+Gods+of+the+Asphalt+%282016%29.epub+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1466012918,"description":"Black Gods of the Asphalt - Religion, Hip-Hop and Street Basketball (2016).epub Gooner\r\n\r\nPublisher: Columbia University Press (24 May 2016)\r\nLanguage: English\r\nISBN-10: 0231177283\r\nISBN-13: 978-0231177283\r\n\r\nJ-Rod moves like a small tank on the court, his face mean, staring down his opponents. &quot;I play just like my father,&quot; he says. &quot;Before my father died, he was a problem on the court. I'm a problem.&quot; Playing basketball for him fuses past and present, conjuring his father's memory into a force that opponents can feel in each bone-snapping drive to the basket. \r\n\r\nOn the street, every ballplayer has a story. Onaje X. O. Woodbine, a former streetball player who became an all-star Ivy Leaguer, brings the sights and sounds, hopes and dreams of street basketball to life. He shows that big games have a trickster figure and a master of black talk whose commentary interprets the game for audiences. \r\n\r\nThe beats of hip-hop and reggae make up the soundtrack, and the ballplayers are half-men, half-heroes, defying the ghetto's limitations with their flights to the basket. Basketball is popular among young black American men but not because, as many claim, they are &quot;pushed by poverty&quot; or &quot;pulled&quot; by white institutions to play it. Black men choose to participate in basketball because of the transcendent experience of the game. \r\n\r\nThrough interviews with and observations of urban basketball players, Onaje X. O. Woodbine composes a rare portrait of a passionate, committed, and resilient group of athletes who use the court to mine what urban life cannot corrupt. If people turn to religion to reimagine their place in the world, then black streetball players are indeed the hierophants of the asphalt","torrent":{"xt":"urn:btih:81995f317b732d865b939c40f3630bd777fc771a","amp;dn":"Black+Gods+of+the+Asphalt+%282016%29.epub+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"81995f317b732d865b939c40f3630bd777fc771a","infoHashBuffer":{"type":"Buffer","data":[129,153,95,49,123,115,45,134,91,147,156,64,243,99,11,215,119,252,119,26]},"announce":[],"urlList":[]}}