{"title":"Wayward Souls v1.32.2 and mod","uid":14219849,"size":87268128,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:81c54054cba6235f9b898ab458c60abb138badf0&amp;dn=Wayward+Souls+v1.32.2+and+mod&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tiropitaki","files":2,"time":1460031577,"description":"Wayward Souls is an action-adventure game built for quick playthroughs and massive amounts of replay value. It was inspired by Spelunky, Secret of Mana, and our previous game, Mage Gauntlet.\r\n\r\nProcedurally generated random levels mean that every time you play the game, it's a different experience. Control one of six characters, all with their own unique playstyles, abilities, and equipment. Explore and fight for survival, in combat where your tactics, positioning, and timing matter.\r\n\r\nMore Features:\r\n- Fancy control scheme with no virtual buttons or sticks to fumble over.\r\n- Unlock new areas, for increasingly punishing difficulty.\r\n- 13 area types, all with different monsters, potential traps, and rare encounters.\r\n- Each character can find equipment combinations that change their gameplay.\r\n- Victory is based on your increasing skill as a player, not solely on grinding.\r\n- Hats.\r\n- No IAP ever, even for the hats. All content updates will be free for our fans.\r\n- Unprecedented scope and variety for an action-adventure game on Android, maybe anywhere.\r\n\r\nSecond Update Plans: MFI controller support, some sort of save sync, boss health bars, more character tweaks, Rogue buffs, and more! You can follow us on twitter or fb \r\n@NoodlecakeGames / *fb*.com/noodlecakestudios\r\n@rocketcatgames / *fb*.com/rocketcatgames\r\n\r\nReach us to give requests or feedback on the game:\r\n\r\nfb* is not allowed in the description\r\n\r\nWhat’s new:\r\n1.32.0\r\n- Major new feature: Pet system! You now have a small chance of finding different pets in the dungeon. Some pets attack, some provide stat bonuses\r\n- Testing a better animation system with more frames for walk animations. Using the pets to test them for now, let us know what you think!\r\n\r\n- New rare content and rooms added\r\n- Lots of other tweaks under the hood\r\n1.32.1 - Small tweaks and fixes\r\n1.32.2 - Added Gauntlet Mode! 6 floor dungeon that's quick to play but extremely difficult!\r\n\r\nMod Info:\r\nUnlimited money\r\n\r\nRequires Android OS 2.3 and up","torrent":{"xt":"urn:btih:81c54054cba6235f9b898ab458c60abb138badf0","amp;dn":"Wayward+Souls+v1.32.2+and+mod","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"81c54054cba6235f9b898ab458c60abb138badf0","infoHashBuffer":{"type":"Buffer","data":[129,197,64,84,203,166,35,95,155,137,138,180,88,198,10,187,19,139,173,240]},"announce":[],"urlList":[]}}