{"title":"DJ Shadow - The Outsider (Japan Lmtd 2006)","uid":4613965,"size":206405220,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:834091743bfc80be8759e1076b786b4461add496&amp;dn=DJ+Shadow+-+The+Outsider+%28Japan+Lmtd+2006%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"FatFreddy257","files":-1,"time":1230741515,"description":"DJ Shadow - The Outsider (Japan Limited Edition Enhanced)\n\n\nLabel:\t\tUniversal Music (Japan)\nCatalog#:\tUICI-1048\nFormat:\t\tCD, Album, Limited Edition\nCountry:\tJapan\nReleased:\t09 Oct 2006\nGenre:\t\tElectronic, Hip Hop, Jazz\nStyle:\t\tBreakbeat, Future Jazz, Drum n Bass\nNotes:\t\tThis is the Japanese release of &quot;The Outsider.&quot; It differs from the USA release in that it features the extra track &quot;Purple Grapes (featuring The Team)&quot; and also includes the video for &quot;3 Freaks&quot;.\n\n\nTracklisting:\n\n01 - Outsider Intro (2:19)\n02 - This Time (I'm Gonna Try It My Way) (3:05)\n03 - 3 Freaks (3:47)\n04 - Droop-E Drop (0:18)\n05 - Turf Dancing (4:32)\n06 - Keep Em Close (3:06)\n07 - Seein Thangs (3:40)\n08 - Broken Levee Blues (2:07)\n09 - Artifact (Instrumental) (2:57)\n10 - Backstage Girl (7:22)\n11 - Triplicate - Something Happened That Day (3:44)\n12 - The Tiger (4:55)\n13 - Erase You (6:58)\n14 - What Have I Done (5:24)\n15 - You Made It (2:47)\n16 - Enuff (4:28)\n17 - Dats My Part (4:03)\n18 - Purple Grapes (5:20)\n19 - 3 Freaks (Video) (3:30)\n\n\nRelease info:\n\nIt's been four years since the 'Private Press' album and in that time a lot has happened to DJ Shadow aka California turntablist Josh Davis. The man renowned for his cinematic instrumental hip-hop soundscapes has discarded the baggage of predictable expectations and performed a musical U-turn back to his love of early 'party rap' and in particular, the sounds surrounding him in his Bay Area home. There's still some dark, emotional intent in Shadow's new work, but the addition of a host of guest rappers tells us that, a decade on, Shadow is now saying &quot;Hip-hop doesn't suck in 2006&quot;. The first real shocker is an appearance from &quot;Crunk Prince&quot; David Banner (&quot;DJ Shadow up in this motherf***er!&quot;) on 'Seein Thangs' - the track carries a heartfelt message from Mississippi resident Banner with vocals recorded both before and after the events of Hurricane Katrina. The additional inclusion of Q-Tip, Lateef, Phonte from Southern crew Little Brother, and a hand-picked selection of the Bay Area's finest 'Hyphy' rappers confirms Shadow has ripped the hip-hop heart from his sleeve and is displaying it proudly on his chest. But fans from the days of Mo Wax need not despair. \n\nAfter all, DJ Shadow admits he has never fitted comfortably in any one genre and there is still a connection with his seminal early material. 'This Time (I'm Gonna Try It My Way)' employs an inspiring sampled vocal lifted from a 40-year old reel discovered in a disused studio to somewhat explain his new assertiveness in his music, not necessarily trying to please everyone but reflecting his ever-changing tastes. There are also vocal collaborators from across the pond thanks to Jim Abbiss, engineer on 'Private Press' and the UNKLE album 'Psyence Fiction', who introduced Shadow to Leicester's Kasabian (who appear on 'The Tiger') and two appearances from Leeds' Chris James, lead singer of Stateless. \n\n'The Outsider' is a milestone in DJ Shadow's career - the rare sound of an artist making the kind of music he wants to hear himself. It touches areas and genres that the previous albums didn't dare go near and that suits him just fine. As Shadow himself says: &quot;There's songs on this album that I think blow away almost anything else I've ever done. I think song for song it's the best album I've ever made. One thing's for sure - it's going to make it very difficult for people to imitate my sound!&quot;. &quot;In a twilight of a time, there emerges a need for man to comprehend his own bitter fate. Finally resigned to the inevitable beyond, he searches the ages, desperate for stories of insurance, redemption and hope...but there is one tale that has yet been told, the story of 'The Outsider'.&quot; \n\n===================================================================\n\nNo password, Very good quality [VBR up to 320Kbs], Ripped from original, All tagged, Included covers","torrent":{"xt":"urn:btih:834091743bfc80be8759e1076b786b4461add496","amp;dn":"DJ+Shadow+-+The+Outsider+%28Japan+Lmtd+2006%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"834091743bfc80be8759e1076b786b4461add496","infoHashBuffer":{"type":"Buffer","data":[131,64,145,116,59,252,128,190,135,89,225,7,107,120,107,68,97,173,212,150]},"announce":[],"urlList":[]}}