{"title":"THE EGYPTIAN BOOK OF THE DEAD","uid":6799943,"size":314623,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:84e411d3b507339a9e43920b5b277e2fd748789b&amp;dn=THE+EGYPTIAN+BOOK+OF+THE+DEAD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"kafiruwn","files":1,"time":1320662081,"description":"                       The Egyptian Book of The Dead        (format pdf)\n                           \n                           Reu nu per em heru \n                         (Coming forth by day)        translated by E.A. Wallis Budge\n\n\nWhat we call the Egyptian Book of the Dead was known to the Egyptians as Reu nu per em heru translated that means The Chapters of coming forth by day. It is a collection of chapters made up of magic spells and formulas. It was illustrated and written on papyrus. These papyri were commissioned by the deceased before their death. Like most products these text came in different qualities. You could comission the finest quality papyrus money could buy or you could purchase one &quot;off the rack&quot; and have a scribe fill in the blanks with your name.\n\nThis collection of funerary chapters began to appear in Egyptian tombs around 1600 BC. It can be thought of as the deceased's guidebook to a happy afterlife. The text was intended to be read by the deceased during their journey into the Underworld. It enabled the deceased to overcome obstacles and not lose their way. It did this by teaching passwords, giving clues, and revealing routes that would allow the deceased to answer questions and navigate around hazards. It would grant the help and protection of the gods while proclaiming the deceased's identity with the gods. The Papyrus of Ani is one of the finest and most complete examples of this type of Egyptian funerary text to survive. The Papyrus of Ani now resides in The British Museum, London.\n","torrent":{"xt":"urn:btih:84e411d3b507339a9e43920b5b277e2fd748789b","amp;dn":"THE+EGYPTIAN+BOOK+OF+THE+DEAD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"84e411d3b507339a9e43920b5b277e2fd748789b","infoHashBuffer":{"type":"Buffer","data":[132,228,17,211,181,7,51,154,158,67,146,11,91,39,126,47,215,72,120,155]},"announce":[],"urlList":[]}}