{"title":"FS2004 - Dreamfleet Piper Archer 2","uid":3459918,"size":47127524,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8525bf8e97e29d88b6e78a68360ecf7de62ac0c2&amp;dn=FS2004+-+Dreamfleet+Piper+Archer+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"N314AE","files":1,"time":1142839300,"description":"Four different aircraft configurations: Each showing a different pilot / passenger configuration. You will have a choice of pilot-only, pilot and front seat passenger. Pilot, front seat passenger and one rear seat passenger, or pilot and front seat passenger, plus two rear seat passengers. Weights for all, plus baggage can be set using &quot;Config-O-matic&quot;.\n\n\nVirtual Cockpit &amp; Cabin: Nicely detailed and with working gauges, and moving throttles, control wheels, etc. You can fly from the virtual cockpit, or from our complete 2D cockpit and interior (see below).\n\n\nComplete Moving Parts: Ailerons, rudder, stabilator, rudder, and flaps all move. Gear struts compress upon landing, and both cabin door and baggage door open and close.\n\n\nRemovable Engine Cowling: That&amp;#039;s right, with just a press on a key, you can remove the engine cowling and see the 180 hp Lycoming 0-360 engine that lives inside.\n\n\nVisible Interior and Passengers: This, of course, should be expected, and the interior visible from the outside of the aircraft is highly detailed, and includes passengers in the seats (see below for more information about our passengers).\n\n\nFuselage and Lighting Reflections: The same as found on the default FS2002 aircraft, there&amp;#039;s even reflection on the aircraft windows.\n\n\nEven More Details!: From tie down eyelets, to door hinges, to even some of the screws are 3D. You&amp;#039;ll even see the moving control arm that actuates the stabilator, the &quot;petcock&quot; valves used to drain fuel, and an authentic Piper pitot tube under the left wing.\n\n","torrent":{"xt":"urn:btih:8525bf8e97e29d88b6e78a68360ecf7de62ac0c2","amp;dn":"FS2004+-+Dreamfleet+Piper+Archer+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8525bf8e97e29d88b6e78a68360ecf7de62ac0c2","infoHashBuffer":{"type":"Buffer","data":[133,37,191,142,151,226,157,136,182,231,138,104,54,14,207,125,230,42,192,194]},"announce":[],"urlList":[]}}