{"title":"Photo Recovery Genius 1.3-ZWT","uid":4049991,"size":1849309,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:857c7474b59c14d81045a05d66ef88346beb6e6a&amp;dn=Photo+Recovery+Genius+1.3-ZWT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"apirateslifenet","files":4,"time":1204072095,"description":"Photo Recovery Genius is a risk-free and READ ONLY digital photo recovery software. Modern digital cameras and flash cards allow rewriting photo and video files many times and sometimes important files can be deleted or lost by mistake. The program will help you to restore deleted or unreadable photos and videos at once. Photo Recovery Genius recovers photos and video from various media storage devices, such as digital cameras, hard drives, CD/DVD disks, mobile phones and all types of flash cards like CompactFlash(type I/II), IBM Microdrives, SmartMedia, MultiMedia (MMCs), Secure Digital (SD), SONY Memory Stick and others. This photo recovery software recovers photo from damaged flash cards and even after formatting the media storage device.\n\nRecovery Ability:\n\n* Files and Folders emptied from the Recycle Bin.\n* Files and Folders deleted using DOS commands (via the command line).\n* Drives that have been accidentally re-formatted - even after a new operating system has been installed.\n* Digital camera storage cards which have been formatted or from which photos have been deleted.\n* Support recovering data from most of the digital camera RAW photograph file.\n\nKey Features\n\n* Support all formats of media used by digital cameras .\n* Support various types of file storage media including: Hard Drives, Floppy disks, Zip Disks, Digital camera cards, USB Drives.\n* Support CD/DVD-ROM under Windows XP/2000/2003/Vista.\n* Support iPod under Windows XP/2000/2003/Vista.\n* It is possible that saving data to any windows drive (including network drives, removable media, etc.).\n* Ability to resume the previous recovery result.\n\nIncluded Keygen By ZWT\n &lt;a href=&quot;\nhttp://www.apirateslife.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.apirateslife.net/&lt;/a&gt;","torrent":{"xt":"urn:btih:857c7474b59c14d81045a05d66ef88346beb6e6a","amp;dn":"Photo+Recovery+Genius+1.3-ZWT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"857c7474b59c14d81045a05d66ef88346beb6e6a","infoHashBuffer":{"type":"Buffer","data":[133,124,116,116,181,156,20,216,16,69,160,93,102,239,136,52,107,235,110,106]},"announce":[],"urlList":[]}}