{"title":"Magpul Dynamics&amp;trade; The Art of the Dynamic Shotgun (HD)","uid":7949646,"size":40658829312,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:85ff8b0847702d223d0589b68cd95d5e1a2f44ef&amp;dn=Magpul+Dynamics%26trade%3B+The+Art+of+the+Dynamic+Shotgun+%28HD%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"thenewb","files":-1,"time":1356231705,"description":"The Art of the Dynamic Shotgun features over five hours of actual live fire class instruction and additional instructional material.\n\nWhile it's the most versatile and violent weapon system in the small arms arsenal, the shotgun brings a level of complexity that requires extensive training to master. Join Magpul Dynamics instructors, Travis Haley and Chris Costa, as they guide a diverse group of shot-gunners up an intense ladder of excellence. On this journey, the viewer takes a student perspective, benefiting as the students identify and solve problems with a variety of shotgun platforms. This 3-disc instructional set progresses quickly as it covers the fundamentals of shotgun manipulation, pattering, weapon's configurations, action types, ammo management, and real life complex scenarios for the Home Defender, Law Enforcement Officer, Military Operator, and Competitor.\n\nThree discs, two in high-definition (HD) Blu-ray and one in standard-definition (SD) DVD-Video (for those that want to reference the drills on their laptop at the range, etc.) Region free. Total running time 328 min.\nMade in U.S.A.\n\nITAR\nInternational Traffic in Arms Regulations Controlled Product","torrent":{"xt":"urn:btih:85ff8b0847702d223d0589b68cd95d5e1a2f44ef","amp;dn":"Magpul+Dynamics%26trade%3B+The+Art+of+the+Dynamic+Shotgun+%28HD%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"85ff8b0847702d223d0589b68cd95d5e1a2f44ef","infoHashBuffer":{"type":"Buffer","data":[133,255,139,8,71,112,45,34,61,5,137,182,140,217,93,94,26,47,68,239]},"announce":[],"urlList":[]}}