{"title":"Midnight Club 3 Dub Edition Remix [Spanish] PAL PS2","uid":4885576,"size":3015646462,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:868637014f5322d9620b0866ed103de78ae32bc9&amp;dn=Midnight+Club+3+Dub+Edition+Remix+%5BSpanish%5D+PAL+PS2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"thenoobish","files":61,"time":1241717942,"description":"Plataforma: PS2\nIdioma: EspaÃƒÂ±ol\nRegion: PAL\nGenero:Conduccion\nCalidad: DVD\nFormato: ISO\nTamaÃƒÂ±o: 2.81 GB\nFecha: 29-04-2007\nUploader: DarkLak\n\nTras los buenos registros que alcanzÃƒÂ³ MC3: Dub Edition en sus versiones sobremesa, a pesar de la no ausencia de los siempre presentes pequeÃƒÂ±os fallos, esta vez mÃƒÂ¡s a nivel grÃƒÂ¡fico; y del dulce sabor de boca que quedÃƒÂ³ tras su paso a PSP, Rockstar San Diego se ha animado a presentar una nueva versiÃƒÂ³n, ampliada y revisada, del Midnight Club 3 original. Es aquÃƒÂ­ donde entra en juego este Remix.\n\nBÃƒÂ¡sicamente, esta ediciÃƒÂ³n consigue mejorar sustancial y esencialmente todos y cada uno de los elementos que destacaban en su antecesor. Sin embargo, dichas mejorÃƒÂ­as sobresalen especialmente en dos aspectos; el grÃƒÂ¡fico y el sonoro. Por ahora nos centraremos en el primero.\n\nSobresalen tanto, decimos, que casi parece que estamos ante un juego completamente nuevo. Esta sensaciÃƒÂ³n se consigue gracias a la reestructuraciÃƒÂ³n de cada ciudad, puesto que todas y cada una de ellas han sido ensanchadas en pos de ofrecer una mayor densidad de trÃƒÂ¡fico y otros elementos en pantalla. Los coches se han modificado levemente, suavizando las texturas, ademÃƒÂ¡s de la ampliaciÃƒÂ³n de plantilla que se ha realizado; ahora disponemos de 20 nuevos vehÃƒÂ­culos, distribuidos entre todas las opciones que encontramos a nuestra disposiciÃƒÂ³n, aunque para poder disfrutar de la gran mayorÃƒÂ­a los tendremos que comprar a medida que avancemos, y la apariciÃƒÂ³n de nuevas llantas, pegatinas, degradados...\n\nJunto a San Diego - ciudad desde donde comenzaremos a jugar - , Atlanta y Detroid, podremos acceder a Tokio, que ya vimos puesta en escena en Midnight Club 2, famosa por la extrema dificultad que conlleva superar los retos que en ella encontrÃƒÂ¡bamos. Cada una de las ciudades ofrece sus elementos propios, asÃƒÂ­ por ejemplo en San Diego correremos cerca de las playas, en Detroid encontramos un mapa mucho mÃƒÂ¡s duro plagado de curvas... Tokio es, lÃƒÂ³gicamente, el mayor atractivo para aquellos que ya disfrutaron de DUB Edition. Remodelada por completo supone un nuevo reto, aunque mucho mÃƒÂ¡s asequible que en MNC2.\n\nEl segundo punto destacable es el sonoro, que incluye 25 temas nuevos de porte underground, en los que el hip-hop serÃƒÂ¡ el principal protagonista. Tendremos a nuestra disposiciÃƒÂ³n un apartado extra en el cual podremos hacer nuestros propios mixes.\n\nJunto con las novedades pertinentes, Remix ofrece la posibilidad a aquellos que completaron al 100% DUB Edition de retomar el juego con el mapa de Tokio directamente accesible. De esta forma, comenzaremos el juego desde el 77%, con casi todos los mapas y coches accesibles.","torrent":{"xt":"urn:btih:868637014f5322d9620b0866ed103de78ae32bc9","amp;dn":"Midnight+Club+3+Dub+Edition+Remix+%5BSpanish%5D+PAL+PS2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"868637014f5322d9620b0866ed103de78ae32bc9","infoHashBuffer":{"type":"Buffer","data":[134,134,55,1,79,83,34,217,98,11,8,102,237,16,61,231,138,227,43,201]},"announce":[],"urlList":[]}}