{"title":"Sword of the Stars The Pit &amp; Mindgames DLC 1.1.9","uid":9050695,"size":952931027,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:89c9caba453a438c3a308f860b380545daf1d991&amp;dn=Sword+of+the+Stars+The+Pit+%26amp%3B+Mindgames+DLC+1.1.9&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"prototype.06","files":-1,"time":1381864535,"description":"This is: Sword of the Stars The Pit &amp; Mindgames DLC 1.1.9\n\nFinally got the new update. Some good stuff changed (like being able to MODIFY AND SAVE THE KEY BINDINGS PROPERLY, PFFFTT!), along with bug fixes, a new monster, a weapon, a recipe, and a single, sparkly, beautifully-typed... message. Go for it!!!\n--------------------------------------\n\n\nv1.1.9 CHANGELOG\n- Key and Controller bindings are now saved automatically when exiting the options screen.\n- Fixed bug: Once all messages have been decrypted, old messages could be unlocked, but still not decrypted.\n- Fixed bug: SotSdex message viewer now clears its contents when the selected message is deleted.\n- Added option to mute sounds when game is in background.\n- ADDED EXTRA SHORTCUT SLOTS (Hold ALT to access them).\n- Reduced damage from fire versus mecha/cyborg.\n- Increased damage from acid versus mecha/cyborg.\n- Characters with Fear cannot set or disarm traps.\n- Added skill to recipe details in SotSdex.\n- Hold CTRL to drag a 1 item from a stack (10 items if stack has 20 or more) with the mouse.\n- Added new monster, weapon, recipe, and messages!\n\n\n\nDescription:\nHave you found the cure to the plague yet? Even if you have, there's more to The Pit than you at first thought, with lots of new areas to explore, items to find, and new dangers! The Pit: MindGames gives you even more old-school dungeon-diving in the Sword of the Stars sci-fi universe, letting your test your skill against The Pit using the mysterious and gifted Solforce Psion officer or the Tarkan Ranger... the first playable alien character!\nThe Pit will only give up its secrets if you survive and to survive you might need to explore the powerful and deadly potential of your mind!\nMens agitat monstra!\n-2 New playable characters; the Human Psion and Tarka Ranger.\n-10 New floors of ancient, evil science add to the challenge!\n-New room types, including wide, multi-level biospheres! \n-New traps, new weapons, new items, and new recipes! \n-New game mechanics, including 28 Psionic Powers! \n-New Psionic enemies to fight, drawn from the Sword of the Stars universe! \n-2 New Play Modes; &quot;Infinite Mode&quot; as well as &quot;Seriously? Mode&quot;.\n-Expanded meta-game aspects, including the ability to 'bank' XP and spare items from one session and start the next run of the game on a deeper level, using your 'banked' equipment.\n\nSystem Requirements:\nOperating system: Windows XP/Vista/7/8\nProcessor: Intel Pentium 1.6 GHz or equivalent\nMemory: 1 GB RAM\nHard disk space: 500 MB free space\nVideo: 512 MB\nSound: Any Windows compatible sound device, stereo speakers or head phones\nDirectX: DirectX 9.0c\nController support: 2-button mouse, keyboard and speakers\n\n\n\n--------------------------------------\n*Absolutely 100% clean and working!*\n*My upload ain't the best, but I'll seed this forever!*\n*BUY the games you reallllly dig!!!*\n\n**Check my profile for more TPB-exclusive indie games!!!**","torrent":{"xt":"urn:btih:89c9caba453a438c3a308f860b380545daf1d991","amp;dn":"Sword+of+the+Stars+The+Pit+%26amp%3B+Mindgames+DLC+1.1.9","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89c9caba453a438c3a308f860b380545daf1d991","infoHashBuffer":{"type":"Buffer","data":[137,201,202,186,69,58,67,140,58,48,143,134,11,56,5,69,218,241,217,145]},"announce":[],"urlList":[]}}