{"title":"Two.Worlds.II.Castle.Defense.RIP-Unaeashed","uid":6464326,"size":100538387,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:89e2cc57bc20802e3589fba85d2e25e8b493b958&amp;dn=Two.Worlds.II.Castle.Defense.RIP-Unaeashed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MAFIAA.","files":23,"time":1307907262,"description":"\t\nP R E P A R E  T O  B E  U N L E A S H E D\n\nTwo Worlds II: Castle Defense RIP\n\nRelease Date  :  12/06/2011                Protection  :  Serial  Activation\nRelease Type  :  RIP 21x5.00MB            Company    :  Zuxxez Entertainment\n\nRelease Notes\n\nWhile the bloody battle between Gandohars troops and the armies of\nthe Orcs is raging in front of the gates of Oswaroth, the emperor\nwaits in the depths of his palace on the outcome of the struggle for\npower. However, he does not know that an elite troop of Orcs, led by\nRogdor, is making its way through secret paths into the fortress and\nis now close to the portals of the throne room...\n\nUse the one-time opportunity to slip into the role of the Emperor\nGandohar and his henchman Sordahon These villains from the &quot;Two\nWorlds&quot; universe are now playable for the first time ever in this\nstrategy game, thus opening an entirely new perspective into the\nfantastic world of Antaloor. Using foresight and skill, you must\ndefend abandoned ruins, dark forests and winding catacombs against the\nonrushing Orcs. Ward off each attack with clever tactics and weaponry,\ndefending Gandohar's throne in the Oswaroth fortress Are you ready to\nbreak the high score, meeting the ultimate Castle Defense challenge\nagainst online opponents from around the world?\n\nFeatures:\n\nComprehensive campaign mode provides long lasting game motivation\n\nShort-term fun in the Arena mode including five different adventures\n\nContent based on both &quot;Two Worlds&quot; role-playing games\n\nDifferent regions, such as ruins, forests or catacombs\n\nTwo playable characters with special attacks such as Fire Damage\nor Ice Bomb\n\nSix different, upgradeable combat units such as Magicians or Rangers\n\nDozens of different types of enemies in over 20 independent classes\n\nAdvanced unit management with a variety of powers\n\nHuge game world with up to 50 units on the screen simultaneously\n\nIndividual graphics and sound settings for PC and Mac possible\n\nAtmospherically dense soundtrack varies with each individual level\n\nThrilling online high-score hunting in Campaign and Arena modes\n\nRIPPED: Nothing\n\nInstall Notes\n\n1. Unpack the release with WinRAR or equivalent\n2. Install by running setup bat\n3. Start game with TW2CD.exe\n4. Enjoy\n\nAdditional Notes:\n\nAdd &quot;127.0.0.1      secure.zuxxez.com&quot; to your &quot;hosts&quot; file and/or\nblock TW2CD.exe in your firewall\n\nWhen u run it for the first time, choose phone activation and type\nXXXX-XXXX-XXXX-XXXX as serial.\n\nRemember to support quality games\n\nUnleashed salutes all friends of the family, contacts and competition\n\n&quot; Prepare to be Unleashed &quot;","torrent":{"xt":"urn:btih:89e2cc57bc20802e3589fba85d2e25e8b493b958","amp;dn":"Two.Worlds.II.Castle.Defense.RIP-Unaeashed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89e2cc57bc20802e3589fba85d2e25e8b493b958","infoHashBuffer":{"type":"Buffer","data":[137,226,204,87,188,32,128,46,53,137,251,168,93,46,37,232,180,147,185,88]},"announce":[],"urlList":[]}}