{"title":"Mister Lonely - Freakyflicks","uid":4349516,"size":1545234432,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8a34d4ccb48e0026753976f2cbf4b7a43a542a76&amp;dn=Mister+Lonely+-+Freakyflicks&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"luther_b","files":1,"time":1219077738,"description":"Mister Lonely\n2007, dir. Harmony Korine.\n\n\nThere were quite a few fake torrents of this before. This one is not. All credit goes to the original uploader on a private tracker. This upload is mostly for people like me, who live in a country where Korine's films never reach cinemas. If you are lucky enough to have the option of watching Mister Lonely in your local cinema/movie theater, go and see it there.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0475984/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0475984/&lt;/a&gt;\n\n\nIMDB Review:\n\nMister Lonely is a much more colourful film than anything associated with Korine. Its visuals (such as set design, camera angles and cinematography) are very pleasing, accentuated by its seemingly unrelated parallel narratives and absurdist premise. A Michael Jackson impersonator in France meets a Marilyn Monroe impersonator, who introduces him to a Scottish commune full of various impersonators. While superficially the film appears to be frivolous, clearly it has deeper social comments to make about identity, loneliness and alienation, issues the director has been reportedly grappling with personally.\n\nThe other narrative relates to a group of missionaries in Panama, with Werner Herzog portraying a priest, Father Umbrillo, delivering food aid by plane, assisted by various nuns. While the connection between the dual narratives is unclear, this story is strangely surreal, visually alluring and entertaining.\n\nThere is a small flat spot towards the end of the film, but for most of the film's 112 minutes, I had a big smile that was hard to wipe off my face. Charlie Chaplin, Shirley Temple, James Dean, Little Red Riding Hood, Queen Elizabeth, the Pope, The Three Stooges, Abraham Lincoln, Madonna and Buckwheat are all there.\n\nThe humour and irony are used with a clever and skillful blend of under- and over-statement. There is an underlying subtle sadness to some of the characters who, in spite of their eccentric alter egos, remain ordinary people that an audience can relate to. The film is intelligent and emotionally honest. One part is particularly close to the bone for me and brought tears to my eyes. This is Korine's most accessible and enjoyable film. It is full of originality and I highly recommend it.\n\nTech Specs:\n\nComplete name: F:Mister Lonely.avi\nFile size: 1.44 GiB\nPlayTime: 1h 48mn\nBit rate: 1900 Kbps\nAudio: English, no subs\n\nVideo\nCodec: XviD\nBit rate: 1439 Kbps\nWidth: 640 pixels\nHeight: 272 pixels\nAspect ratio: 2.35\nFrame rate: 25.000 fps\n\nAudio\nCodec: AC3\nBit rate: 448 Kbps\nChannel(s): 6 channels\nSampling rate: 48 KHz\n\nFor SCREENSHOTS, see the &quot;New Releases&quot; board at http://freakyflicks.proboards54.com/\n\n******************************** FREAKYFLICKS *********************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n\n\n'If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE'","torrent":{"xt":"urn:btih:8a34d4ccb48e0026753976f2cbf4b7a43a542a76","amp;dn":"Mister+Lonely+-+Freakyflicks","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a34d4ccb48e0026753976f2cbf4b7a43a542a76","infoHashBuffer":{"type":"Buffer","data":[138,52,212,204,180,142,0,38,117,57,118,242,203,244,183,164,58,84,42,118]},"announce":[],"urlList":[]}}