{"title":"South Park Season Four DVDRip {Angelus1609}","uid":6527303,"size":2901432320,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8ae5aa3e23802b75c89fd030c897b86bd9b4ebc1&amp;dn=South+Park+Season+Four+DVDRip+%7BAngelus1609%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Angelus1609","files":17,"time":1310203706,"description":"Summary:\n\nIn the episode &quot;Chef Goes Nanners,&quot; Cartman is left standing alone in the snow after Wendy blithely proclaims her improbable attraction for him to has suddenly vanished. Cartman heaves a heavy sigh, and exits Chaplinesque stage right. But any concerns that South Park creators Trey Parker and Matt Stone had gone soft, or that Cartman would undergo a more sympathetic, Louie De Palma-like makeover are abated in nearly every other episode of South Park's pivotal fourth season. From the &quot;downright immature&quot; trashing of Phil Collins (whose &quot;You'll Be in My Heart&quot; from Tarzan had emerged victorious Oscar night over Parker and Stone's &quot;Blame Canada&quot;) to an episode in which Cartman becomes the unwitting poster child for NAMBLA, South Park gave its viewers much shock value for its basic cable dollar. This was the season that introduced the show's most unlikely breakout star, the wheelchair-bound Timmy, who, despite being only able to say his own name (or perhaps because of it), carried the pathos in his own holiday special, &quot;Helen Keller! The Musical.&quot; This was the season in which Parker and Stone somehow were able to comment with Daily Show immediacy on the Elian Gonzales incident (&quot;Quintuplets 2000&quot;) and the presidential election debacle (&quot;Trapper Keeper&quot;) within days of the actual events. This was the season in which other &quot;statement shows&quot; skewered the South Carolina confederate flag controversy (&quot;Chef Goes Nanners&quot;) and hate-crime legislation (&quot;Cartman's Silly Hate Crime 2000&quot;). This was also the season in which the South Park kids graduated to the fourth grade, we got a harrowing look inside Cartman's brain (&quot;Helen Keller!&quot;), and estranged lovers Saddam Hussein and Satan were reunited (in a two-parter, no less!).\n\nEpisodes not appreciated in their time can now be seen with fresh eyes. &quot;Pip,&quot; hosted by Malcolm McDowell, and featuring none of the South Park regulars, is a faithful abridgement of Charles Dickens's Great Expectations, monkey robots notwithstanding. As in the season 3 set, Parker and Stone provide brief, &quot;fun-size commentary&quot; that address their censorship skirmishes with Comedy Central and illuminate the inspiration and backstory for each episode. To quote the pro-commercialism holiday episode, &quot;A Very Krappy Christmas,&quot; &quot;If we all buy presents, everyone benefits.&quot; For South Park fans, this boxed set is an excellent start. --Donald Liebenson\n\nAudio For All Episodes:\n\nEncoded - VBR (Variable Bit Rate)\nCodec - 0x0055 MPEG-1 Layer 3\nBitRate - 109kb/s\nLanguage - English\n\nVideo For All Episodes:\n\nVideo Stream - MPEG-4\nEncoder - XViD\nCodec - XviD ISO MPEG-4\nAverage BitRate of Video Stream - 917kb/s\nFrames Per Second - 23.976\nReolution - 512x384\n\nEpisode Index:\n\n\nEpisode One:\n&quot;The Tooth Fairy's Tats 2000&quot;\nOriginal Air Date: 4-5-2000\nCartman impersonates the Tooth Fairy when he learns there's money to be made from harvesting the teeth of underprivileged kids. However, the leader of a dentists' organization sets out to stop him.\n\nEpisode Two:\n&quot;Cartman's Silly Hate Crime 2000&quot;\nOriginal Air Date: 4-12-2000\nCartman is sentenced to juvenile hall and his friends plan to get him out. Meanwhile, he begins to adjust to life on the inside.\n\nEpisode Three:\n&quot;Timmy 2000&quot;\nOriginal Air Date: 4-19-2000\nMr. Mackey excuses Timmy from homework when he mistakenly thinks the boy is suffering from Attention Deficit Disorder; then Cartman and his friends try to develop the same affliction.\n\nEpisode Four:\n&quot;Quintuplets 2000&quot;\nOriginal Air Date: 4-26-2000\nThe South Park media showers attention on a family with quintuplets that moves into the area, and Cartman befriends one of the new residents. Meanwhile, Kenny's mom tries to cash in on the excitement by planning a multiple birth of her own.\n\nEpisode Five:\n&quot;Cartman Joins NAMBLA&quot;\nOriginal Air Date: 6-21-2000\nCartman seeks online companionship from older users after deciding that Stan, Kenny and Kyle aren't mature enough.\n\nEpisode Six:\n&quot;Cherokee Hair Tampons&quot;\nOriginal Air Date: 6-28-2000\nKyle suffers from a rare kidney disease and Cartman may be the only one who can save him, but at a high price.\n\nEpisode Seven:\n&quot;Chef Goes Nanners&quot;\nOriginal Air Date: 7-5-2000\nChef protests against the South Park flag and ignites a town debate that even divides the kids. Meanwhile, Wendy becomes attracted to Cartman.\n\nEpisode Eight:\n&quot;Something You Can Do with Your Finger&quot;\nOriginal Air Date: 7-12-2000\nStan, Kyle, Kenny and Cartman form their own band and hold tryouts for a fifth member.\n\nEpisode Nine:\n&quot;Do the Handicapped Go to Hell?&quot;\nOriginal Air Date: 7-19-2000\nThe boys, scared by Priest Maxi's threats of eternal damnation, scramble to take part in Holy Communion and their first Confession in order to &quot;save&quot; themselves.\n\nEpisode Ten:\n&quot;Probably&quot;\nOriginal Air Date: 7-26-2000\nA follow up to the previous episode, Cartman continues his mission to build a new church in South Park.\n\nEpisode Eleven:\n&quot;The Fourth Grade Years&quot;\nOriginal Air Date: 11-8-2000\nThe fearful boys speculate on the identity of their teacher as they begin the fourth grade, leading them to build a time machine to take them back to the safety of third grade.\n\nEpisode Twelve:\n&quot;Trapper Keeper&quot;\nOriginal Air Date: 11-15-2000\nMr. Garrison orders a recount when the race for kindergarten president is too close to call. Meanwhile, a life form from the future appears in the school yard at South Park Elementary.\n\nEpisode Thirteen:\n&quot;Turkey Day&quot;\nOriginal Air Date: 11-22-2000\nThe boys go to great lengths to ensure the success of their Thanksgiving play.\n\nEpisode Fourteen:\n&quot;Pip&quot;\nOriginal Air Date: 11-29-2000\nThe boys' British classmate, Pip, stars in this spoof of Dickens' classic Great Expectations, set in London.\n\nEpisode Fifteen:\n&quot;Fat Camp&quot;\nOriginal Air Date: 12-6-2000\nCartman is sent to a camp for obese youngsters by concerned family and friends. Meanwhile, Kenny has his own hit TV show, Krazy Kenny. Also, Chef talks to the boys about prostitution.\n\nEpisode Sixteen:\n&quot;The Wacky Molestation Adventure&quot;\nOriginal Air Date: 12-13-2000\nCartman becomes South Park's mayor when the kids take over the town.\n\nEpisode Seventeen:\n&quot;A Very Crappy Christmas&quot;\nOriginal Air Date: 12-20-2000\nThe boys make a video Christmas card when Mr. Hankey's visit is delayed.\n\n\nOther Information:\n\nI burned this complete season to a DVD-R and it works perfectly on XBOX 360 as long as you have the multimedia update available from XBOX Live. If you do not have the update it is simple to get. Simply put the DVD-R into your XBOX 360, then go to video library, current disc, and play an episode and if you do not already have the update it will direct you to the download page of it. The update is free of charge. ENJOY!!!","torrent":{"xt":"urn:btih:8ae5aa3e23802b75c89fd030c897b86bd9b4ebc1","amp;dn":"South+Park+Season+Four+DVDRip+%7BAngelus1609%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ae5aa3e23802b75c89fd030c897b86bd9b4ebc1","infoHashBuffer":{"type":"Buffer","data":[138,229,170,62,35,128,43,117,200,159,208,48,200,151,184,107,217,180,235,193]},"announce":[],"urlList":[]}}