{"title":"POP: Methodology Experiment One (MAC)","uid":9249610,"size":83069194,"categoryP":"games","categoryS":"mac","magnet":"?xt=urn:btih:8c151485868ee5d7551d60f4d5f2186c327ebd90&amp;dn=POP%3A+Methodology+Experiment+One+%28MAC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"RobLach","files":-1,"time":1385441124,"description":"Rob Lach here...\n\n\nReleasing my game as free-to-pirate. \n\n\nIf you like it and want to buy it, or if it isn't to your taste but you still want to support a developer who makes this kind of stuff (for the good of the industry or something), visit http://www.popme1.com to buy it directly from me.\n\nIn any case, I'd really appreciate a vote on Steam's Greenlight. Search for it on Greenlight or follow the link on the game's site.\n\n\n\n\nInstructions in Read Me.\n\n\nDescription:\n\nPOP: Methodology Experiment One is an experimental game devised by Rob Lach. The design of POP was conceived using an experimental approach: first creating the music and then designing the games according to the emotive properties of that music. POP utilizes this altered development methodology to explore the boundaries of game structure and the philosophical context of games. The game ultimately consists of a disjointed series of interactive vignettes coupled together with confusing video transitions leading to an erratic and intense experience.\n\nTo properly embrace the emotional response to the music, Rob Lach forced himself to design each interactive vignette by sticking with the first concept that came into his head while producing each song. Furthermore, each game design was only iterated enough for acceptable functionality, hoping to minimize the diluting effects of excessive refinement and allow for the glimpse at a rawer creative output.\n\nPlaying through POP is an intense and unique experience, constantly changing in style and mechanics. You will be emotionally confused and mentally exhausted.\n\n\nAccolades:\n\n2012 IndieCade - Nominee Main Competition\n2012 Fantastic Arcade - Official Selection\n2012 Rezzed PC and Indies Games Show - Left-Field Collection Selection\n2012 A MAZE Festival Indie Connect - Semi-Finalist\n2012 Independent Games Festival - IGF Nuovo Award (Honorable Mention)\n2012 OnlLive GDC Indie Showcase - Main Selection\n\nWebsite:\n  &lt;a href=&quot;\nhttp://www.popme1.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.popme1.com&lt;/a&gt;\t","torrent":{"xt":"urn:btih:8c151485868ee5d7551d60f4d5f2186c327ebd90","amp;dn":"POP%3A+Methodology+Experiment+One+%28MAC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c151485868ee5d7551d60f4d5f2186c327ebd90","infoHashBuffer":{"type":"Buffer","data":[140,21,20,133,134,142,229,215,85,29,96,244,213,242,24,108,50,126,189,144]},"announce":[],"urlList":[]}}