{"title":"Cher - Believe  (2nafish)","uid":5342285,"size":143026180,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:8cb7b9f317caf2edaab36a966d2ae7d2e56b9f98&amp;dn=Cher+-+Believe++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1265526494,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n\nThe title on this video is incorrect. It says &quot;Strong Enough&quot; but this video is &quot;Believe.&quot; After download you can change the filename.\n\n\n&quot;Believe&quot; is a pop song by American singer-actress Cher from her twenty-third studio album of the same name. It was released in most countries at the end of 1998 by Warner Bros., as the first single from the album. It became one of the best-selling singles of all time. having sold over 10 million copies worldwide. It won the 2000 Grammy Award for Best Dance Recording and was also nominated for Record of the Year.\n\nThe international music video for &quot;Believe&quot;, directed by Nigel Dick, features Cher in a nightclub in a double role as singer on stage, and as supernatural being in a cage (with auto-tuned voice), surrounded by many people to whom she is giving advice. The video includes a woman who is broken hearted and feels that she can't go on when she sees her ex-boyfriend with a new spouse. The version on The Very Best of Cher: The Video Hits Collection is slightly different to the previous version (the version that is also included on the Mallay Believe Bonus VCD) with additional scenes towards the end that were not in the original video. There are also 2 'rough' versions of the video as the song was released in The UK and Europe before a video was completed. The first is a compilation of scenes from the videos of Cher's previous singles &quot;One by One&quot; and &quot;Walkin' in Memphis&quot; and the second includes a brief scene of the Believe video where Cher sings the chorus while the rest of the video is composed of scenes from &quot;One by One&quot;.\n\nThree official remix videos exist for this song. Two of the remix videos were created by Dan-O-Rama in 1999. Both follow different concepts from the original unmixed video. Instead of showing the significance of the lyrics the videos mostly show Cher with different colored backgrounds and people dancing. The two remixes used for these videos were the Almighty Definitive Mix and the Club 69 Phunk Club Mix. The third video entitled Wayne G. Remix was released by Warner Bros. and the concept is similar to the Club 69 Phunk Club Mix video.\n\nCher performed the song during the Do You Believe? Tour, The Farewell Tour and the Cher at the Colosseum While she would lip-synch the entire song on various television programs, she would only lip-synch the synthesized verses when performing on her Believe and Farewell tours and on the 2002 edition of VH1 Divas Live Since 1999, the song has been the encore to all of Cher's concerts.\n\nBelieve is the twenty-third studio album by American singer-actress Cher, released on November 10, 1998 by Warner Bros. Records. The RIAA certified it Quadruple Platinum on December 23, 1999, recognizing four million shipments in the United States; Worldwide, the album has sold more than 20 million copies, making it the biggest-selling album of her career. In 1999 the album received three Grammy Awards nominations including &quot;Record of the Year&quot;, &quot;Best Pop Album&quot; and winning &quot;Best Dance Recording&quot; for the single &quot;Believe&quot;.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:8cb7b9f317caf2edaab36a966d2ae7d2e56b9f98","amp;dn":"Cher+-+Believe++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8cb7b9f317caf2edaab36a966d2ae7d2e56b9f98","infoHashBuffer":{"type":"Buffer","data":[140,183,185,243,23,202,242,237,170,179,106,150,109,42,231,210,229,107,159,152]},"announce":[],"urlList":[]}}