{"title":"Starfleet Command 3 - The Original Series Final Frontier 2.1","uid":8096071,"size":868812724,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8da4adb11f124ee239f04c5b3a35a3ce3e99a863&amp;dn=Starfleet+Command+3+-+The+Original+Series+Final+Frontier+2.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"matrix_hacker_neo","files":4,"time":1359836815,"description":"Star Trek Starfleet Command 3 is a space combat game based in the Star Trek universe.  This torrent includes the following:\n\nStar Trek Starfleet Command 3 ISO*\nStar Trek Starfleet Command 3 Patch 534_b\nThe Original Series (TOS) Final Frontier 2.0 Full install mod\nTOS Final Frontier 2.1 Mod UPDATE (Not the full mod)\n\n*Please note:  The autorun on the ISO does not run due to direct x compatibility issues.  It may run on windows 2000 SP2 or earlier.\n\n\nTOS: Final Frontier mod replaces the Borg with tholian and gets rid of all stock ship and replaces them with TOS style ships for federation, klingon and romulan. Check the pictures below for ships sizes and images.\n\nInstall Order:\nMount/Burn SFC3.iso with daemon tools lite (or alcohol 120%) or burn with nero\nOpen disk folder and run setup (NOT autorun or launch)\nUse CD Key 0000-0000-0000-k28k\nRun 534_b patch\nrun TOS Final Frontier 2.0 mod\nrun TOS Final Frontier 2.1 update\n\nDO NOT CRACK the exe file.  Just use the mounted iso (or burned disk) anytime you want to play this game.  Cracking the exe file will revert the exe file back to 1.00 not 1.01 version 534_b.\n\nAlternatively you can just do the following if you don't want the mod:\n\nMount or burn the ISO image\nOpen Folder and run setup (NOT autorun or launch)\nuse cd key 0000-0000-0000-k28k\nafter install run 534_b patch.\n\nThe 534_b patch rebalances the game out, and fixes various bugs including a bug with Direct X 8.1 or later that would cause the game to crash, and it adds the Scimitar to the Romulans (not included in the TOS Final Frontier Mod), also adds Borg campaign.\n\n\nIf you do decide to install the mod, DO NOT PLAY SINGLE PLAYER.  It will crash because the ships are not there, or it will stick the borg player out in the middle of nowhere with no bases, ships or anyway to get them.  Instead play the Conquest campaigns.  Multi-player works with all 32-bit versions of Windows even Windows 8.  I have never tried multiplayer on 64-bit windows.\n\nThis game also runs on Parallels for Mac, or Wine for Linux.\n\nThe TOS Final Frontier Mod is really meant for hard core trekkies that loved the original series.  It also uses high resolution models instead of the low resolution models that the game came with.\n\n\nAs with all of my torrents, this is done on a laptop and when I am at work, the laptop is shut off and put in the closet.  I will seed as much as I can when I am off work.","torrent":{"xt":"urn:btih:8da4adb11f124ee239f04c5b3a35a3ce3e99a863","amp;dn":"Starfleet+Command+3+-+The+Original+Series+Final+Frontier+2.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8da4adb11f124ee239f04c5b3a35a3ce3e99a863","infoHashBuffer":{"type":"Buffer","data":[141,164,173,177,31,18,78,226,57,240,76,91,58,53,163,206,62,153,168,99]},"announce":[],"urlList":[]}}