{"title":"Liquid Ring Vacuum Pumps, Compressors and Systems","uid":12615752,"size":5381113,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8e396f233e1434cb2a360465ae4ba888b4a76a4c&amp;dn=Liquid+Ring+Vacuum+Pumps%2C+Compressors+and+Systems&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1445513086,"description":"Liquid Ring Vacuum Pumps, Compressors and Systems - Conventional and Hermetic Design - Helmut Bannwarth (Wiley-VCH, 2005).pdf\r\n\r\nISBN 9783527312498\r\n\r\nBased on the very successful German editions, this English version has been thoroughly updated and revised to reflect the developments of the last years and the latest innovations in the field. Throughout, the author makes excellent use of real-life examples and highly praised didactics to disseminate his expert knowledge needed by vacuum technology users and engineers in their daily work at industrial plants, as consultants or in design offices. He covers in detail the most modern liquid ring pumps, with chapters dedicated to maintenance, explosion prevention and general procedures for safety at work with this technology. The whole is backed by a large repository of frequently needed technical data, unit conversions, formulae and current industrial, technical and legal norms without drawing on unnecessary complex or theoretical mathematics. The result is the ideal hands-on introduction to vacuum technology, ranging from fundamentals to in-depth expert knowledge on liquid-ring vacuum pumps","torrent":{"xt":"urn:btih:8e396f233e1434cb2a360465ae4ba888b4a76a4c","amp;dn":"Liquid+Ring+Vacuum+Pumps%2C+Compressors+and+Systems","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e396f233e1434cb2a360465ae4ba888b4a76a4c","infoHashBuffer":{"type":"Buffer","data":[142,57,111,35,62,20,52,203,42,54,4,101,174,75,168,136,180,167,106,76]},"announce":[],"urlList":[]}}