{"title":"The Reader (2008) PAL  2Lions-Team","uid":5248587,"size":4682308636,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:8e7fbccc24825bff261d6846536e2d3f707404cc&amp;dn=The+Reader+%282008%29+PAL++2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"JUULTJE","files":33,"time":1262246215,"description":"The Reader (2008) PAL       \n\n \n\nVerenigde Staten / Duitsland\nDrama / Romantiek\n123 minuten\n\ngeregisseerd door Stephen Daldry\nmet Kate Winslet, Ralph Fiennes en David Kross\n\nWanneer de jonge Duitse scholier Michael Berg op weg naar school ten val komt, wordt hij geholpen door tramconductrice Hanna. Ondanks dat zij tweemaal zo oud is als hij, raakt Michael volledig door haar geobsedeerd. Ze geven zich hartstochtelijk aan de liefde over en daarna leest hij haar telkens voor, het ene boek na het andere, de hele wereldliteratuur. Totdat Hanna van de ene op de andere dag verdwenen is. Wanneer Michael acht jaar later als jonge rechtenstudent het nazitribunaal observeert, staat hij plots tegenover Hanna in een heel andere setting. Hanna staat terecht voor een verschrikkelijk misdrijf, maar weigert zich te verdedigen. Dan realiseert Michael zich dat zijn jeugdliefde een geheim bewaakt dat zij als een grotere schande ziet dan moord.\n\n\nEnglish\n\nTHE READER opens in post-WWII Germany when teenager Michael Berg becomes ill and is helped home by Hanna, a stranger twice his age. Michael recovers from scarlet fever and seeks out Hanna to thank her. The two are quickly drawn into a passionate but secretive affair. Michael discovers that Hanna loves being read to and their physical relationship deepens. Hanna is enthralled as Michael reads to her from &quot;The Odyssey,&quot; &quot;Huck Finn&quot; and &quot;The Lady with the Little Dog.&quot; Despite their intense bond, Hanna mysteriously disappears one day and Michael is left confused and heartbroken. Eight years later, while Michael is a law student observing the Nazi war crime trials, he is stunned to find Hanna back in his life - this time as a defendant in the courtroom. As Hanna's past is revealed, Michael uncovers a deep secret that will impact both of their lives. THE READER is a story about truth and reconciliation, about how one generation comes to terms with the crimes of another.\n\n\n \nCategorie : Beeld \nFormaat : DVD5 \nBron : Retail\n \nOndertitels : Nederlands (Extern)\n \nGenre : Drama\nRomantiek\n \nWeblink : http://www.moviemeter.nl/film/52816\nWeblink : http://www.imdb.com/title/tt0976051\n\t \n\n***************************************** \n\nBrought to you by\n \n\n2Lions Team \n\n\n\n\n\n2Lions-Team for all your Dutch MOVIES and more \n\n***************************************** \n\nDON T HIT AND RUN Niet gelijk afhaken als de film binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!Info \nto the fakers , get a life !!!\t \n \n \n","torrent":{"xt":"urn:btih:8e7fbccc24825bff261d6846536e2d3f707404cc","amp;dn":"The+Reader+%282008%29+PAL++2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e7fbccc24825bff261d6846536e2d3f707404cc","infoHashBuffer":{"type":"Buffer","data":[142,127,188,204,36,130,91,255,38,29,104,70,83,110,45,63,112,116,4,204]},"announce":[],"urlList":[]}}