{"title":"Kate White UNABRIDGED Audio Over Her Dead Body","uid":7212615,"size":925804631,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:8ef71a4d2ed444b3ce8baebafa2621cecd22fda0&amp;dn=Kate+White+UNABRIDGED+Audio+Over+Her+Dead+Body&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HeartsQuilt","files":12,"time":1335290168,"description":"Book 4 (Four) of Kate White's Bailey Weggins sleuthing series. Unabridged audio performed by Julia Gibson.\n\nRipped from unabridged disks, I've made one MP3 file for each disk.  There are 12 files and each one is a little more than an hour long.  \n\nAfter getting the pink slip from her gig at Gloss (&quot;kind of Cosmo for married chicks&quot;), the sexy sleuth takes a job reporting on celebrity crime for Buzz, a gossipy magazine helmed by Mona Hodges, who wears Dolce &amp; Gabbana, not Prada, and is notorious for her &quot;verbal bullwhipping.&quot; When Bailey discovers Mona's body in the editor's office after hours, Bailey's friend and fellow Buzz staffer, Robby Hart, becomes a key suspect in her murder. Soon after acting editor Nash Nolan taps Bailey to do the Buzz investigative article on the crime, Bailey uncovers a zillion other suspects. White keeps the reader guessing whodunit to the end, but the book's main attraction is Bailey herself, with her musings on train-wreck journalism and the perils of falling in love in between worrying if she's next on the killer's list. Catty and bitchy at times, she's all the more appealing because she's not too much of a goody-goody. ","torrent":{"xt":"urn:btih:8ef71a4d2ed444b3ce8baebafa2621cecd22fda0","amp;dn":"Kate+White+UNABRIDGED+Audio+Over+Her+Dead+Body","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ef71a4d2ed444b3ce8baebafa2621cecd22fda0","infoHashBuffer":{"type":"Buffer","data":[142,247,26,77,46,212,68,179,206,139,174,186,250,38,33,206,205,34,253,160]},"announce":[],"urlList":[]}}