{"title":"The Nightmare Before Christmas - O Estranho Mundo de Jack","uid":4877638,"size":4676878492,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:8f1dfb98857126707c824a0d5bd47cf946f8ee13&amp;dn=The+Nightmare+Before+Christmas+-+O+Estranho+Mundo+de+Jack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"vdsred","files":1,"time":1241210726,"description":"Full DVD Rip (w/ Extras)\nAudio Languages:\nEnglish 5.1\nBrazilian Portuguese 2.0\nSpanish 2.0\n\nSubtitles:\nEnglish\nBrazilian Portuguese\nSpanish\n\nSpecs:\nNTSC 720x480\n29,97 fps (Telecine)\n\n&quot;Halloween Town&quot; is a dream world filled with citizens such as deformed monsters, ghosts, ghouls, goblins, vampires, werewolves, and witches. Jack Skellington (&quot;The Pumpkin King&quot;) leads them in a frightful celebration every Halloween, but he has grown tired of the same routine year after year. Wandering in the forest outside the town center, he accidentally opens a portal to &quot;Christmas Town&quot;. Impressed by the feeling and style of Christmas, Jack presents his findings and his (somewhat limited) understanding of the holiday to the Halloween Town residents. They fail to grasp his meaning and compare everything he says to their idea of Halloween. He reluctantly decides to play along and announces that they will take over Christmas.\n\nJack Skellington (Chris Sarandon) ÃƒÂ© um ser fantÃƒÂ¡stico que vive na Cidade do Halloween, um local cercado por criaturas fantÃƒÂ¡sticas. LÃƒÂ¡ todos passam o ano organizando o Halloween do ano seguinte mas, apÃƒÂ³s mais um Halloween, Jack se mostra cansado de fazer aquilo todos os anos. Assim ele deixa os limites da Cidade do Halloween e vagueia pela floresta. Por acaso acha alguns portais, sendo que cada um leva atÃƒÂ© um tipo festividade. Jack acaba atravessando o portal do Natal, onde vÃƒÂª demonstraÃƒÂ§ÃƒÂµes do espÃƒÂ­rito natalino. Ao retornar para a Cidade do Halloween, sem ter compreendido o que viu, ele comeÃƒÂ§a a convencer os cidadÃƒÂ£os a sequestrarem o Papai Noel (Edward Ivory) e fazerem seu prÃƒÂ³prio Natal.","torrent":{"xt":"urn:btih:8f1dfb98857126707c824a0d5bd47cf946f8ee13","amp;dn":"The+Nightmare+Before+Christmas+-+O+Estranho+Mundo+de+Jack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f1dfb98857126707c824a0d5bd47cf946f8ee13","infoHashBuffer":{"type":"Buffer","data":[143,29,251,152,133,113,38,112,124,130,74,13,91,212,124,249,70,248,238,19]},"announce":[],"urlList":[]}}