{"title":"Just Music Player Pro v5.51 [Cracked APK] | (Android) | TPB_1","uid":13229645,"size":6583233,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:9037a29fa4309fcc09960e6a7115166ea72768e9&amp;dn=Just+Music+Player+Pro+v5.51+%5BCracked+APK%5D+%7C+%28Android%29+%7C+TPB_1&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TPB_1","files":1,"time":1452929603,"description":"Just Music Player Pro \r\nJust Music player Pro is a full version of the app without ADS. \r\nEnjoy the best music experience in your Android device with best high quality sound. Browse and play songs on your device faster with this app.\r\n\r\n► In JMP Pro you will find 100.000+ artists and songs, stable streaming, 30+ Genres\r\n► Simple and Easy to use MP3 player and streamer!\r\n► Just Music Player Pro supports all files! Enjoy your favorite music with equalizer, best high quality sound, visualizer, playlist organizer, album art and album cover, share option, folders, bass booster and volume booster, skins, lyrics and so on.\r\nTop Charts by Genres with share option\r\nImmaculate quality\r\nGlobal music search \r\nStunning sound\r\nCreate own playlist\r\nSet up sound using an equalizer\r\nDisplayed Lyrics on screen\r\nOnline Walkman\r\nEqualizer controls\r\nChange theme art and skins\r\nStream new tracks with lyrics on screen.\r\nEnjoy your favorite artists with high sound.\r\nAll-stars cast is provided.\r\n\r\n► You can use this player with shuffle like offline music player! With JMP Pro you can always enjoy free audio tracks online and offline from your SD card (external device memory or from internal PHONE/tablet storage). In Online music you can see 30+ Genres Charts with all top songs and artists by genres, Top Chart with the top and the best music you've ever listened and Global Music Search.\r\n\r\n► Listen to music online or offline\r\nListen to music using your favorite apps with lock screen widgets, choose, switch and enjoy listening to music cleaning your room with widgets on lock screen do it on home screen using your favorite games!\r\nJMP Pro - online audio streamer with equalizer and lyrics\r\n\r\n► Find whatever your soul desires and listen to the player at work, on the go or the way you like it.\r\n\r\n► Just Music Player Pro (Just MP3 player) friendly offers you to listen to:\r\nrock songs, popular music, rap &amp; hip hop, ambient tracks, dance &amp; house music, \r\ninstrumental, metal, alternative, jazz &amp; blues, drum &amp; bass, trance, ethnic, reggae,\r\nclassical, indie pop, electropop, disco, many other songs and artists.\r\n\r\n►You can listen to artists and albums, or create your own playlists of your favorite songs with JMP easily!\r\n\r\n► Enjoy the best music experience with JMP Pro for tablets and Android smart PHONES with MP3 player that supports all files.\r\nJMP Pro music player formats:\r\nMP3, MP2, MP1, OGG, WAV, AIFF, MIDI, AAC, AAC , 3GP, XM, IT, S3M, MOD, MTM, UMX, MO3, MP4, M4A, OTA.\r\n\r\n► Click on 'INSTALL' and get the perfect music for your life just in one click!\r\nListen to any audio track you want at the moment on your own playlist, from folder on your device on one of the genres charts and top chart or songs of your favorite artists in global search. Enjoy nice pictures with pictures art of albums on JMP Pro! Listen to music in the best music player in the world with lock screen widgets using your favorite apps! Offline music player with high sound gives you the opportunity to find enjoyment in music from SD card that doesn't need wifi!\r\n\r\nWhat's in this version : (Updated : Jan 15, 2016)\r\nlittle fixes\r\nRequired Android O/S : 4.1+","torrent":{"xt":"urn:btih:9037a29fa4309fcc09960e6a7115166ea72768e9","amp;dn":"Just+Music+Player+Pro+v5.51+%5BCracked+APK%5D+%7C+%28Android%29+%7C+TPB_1","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9037a29fa4309fcc09960e6a7115166ea72768e9","infoHashBuffer":{"type":"Buffer","data":[144,55,162,159,164,48,159,204,9,150,14,106,113,21,22,110,167,39,104,233]},"announce":[],"urlList":[]}}