{"title":"FSX Sky Ai + SP1","uid":12680779,"size":1371938433,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:907bfbc982c1113fef9272a16169bf9d6e287cbf&amp;dn=FSX+Sky+Ai+%2B+SP1&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"niels95","files":1,"time":1446556144,"description":"SKY AI Traffic is an expansion-application software for flight simulation software &quot;Microsoft Flight Simulator&quot; on IBM-Compatible computers with &quot;Windows&quot; Operating System. When we start our flying session with &quot;Microsoft Flight Simulator&quot; without SKY AI Traffic installed, you will notice that the air traffic in the skies and airports is almost nil and does not correspond to reality, this translates into boring or uninteresting flights.  SKY AI Traffic is a free software that greatly enhances the realism of the simulated flight.  Installing SKY AI Traffic in your flight simulator &quot;Microsoft Flight Simulator&quot; will improve aeronautical traffic conditions in skies and airport around the world, reaching incredible levels of realism.  The simulation air traffic will be real.  You'll see takeoffs, landings and aircraft crossings in the skies from world's airlines, with real original logos and real routes.  No more boring flights and far away from everyday reality.\r\n\r\nSKY AI Traffic gives you all this at no cost because it is produced by a group of people who dedicate part of their free time to this development.\r\n\r\nFeel free to browse our website, we have lots of information to give you.\r\n\r\nFEATURES: \r\n1.- Software &quot;freeware&quot; (no charge).\r\n2.- Transparent and very easy installation (not requires advanced software skills).\r\n3.- Air traffic use is fully automatic in &quot;Microsoft Flight Simulator&quot; software (does not need any configuration).\r\n4.- Low impact in frames per second (FPS) during the execution of your flying session.\r\n5.- Continuous, frequent and free updates on our Webpage.\r\n6.- Compatibility with flight simulators software &quot;Microsoft Flight Simulator 2004&quot;, &quot;Microsoft Flight Simulator X&quot;, &quot;P3D&quot; and &quot;FSX Steam Edition&quot; Compatibility.\r\n7.- Hardware and software skills to use SKY AI Traffic: None","torrent":{"xt":"urn:btih:907bfbc982c1113fef9272a16169bf9d6e287cbf","amp;dn":"FSX+Sky+Ai+%2B+SP1","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"907bfbc982c1113fef9272a16169bf9d6e287cbf","infoHashBuffer":{"type":"Buffer","data":[144,123,251,201,130,193,17,63,239,146,114,161,97,105,191,157,110,40,124,191]},"announce":[],"urlList":[]}}