{"title":"Larisa Shepitko - Voskhozhdeniye AKA The Ascent (1977)","uid":4881739,"size":1579830347,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:90aa90285e1d49f08f0e4b16c54c4de3f83329cf&amp;dn=Larisa+Shepitko+-+Voskhozhdeniye+AKA+The+Ascent+%281977%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"lord_terabyte","files":-1,"time":1241419639,"description":"Larisa Shepitko - Voskhozhdeniye AKA The Ascent (1977)\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0075404/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0075404/&lt;/a&gt;\n\nLanguage\tRussian\nSubtitles\tEnglish\n &lt;a href=&quot;\nhttp://farm4.static.flickr.com/3259/2751869220_ae7f0357b1.jpg?v=0&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://farm4.static.flickr.com/3259/2751869220_ae7f0357b1.jpg?v=0&lt;/a&gt;\n\n\nLarisa Shepitko's fourth and final film, 1977's The Ascent (Voskhozhdeniye), is a bleak trek across the frozen Byelorussian landscape during WWII. Set in the small Eastern European country just north of the Ukraine, it details the ravages its people suffered under the German invasion and their perseverance in the face of crisis and tragedy.\n\nTwo young soldiers break from their squad to find food for the civilians they are escorting to the next safe encampment. Rybak (Vladimir Gostyukhin) is a grizzled trooper who speaks like a veteran, whereas his companion, Sotnikov (Boris Plotnikov), is fresh-faced, fair-haired, and seemingly out of his depth. As they hike through the snowy wilderness, they encounter collaborators, enemy gunmen, and innocent bystanders, and each of these meetings will eventually have their consequences. Sotnikov gets shot in the leg, and the search for shelter in which to thaw out and recuperate pushes them farther from their goal and gets them deeper into trouble. They are eventually captured, along with Demchika (Lyudmila Polyakova), the mother of three whose shack they tried to hide in. Soon, they find themselves in a Sartrean prison alongside the old man (Sergei Yakovlev) they met two nights prior, a supposed collaborator whose life they spared, as well as a young Jewish girl, Basya (Victoria Goldentul), who has refused to name the people who had been hiding her.\n\nTrapped in this dank cellar, with Sotnikov having been tortured and barely hanging on, all five prisoners begin to question how they ended up there and what it would take to survive. Each is faced with a choice, and as secrets are revealed, it's discovered that some have already made just as crucial choices before arriving here. Both the old man and the girl let out information that could hurt them, and Rybak, who has proven to have much less fortitude than his stoic companion has displayed or his own earlier boasts would have suggested, has even had an offer to save his skin by joining the other side. The local commissar, Portnov (Anatoli Solonitsyn), is looking to earn points with his new German bosses, turning his back on the people who knew him. Sotnikov was a classmate of his, and Basya had him as a choirmaster. There is even a suggestion that they could save themselves by exposing his true identity, and that is why he is so hungry to attain Sotnikov's real name.\n\nYet, to give up his real name would be to give up who he really is, something Sotnikov would never do. Shepitko and co-writer Yuri Klepikov, adapting a novel by Vasili Bykov, are clear on what it would mean to put your own self-interest ahead of the good of others. No life touched by Sotnikov or Rybak, no matter how innocent, remains unscathed. (Even sparing the old man ultimately earns him condemnation.) One stays more true to who one is by sticking to one's principles, and as Rybak lets go of his integrity, he becomes less of a man, ironically less capable of even being able to save himself. He has fantasies of running for it, of risking being gunned down, and he can't make himself do it, even after he has promised Sotnikov that he will only become a collaborator in order to escape and take the country back. Even if a peasant woman hadn't called Rybak a &quot;Judas,&quot; his positioning in relation to the near angelic Sotnikov would be clear. Like the Biblical traitor, Rybak is left to question the price he received and whether it's worth what he gave up for it; unlike the Judas of old, however, Shepitko won't let him escape his true punishment easily.\n\nGiven this Biblical allusion, The Ascent could be seen as a rather subversive film. I am always amazed how Russian filmmakers were able to slide their messages past the Communist censors. On one level, The Ascent affirms the struggle of the proletariat against a corrupt world, but like Eisenstein's historical epics, what might appear to be pro-Soviet rhetoric could also be read as a subtle indictment of the same. Replace the Nazis with Stalinist agents, and the message against collaboration with one's enemy is not nearly as &quot;Red&quot; as the first blush would suggest.\n\nThe struggle of the two men to survive and the journey they undertake also reminds me of the work of Andrzej Wajda. Like Wajda, Larisa Shepitko is interested in how these extreme situations of war affect the individual. Just like in Wings, her camera is constantly searching for the humanity in her characters, regardless of how vile they may be. Even Portnov gets a couple of her many lingering close-ups, silently contemplating his actions, framed only by his conscience. The characters are obviously more important to her than the action of a typical war picture. The one full-on fight is shown at the beginning of the movie, obscured by the opening credits, whereas there is nothing to get in the way in the final scenes, as each of the condemned gets one last look into the lens. Shepitko shows them as standing strong, neither breaking down nor even flinching. That fate is saved for the pathetic Rybak, whose final cries of anguish end the film, sounding as sad and useless as everything else he has done up until that point.\n\nThe Ascent became an international sensation when it was released, winning the Golden Bear at the 1977 Berlin Film Festival. Sadly, it was to be Larisa Shepitko's last completed project. She died in 1979 in a car crash on the way to the set for what was to be her next movie. Though it wasn't intended to be her final cinematic statement, The Ascent stands tall as such. The reverberations you will feel as the picture closes won't fade anytime soon, a testament to the incisive eye of a gifted filmmaker and her own testament to the capacity of the individual to persevere.\n &lt;a href=&quot;\nhttp://i260.photobucket.com/albums/ii2/mteste/s-03.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i260.photobucket.com/albums/ii2/mteste/s-03.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i260.photobucket.com/albums/ii2/mteste/s-01.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i260.photobucket.com/albums/ii2/mteste/s-01.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i260.photobucket.com/albums/ii2/mteste/s-05.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i260.photobucket.com/albums/ii2/mteste/s-05.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i260.photobucket.com/albums/ii2/mteste/s-06.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i260.photobucket.com/albums/ii2/mteste/s-06.png&lt;/a&gt;\n\n-----not my rip------\n\n~~~~~~ Voskhozhdeniye.avi ~~~~~~                                     \n                                                               \nFile Size (in bytes):...........................1,579,773,952                     \n                                                                                \n--- Video Information ---                                                       \nVideo Codec Name:...............................XviD 1.1.2 Final              \nDuration (hh:mm:ss):............................1:49:15                \nFrame Count:....................................157160             \nFrame Width (pixels):...........................608                  \nFrame Height (pixels):..........................448                  \nAspect Ratio:...................................1.357                     \nFrames Per Second:..............................23.976          \nVideo Bitrate (kbps):...........................1731                 \n......MPEG-4......B-VOP........................                    \nQuality Factor (bits/pixel)/frame:..............0.265&quot;                     \n                                                                                \n--- Audio Information ---                                                       \nAudio Codec:....................................0x2000 (Dolby AC3) AC3                   \nAudio Sample Rate (Hz):.........................48000             \nAudio Bitrate(kbps):............................192                 \nAudio Bitrate Type (&quot;CBR&quot; or &quot;VBR&quot;):............CBR            \nAudio Channel Count:............................1           \n\nFreakyflicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n\n\n'If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE ","torrent":{"xt":"urn:btih:90aa90285e1d49f08f0e4b16c54c4de3f83329cf","amp;dn":"Larisa+Shepitko+-+Voskhozhdeniye+AKA+The+Ascent+%281977%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90aa90285e1d49f08f0e4b16c54c4de3f83329cf","infoHashBuffer":{"type":"Buffer","data":[144,170,144,40,94,29,73,240,143,14,75,22,197,76,77,227,248,51,41,207]},"announce":[],"urlList":[]}}