{"title":"Sommersturm (eng subs) [2004] Marco Kreuzpaintner","uid":6867270,"size":735804813,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:915612d84dd587ce387196b5a96ce6e4ead779e0&amp;dn=Sommersturm+%28eng+subs%29+%5B2004%5D+Marco+Kreuzpaintner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"ThorntonWilde","files":-1,"time":1323149913,"description":" &lt;a href=&quot;http://bayimg.com/MALAHAAdE&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/MALAHAAdE&lt;/a&gt;\n\nSummer Storm (2004) \n\nSommersturm (original title) \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0420206/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0420206/&lt;/a&gt;\n\nGerman language with English subtitles\n\nSummer Storm (German: Sommersturm) is a 2004 German coming-of-age film directed by Marco Kreuzpaintner, starring Robert Stadlober, Kostja Ullmann, Alicja Bachleda-Curus, and Marlon Kittel. The story is set to the background of a rowing regatta, which climaxes into a summer storm.\n\nTobi and Achim are best friends, so close in fact that they jump at the chance to spend extra time together as cox and oarsman of their local rowing team, when the team leaves for summer camp for the national junior competition. Yet equally training alongside them is Achim's girlfriend Sandra, whose best friend Anke just happens to have the hots for Tobi. And therein lies the problem. For whilst Achim is more than happy to engage in lip-service with Sandra, Tobi just doesn't feel the same way about Anke. Indeed if anything, he wishes her lips were those of his best friend ... but surely that doesn't mean he's gay? \n\nThankfully camping it onto the riverside scene to give advice and a lot more, is the rival QUEERSTROKE rowing team, an open bunch of gay boys who Tobi feels increasingly drawn to. As a sunburnt back gives way to more than just a spot of manly massage, Tobi comes to question his sexuality and the realisation that his feelings for Achim have gone way past those of mere friendship. \n\nBeautifully filmed, with the scenic photography of the landscape mixing seamlessly with lingering camera shots of the male form in all of its athletic glory, this uplifting variation on the theme of coming out from Germany is in many ways a hybrid of Forgive &amp; Forget and Beautiful Thing, given that it relates the 'love for your best friend' scenario of the former, mixed with the gradual realisation of one's sexuality being 'different to those around you' of the latter. \n\nYet this feature is not based on fiction. Rather this is, in part, an autobiographical work, inspired by the experiences of its director who fell in love with his best friend Achim. Only here Kreuzpaintner does not preach at you, preferring instead to bring to the fore the serious issue of homophobia, by way of the boys from the straight side of town being forced to confront their fears and prejudice of homosexuality when one of their own turns out to bat, or should that be row, for the other team. \n\nAided by an energetic young cast who naturally covey the raw emotions of teenagers desperate to assert their sexuality - whatever form that may take, the net result is a guaranteed crowd-pleaser, laced as it is with a series of perfectly timed comical turns, let alone a homoerotic but ever-so-tender lovemaking sequence. Light but serious, funny yet passionate, this marks a totally upbeat approach to the perennial theme of being true to thyself, being as bright and breezy as summer itself. Delightful. \n","torrent":{"xt":"urn:btih:915612d84dd587ce387196b5a96ce6e4ead779e0","amp;dn":"Sommersturm+%28eng+subs%29+%5B2004%5D+Marco+Kreuzpaintner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"915612d84dd587ce387196b5a96ce6e4ead779e0","infoHashBuffer":{"type":"Buffer","data":[145,86,18,216,77,213,135,206,56,113,150,181,169,108,230,228,234,215,121,224]},"announce":[],"urlList":[]}}