{"title":"Menswear - Nuisance [1995]","uid":9393999,"size":304203520,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:91b8549335776f9b6e8b4560929f032a8eeb396f&amp;dn=Menswear+-+Nuisance+%5B1995%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"GenXRock","files":-1,"time":1387943767,"description":"Perhaps Menswear was always destined to be a footnote in pop history, a product of the heady good times of London in 1994 and 1995. Reportedly signed after only three shows, the band was never given the chance to fully develop before they recorded their debut album, Nuisance. At the time of their first single, they appropriated the sound of Blur and the style of Pulp; by the time Nuisance was released, they also incorporated the sound of Elastica and Oasis, making the band a virtual Cliff Notes of Brit-pop. Naturally, Menswear doesn't quite have the skills or panache of any of their idols, but that doesn't mean they are lacking in charm. Like Oasis and Blur, Menswear appropriates sections of pop history, claiming them as their own. However, they aren't half the songwriters that Noel Gallagher and Damon Albarn are, which means many of their ideas are never developed. Nevertheless, when they assimilate them fully -- like the intoxicating rush of &quot;Around You Again&quot; or the sweeping ballad &quot;Being Brave,&quot; which lifts the intro to Pink Floyd's &quot;Comfortably Numb&quot; -- the band is an undeniable guilty pleasure. When pressed, the 'swear can come up with irresistably infectious pop gems, from the frazzled Monkees pop of &quot;Sleeping In&quot; to the flat-out great single &quot;Daydreamer,&quot; which sounds more like Wire than Elastica, only funnier, even if it may be unintentional. Even funnier are Johnny Dean's lyrics, from the groupie saga of &quot;125 West 3rd Street&quot; to &quot;Stardust,&quot; a silly attack on Primal Scream's Bobby Gillespie. In all, Nuisance is the perfect product from a band that is better known for being seen than being heard. (4.5/5)","torrent":{"xt":"urn:btih:91b8549335776f9b6e8b4560929f032a8eeb396f","amp;dn":"Menswear+-+Nuisance+%5B1995%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91b8549335776f9b6e8b4560929f032a8eeb396f","infoHashBuffer":{"type":"Buffer","data":[145,184,84,147,53,119,111,155,110,139,69,96,146,159,3,42,142,235,57,111]},"announce":[],"urlList":[]}}