{"title":"The Flaming Lips - Oh My Gawd!!!   The Flaming Lips","uid":3284046,"size":69380553,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:921b6922721a78acdad84f76cd6b5edf186950d8&amp;dn=The+Flaming+Lips+-+Oh+My+Gawd%21%21%21+++The+Flaming+Lips&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"charmtrap","files":11,"time":1107324178,"description":"The Flaming Lips - Oh My Gawd!!!...The Flaming Lips (1987) 192k\n\nStarting with either a sample or a cool replication of a legendary one-off line in the Beatles' &amp;quot;Revolution No. 9&amp;quot; -- &amp;quot;Take this, brother, may it serve you well!&amp;quot; -- the Lips dive head-on into rock dreams on Oh My Gawd!!! Coyne's sudden resemblance vocally to Paul Westerberg is its own curiosity, but the Replacements never quite got so fried -- drunk, yes, but not fried. The cover, one weird-ass collage of skullmonsters, random photographs of landscapes, dogs and things, and, on the back, somebody literally burning up serves to set the mood just as much as the rampaging fun of &amp;quot;Everything's Exploding.&amp;quot; The same combination of this and that which made Hear It Is a fun listen takes precedence here -- Coyne and company can strum along softly or crank everything up to ten and back as they please, and they do. Coyne's knack for utterly brilliant song titles also takes full life here -- how else to explain such hilarities as &amp;quot;Maximum Dream for Evil Knievel&amp;quot; or the flatly phrased &amp;quot;Prescription: Love,&amp;quot; a groovy mindbender and arty rave-up all at once. While the Lips here are still a rock band par excellence, evidence of the band's increasing ambition kicks in with the simultaneously mocking and celebratory Pink Floyd vibes of &amp;quot;One Million Billionth of a Millisecond on a Sunday Morning.&amp;quot; All ten minutes of it should really be on Ummagumma -- Richard English's drums are pure Nick Mason from the get-go -- but darn if it doesn't sound equally great here, as Coyne idly wonders what to do with himself in the time allotted. Other songs throw in everything from Led Zeppelin drum stomps to Mountain/Deep Purple raspy rock bellowing and more besides -- theoretically everything mid-'80s American indie rock wasn't, making the Lips that much more of a fun, unique trip.\n\n01.  Everything's Explodin' \n02.  One Million Billionth Of A Millisecond On A Sunday Morning \n03.  Maximum Dream For Evil Knievel \n04.  Can't Exist \n05.  Ode To C.C. (Part 1) \n06.  The Ceiling Is Bendin' \n07.  Prescription: Love \n08.  Thanks To You \n09.  Can't Stop The Spring \n10.  Ode To C.C. (Part II) \n11.  Love Yer Brain \n","torrent":{"xt":"urn:btih:921b6922721a78acdad84f76cd6b5edf186950d8","amp;dn":"The+Flaming+Lips+-+Oh+My+Gawd%21%21%21+++The+Flaming+Lips","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"921b6922721a78acdad84f76cd6b5edf186950d8","infoHashBuffer":{"type":"Buffer","data":[146,27,105,34,114,26,120,172,218,216,79,118,205,107,94,223,24,105,80,216]},"announce":[],"urlList":[]}}