{"title":"The Terror of History - On the Uncertainties of Life in Western ","uid":8852811,"size":544462,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:921e9215096737d63a1104ed860eaf78afc4772f&amp;dn=The+Terror+of+History+-+On+the+Uncertainties+of+Life+in+Western+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"livhre","files":-1,"time":1377576288,"description":"This book reflects on Western humanity's efforts to escape from history and its terrors--from the existential condition and natural disasters to the endless succession of wars and other man-made catastrophes. Drawing on historical episodes ranging from antiquity to the recent past, and combining them with literary examples and personal reflections, Teofilo Ruiz explores the embrace of religious experiences, the pursuit of worldly success and pleasures, and the quest for beauty and knowledge as three primary responses to the individual and collective nightmares of history. The result is a profound meditation on how men and women in Western society sought (and still seek) to make meaning of the world and its disturbing history.\n\nIn chapters that range widely across Western history and culture, The Terror of History takes up religion, the material world, and the world of art and knowledge. &quot;Religion and the World to Come&quot; examines orthodox and heterodox forms of spirituality, apocalyptic movements, mysticism, supernatural beliefs, and many forms of esotericism, including magic, alchemy, astrology, and witchcraft. &quot;The World of Matter and the Senses&quot; considers material riches, festivals and carnivals, sports, sex, and utopian communities. Finally, &quot;The Lure of Beauty and Knowledge&quot; looks at cultural productions of all sorts, from art to scholarship.\n\nCombining astonishing historical breadth with a personal and accessible narrative style, The Terror of History is a moving testimony to the incredibly diverse ways humans have sought to cope with their frightening history.\n","torrent":{"xt":"urn:btih:921e9215096737d63a1104ed860eaf78afc4772f","amp;dn":"The+Terror+of+History+-+On+the+Uncertainties+of+Life+in+Western+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"921e9215096737d63a1104ed860eaf78afc4772f","infoHashBuffer":{"type":"Buffer","data":[146,30,146,21,9,103,55,214,58,17,4,237,134,14,175,120,175,196,119,47]},"announce":[],"urlList":[]}}