{"title":"Ed Miller's Limit Hold'em Four DVD Set","uid":5973063,"size":2101299247,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:934687724d500158f8cc4aa6a2e1534351b86a5a&amp;dn=Ed+Miller%5C%27s+Limit+Hold%5C%27em+Four+DVD+Set+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":5,"time":1290361838,"description":"The exclusive DVD series dedicated to cutting edge poker strategy Modern poker strategy is dynamic, uncompromising and fun! In this series, renowned experts suggest new ideas for you to exploit. Not only do they assess the latest poker theory - they go beyond the theory books to recommend their own favorite strategies and tricks. These are DVDs for players who want to be consistent winners. Apply these strategies correctly and they will help you take the money - while your opponents will be left wondering how you've done it...! &quot;Reading Hands&quot; Have you ever called someone on the river with queen-high and caught them bluffing? Have you ever value-bet ace-high and been called by a worse hand? The better you read hands, the more often these things will happen! Here Ed Miller reveals the secrets of hand-reading. &quot;Adjusting Your Play&quot; The money you make in poker comes from your opponent's mistakes. Here Ed Miller helps you identify those errors, allowing you to manipulate your opponents into making further and more costly mistakes. &quot;Advanced Pre-flop Concepts&quot; Just playing good cards is enough to make you a modest winner in a soft game, but to be an expert you have to know more than which cards to play. You have to know when to play them - and how. Here Ed Miller reveals the secrets of pre-flop strategy. &quot;Protecting Your Hand&quot; Most people make mistake after mistake on the flop. Top players understand that to eliminate these mistakes from your game, you have to know exactly when - and how - to protect your hand. And even how to play the flop when your opponents will never fold.","torrent":{"xt":"urn:btih:934687724d500158f8cc4aa6a2e1534351b86a5a","amp;dn":"Ed+Miller%5C%27s+Limit+Hold%5C%27em+Four+DVD+Set+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"934687724d500158f8cc4aa6a2e1534351b86a5a","infoHashBuffer":{"type":"Buffer","data":[147,70,135,114,77,80,1,88,248,204,74,166,162,225,83,67,81,184,106,90]},"announce":[],"urlList":[]}}