{"title":"Terra Nova Complete Season 1","uid":7528012,"size":4769930515,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:944a8a5fa09865f73528acc771ef916c73b60df7&amp;dn=Terra+Nova+Complete+Season+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"ezad898","files":22,"time":1344852633,"description":"Terra Nova is an American science fiction drama television series. It premiered on September 26, 2011 with a two-hour premiere, and concluded on December 19, 2011 with a two-hour finale. The series follows the Shannon family as they travel 85 million years into the past. The series is based on an idea by British writer Kelly Marcel. On March 5, 2012, it was announced that Fox would not pick up the series for a second season but it would be shopped to other networks.\n\nThe series is initially set in 2149, a time when overpopulation and declining air quality worldwide threatens all life on Earth. After scientists discover a rift in spacetime, they begin sending people in a series of &quot;pilgrimages&quot; 85 million years into Earth's Cretaceous past, to a different &quot;time stream&quot;. The series focuses primarily on the lives of the Shannon family (Jim, his wife Elisabeth, and their three children Josh, Maddy, and Zoe) as they join the Terra Nova colony in the prehistoric past.The phrase &quot;Terra Nova&quot; means &quot;New Earth&quot;, both in Latin and in a few descendent languages.\n\nOpposing the colony and its leader, Commander Nathaniel Taylor, is a group of separatists known as the &quot;Sixers&quot;, so called because they arrived in the &quot;Sixth Pilgrimage&quot; who are working in concert with corporate industrialists and Taylor's estranged son Lucas in an effort to strip the distant past Earth of its resources and send them back to 2149. This leads up to the point where Lucas perfects a device to travel to and from the future enabling the industrialists, along with a private army called &quot;The Phoenix Group&quot;, to invade Terra Nova. At the end of the series, Jim Shannon travels back to 2149 to destroy the gateway that controls the portal, severing the link with the Cretaceous. The remainder of the Phoenix Group retreat to the nearby &quot;Badlands&quot;, leaving behind a relic from human history they had found there: a wooden ship's figurehead.","torrent":{"xt":"urn:btih:944a8a5fa09865f73528acc771ef916c73b60df7","amp;dn":"Terra+Nova+Complete+Season+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"944a8a5fa09865f73528acc771ef916c73b60df7","infoHashBuffer":{"type":"Buffer","data":[148,74,138,95,160,152,101,247,53,40,172,199,113,239,145,108,115,182,13,247]},"announce":[],"urlList":[]}}