{"title":"The Midnight Dress by Karen Foxlee","uid":9617995,"size":2180011,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:948c47b515ae70ab3a76bab5246f2bd94acc50d2&amp;dn=The+Midnight+Dress+by+Karen+Foxlee&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"PirateBook","files":1,"time":1392444990,"description":"\nAll her life, Rose Lovell has moved from town to town with her alcoholic father. When they wash up in an Australian coastal sugarcane town, Rose wonders if maybe, finally, things will be different this time. On her first day at school, Rose meets Pearl Kelly, a popular, pretty and lively girl intent on tracking down her long-lost Russian father. \n\nShe convinces Rose to join in with the town's annual Harvest Parade, and Rose agrees, despite thinking the whole thing is embarrassingly yokel. She has to find a truly special dress - one that will make it clear she is different to the rest of the girls in this town. And who better to help her than the local eccentric, Edie Baker, who knows all the town's secrets and whose own family is a rich tapestry of stories, including whispers of witchcraft and murder. \n\nEdie agrees on the condition that Rose will create the dress with her - a dress woven from scraps and secrets and stories.\nBut when the girl wearing the midnight blue dress goes missing, the town will find it has secrets of its own to tell, and nothing can ever be the same again. THE MIDNIGHT DRESS weaves a mesmerising story of love, loss and longing to the very last page.\n\nGenre: Fiction/General","torrent":{"xt":"urn:btih:948c47b515ae70ab3a76bab5246f2bd94acc50d2","amp;dn":"The+Midnight+Dress+by+Karen+Foxlee","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"948c47b515ae70ab3a76bab5246f2bd94acc50d2","infoHashBuffer":{"type":"Buffer","data":[148,140,71,181,21,174,112,171,58,118,186,181,36,111,43,217,74,204,80,210]},"announce":[],"urlList":[]}}