{"title":"[PDF] [2011] Thermodynamics and the Destruction of Resources","uid":6401100,"size":7408210,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:94f44edd4ac5238b13cb8fc72f6d259a46a0097b&amp;dn=%5BPDF%5D+%5B2011%5D+Thermodynamics+and+the+Destruction+of+Resources&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"lyndavilla","files":2,"time":1305665705,"description":"DOWNLOAD MORE EBOOKS, MAGAZINES, &amp; PDFS:\n &lt;a href=&quot;\nhttp://buyabook.ws/download-ebooks-magazines-pdfs-more/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://buyabook.ws/download-ebooks-magazines-pdfs-more/&lt;/a&gt;\n\nBOOK INFO:\n\nTitle: Thermodynamics and the Destruction of Resources\n\nAuthor(s): Bhavik R. Bakshi, Timothy Gutowski, Dusan Sekulic\n\nPublisher: Cambridge University Press\n\nYear: 2011\n\nThis book is a unique, multidisciplinary, effort to apply rigorous thermodynamics fundamentals, a disciplined scholarly approach, to problems of sustainability, energy, and resource uses. Applying thermodynamic thinking to problems of sustainable behavior is a significant advantage in bringing order to ill defined questions with a great variety of proposed solutions, some of which are more destructive than the original problem. The articles are pitched at a level accessible to advanced undergraduates and graduate students in courses on sustainability, sustainable engineering, industrial ecology, sustainable manufacturing, and green engineering. The timeliness of the topic, and the urgent need for solutions make this book attractive to general readers and specialist researchers as well. Top international figures from many disciplines, including engineers, ecologists, economists, physicists, chemists, policy experts and industrial ecologists among others make up the impressive list of contributors. About the Authors Bhavik R. Bakshi holds a dual appointment as a Professor of Chemical and Biomolecular Engineering at The Ohio State University, and Vice Chancellor and Professor of Energy and Environment at TERI University, New Delhi. He is also the Research Director of the Center for Resilience at Ohio State. From 2006 to 2010, he was a Visiting Professor at the Institute of Chemical Technology in Mumbai, India. He has written over 100 refereed publications in areas such as Process Systems Engineering and Sustainability Science and Engineering. Timothy G. Gutowski is a Professor of Mechanical Engineering at the Massachusetts Institute of Technology, Cambridge, USA. He was the Director of MIT's Laboratory for Manufacturing and Productivity (1994-2004), and the Associate Department Head for Mechanical Engineering (2001-2005). From 1999 to 2001 he was the chairman of the National Science Foundation - Department of Energy panel on Environmentally Benign Manufacturing. He has written over 150 technical publications, and seven patents and patent applications. He is the editor of Advanced Composites Manufacturing (1997). Dusan P. Sekulic is a Professor of Mechanical Engineering at the University of Kentucky. He is a fellow of ASME. Dr. Sekulic is a consulting professor at the Harbin Institute of Technology, PR China. He is the author of over 150 refereed research publications, more than a dozen book chapters, and the author of the book Fundamentals of Heat Exchanger Design (jointly with R.K. Shah), published in English, and in Chinese. He is the editor of the books Advances in Brazing: Science, Technology and Applications and Fundamentals of Heat Exchanger Design (2003) co-edited with Ramesh K. Shah.","torrent":{"xt":"urn:btih:94f44edd4ac5238b13cb8fc72f6d259a46a0097b","amp;dn":"%5BPDF%5D+%5B2011%5D+Thermodynamics+and+the+Destruction+of+Resources","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94f44edd4ac5238b13cb8fc72f6d259a46a0097b","infoHashBuffer":{"type":"Buffer","data":[148,244,78,221,74,197,35,139,19,203,143,199,47,109,37,154,70,160,9,123]},"announce":[],"urlList":[]}}