{"title":"Darren Shan - The Demonata Book 1 - Lord Loss","uid":4475726,"size":115473968,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:95eb774543a667b16c6b538c9b7d6b2df0a993b6&amp;dn=Darren+Shan+-+The+Demonata+Book+1+-+Lord+Loss&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Strikketanten","files":105,"time":1225329468,"description":"   BOOK 1 - Lord Loss\n\n&quot;lord loss sows all the sorrows of the world&quot;\n\nPLOT OUTLINE\n\nGrubbs Grady is an average kid. A bit bigger and slyer than a lot of boys his age (he loves to play evil, ingenious tricks on his sister), but nothing special. He leads an ordinary life, and expects it will always be that way. But when his parents and sister behave strangely ... and Grubbs decides to stick his nose in ... his entire world is thrown into chaos. He discovers that demons are real, and that terrible things can happen right in front of your eyes.\n\nAs Grubbs slowly and painfully tries to deal with his new situation, help appears in the form of a friendly, eccentric relative. Grubbs moves to the countryside to recover, and starts putting his life back together. But there are secrets to be uncovered and hard truths to learn, and Grubbs is about to find out that as crazy and deadly as the world now seems, life is about to get a whole lot worse!!!\n\n&quot;Lord Loss&quot; is the first book of &quot;The Demonata&quot;, a book series which will take readers into new worlds and universes, all of them populated or threatened by demons. Fast-paced and bloody, horrific and fantastic, frightening and exciting. You might never look at the world in the same way again ...\n\n","torrent":{"xt":"urn:btih:95eb774543a667b16c6b538c9b7d6b2df0a993b6","amp;dn":"Darren+Shan+-+The+Demonata+Book+1+-+Lord+Loss","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"95eb774543a667b16c6b538c9b7d6b2df0a993b6","infoHashBuffer":{"type":"Buffer","data":[149,235,119,69,67,166,103,177,108,107,83,140,155,125,107,45,240,169,147,182]},"announce":[],"urlList":[]}}