{"title":"[Anime] Star Blazers series 1 eps 7-12 US version","uid":3984969,"size":1311778816,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:95f150c01fd46f80df9c4fc681256b7c743cfabf&amp;dn=%5BAnime%5D+Star+Blazers+series+1+eps+7-12+US+version&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"catman77","files":6,"time":1200762674,"description":"2199 AD: The quest for iscandar\nAlternate titles: Uchuu Senkan Yamato, Space Battleship Yamato, Star Blazers series 1\n\nShe must return in 365 days from the journey of 296,000 light years. The mission was grave for Space Battleship Yamato...  \n\n\nIn the year 2199, Earth was threatened by a deadly interstellar empire, and humankind was driven underground with only one year to live. Then from space came a message of hope, and an ancient fighting spirit would be revived to answer it!\n\nThe epic SF adventure that created a generation of anime fans begins here, with the first Yamato TV series! Planet Earth is counting down its final days to extinction at the hands of the mysterious Gamilas Empire. Space Battleship Yamato, the first to break the speed of light, embarks on a journey to Iscandar with the mission to retrieve the Cosmo Cleaner D, a radiation removal system which will hopefully rescue the Earth. What awaits Yamato is humankind\\&amp;#039;s first-ever journey of 296,000 light years.\n\nOriginally broadcast in Japan back in 1974, this unprecedented SF series struggled against overwhelming odds to eventually be considered a classic of the genre. In 1979, the English-language version, Star Blazers, took America by storm and ignited a passionate fire that still burns bright today! Its unforgettable heroes, dangerous villains, suspenseful adventures, spectacular battles, and emotional stories will continue to fascinate audiences for generations to come.\n   &lt;a href=&quot;\nhttp://www.starblazers.com/department.php?page_id=115&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.starblazers.com/department.php?page_id=115&lt;/a&gt;\n\n-------------------\n\nThis is the US version with no subs. Some scenes are missing from the the original Japanese version (also here on TPB)\n\nI will seed for a while and then I\\&amp;#039;m counting on you guys as I will move forward and upload episodes 13-19.\n\nIf anyone got the Swedish version called StjÃƒ?Ã‚Â¤rnbrigaden please don\\&amp;#039;t hesitate to share!!!","torrent":{"xt":"urn:btih:95f150c01fd46f80df9c4fc681256b7c743cfabf","amp;dn":"%5BAnime%5D+Star+Blazers+series+1+eps+7-12+US+version","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"95f150c01fd46f80df9c4fc681256b7c743cfabf","infoHashBuffer":{"type":"Buffer","data":[149,241,80,192,31,212,111,128,223,156,79,198,129,37,107,124,116,60,250,191]},"announce":[],"urlList":[]}}