{"title":"Mike Oldfield - Discovery TQMP","uid":4813390,"size":262738988,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:962ac2fbe9d48cfd07701a5d36b229caf00c4778&amp;dn=Mike+Oldfield+-+Discovery+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zootallure","files":22,"time":1238458367,"description":"English multi-instrumentalist musician and composer, working a style that blends progressive rock, folk, ethnic or world music, classical music, electronic music, New Age and more recently dance. His music is often elaborate and complex in nature. He is best known for his hit 1973 album Tubular Bells, which broke new ground as an instrumental concept album, and for his 1983 hit single &quot;Moonlight Shadow&quot;. He is also well known for his hit rendition of the Christmas piece, &quot;In Dulci Jubilo&quot;.\nHaving recorded a demo version of Tubular Bells (I belive that he was 17), Oldfield attempted to convince someone in the music industry to take the project on, but was told the project was unmarketable. However, in 1972 he met the young Richard Branson who was setting up his own record label, Virgin Records, and after playing the demo to engineers Tom Newman and Simon Heyworth, he began recording the 1973 version of the album, whiich brought to Virgin Records as we know it today...And the others were biting their fingernails\n\nP.S The booklet cover is not sloppy scanned, it is the original cut that is oblique\n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project we, fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill :)\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC with 1024kb/s\nGet Your Free Copy of the EAC and FLAC suite at:\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/\n\nPlease feel free to join the TQMP project!\nThe &quot;rules&quot; are simple: Rip your CD (no 1980's cassettetapes or vinylrips please!) in lossless format AND include artwork. Include cue- and logfiles for the purists and the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..)\n\n\nSay Ã‚Â»thank youÃ‚Â« by seeding... just seed, it is not harmful to your health :-)","torrent":{"xt":"urn:btih:962ac2fbe9d48cfd07701a5d36b229caf00c4778","amp;dn":"Mike+Oldfield+-+Discovery+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"962ac2fbe9d48cfd07701a5d36b229caf00c4778","infoHashBuffer":{"type":"Buffer","data":[150,42,194,251,233,212,140,253,7,112,26,93,54,178,41,202,240,12,71,120]},"announce":[],"urlList":[]}}