{"title":"Democracy Now - 11 nov 2011","uid":6810955,"size":455951599,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:972685c0e666daa056eaf3d7560f41043ecba547&amp;dn=Democracy+Now+-+11+nov+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1321034294,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Nov 11, 2011\n\n-  Activists Rejoice as Admin Delays Decision on Keystone XL Oil Pipeline\n-  Alleged Afghan &quot;Kill Team&quot; Leader Found Guilty, Avoids Life Term\n-  HRW Charges Assad Regime Guilty of &quot;Crimes Against Humanity&quot;\n-  Police Beat Student Activists at UC-Berkeley Occupy-Related Protest\n-  Occupy Portland Faces Sunday Eviction Deadline\n-  Occupy Protesters Disrupt Michele Bachmann Speech in South Carolina\n-  Ex-Banker Sworn-in as New Greek PM\n-  Hawaii Activists to Protest APEC Summit\n-  Climate Change Research Group to Receive Big Oil Funding\n-  Twitter Ordered to Disclose Account Info of WikiLeaks Associates\n\n\nSpecial reports\n\n- Obama Delays Keystone XL Tar Sands Oil Pipeline Decision Until 2013, Environmentalists Claim Victory\n\nEnvironmental activists are claiming victory after the Obama administration announced Thursday it will postpone any decision on the proposed 1,700-mile Keystone XL tar sands oil pipeline until 2013. The announcement was made just days after more than 10,000 people encircled the White House calling on President Obama to reject the project, the second major action against the project organized by Bill McKibben's 350.org and Tar Sands Action. In late August and early September, some 1,200 people were arrested in Washington, D.C., in a two-week campaign of civil disobedience. &quot;We believe that this delay will kill the pipeline,&quot; says the Canadian author and activist Naomi Klein. &quot;If it doesn't, if this pipeline reemerges after the election, people have signed pledges saying they will put their bodies on the line to stop it.&quot;\n\n\n- White House Could Cast Decisive Vote to Permit 20,000 Fracking Wells in Delaware River Basin\n\nThis week the Delaware River Basin Commission released draft regulations to allow for the natural gas drilling technique hydraulic fracturing, known as fracking, in the river's watershed, which provides water to 15.6 million people in New York City, Philadelphia and New Jersey. The proposed plan would allow for some 20,000 gas wells to be developed in the watershed. A vote on the regulations is set for Nov. 21 and could prompt a battle between activists and the White House, which holds a seat on the commission and may cast the deciding vote. We speak with Josh Fox, whose documentary about fracking, &quot;Gasland,&quot; was nominated for an Academy Award, and play an excerpt of his new video about the possible impacts natural gas fracking could have in the Delaware River Basin.\n\n\n- Occupy Homes: New Coalition Links Homeowners, Activists in Direct Action to Halt Foreclosures\n\nA loose-knit coalition of activists known as the &quot;Occupy Homes&quot; are working to stave off pending evictions by occupying homes at risk of foreclosure when tenants enlist their support. The movement has recently enjoyed a number of successes. We speak with Monique White, a Minneapolis resident who is facing foreclosure and recently requested the help of Occupy Minneapolis. Now two dozen of its members are occupying her home in order to stave off eviction. We are also joined by Nick Espinosa, an organizer with Occupy Minneapolis, and by Max Rameau, a key organizer with Take Back the Land who for the past five years has worked on direct-actions that reclaim and occupy homes at risk of foreclosure. &quot;The banks are actually occupying our homes,&quot; Rameau says. &quot;This sets up for an incredible movement where we have a one-two punch. On the one hand, we're occupying them on their turf, and on the other, we're liberating our own turf so human beings can have access to housing - rather than them sitting vacant so that corporations can benefit from them one time in the future.&quot;\n\n\n- Child Rape Cover-Up at Penn State Marks &quot;Greatest Fall From Grace in History of U.S. Sports&quot;\n\nPenn State football coach Joe Paterno - one of the most legendary coaches in U.S. sports history - was fired on Wednesday for his role in allegedly covering up the child sexual abuse of the football team's former assistant coach, Jerry Sandusky. Penn State President Graham Spanier was also fired. In 2002, Paterno reportedly received an eyewitness account from someone who saw Sandusky raping a young boy in a Penn State locker room. While Paterno told his boss, he did not call the police. Others at Penn State knew about a string of other sexual assaults allegedly committed by Sandusky but the police were never notified. Last week, Sandusky was charged with sexually abusing eight boys over a 15-year period. During the entire time, Sandusky was running a foundation for troubled kids. The student response to the child rape scandal has surprised many. On Wednesday, students rioted in outrage - not over the school's role in covering up child rape - but for Paterno's firing. We speak with political sportswriter Dave Zirin. &quot;What the Penn State students did the other night - rioting, hitting ESPN reporters in the head with rocks, setting fires, and by the way, zero arrests at the end of the night after all the carnage - stands in stark contrast to the courage of the students occupying their campuses around the country,&quot; Zirin says. &quot;It's really a tale of two generations that we're seeing play itself out on these different campuses.&quot;\n\n\n- Occupy Cal: 39 Arrested in Forceful Crackdown on Massive Protest at UC-Berkeley\n\nThis week the Occupy movement drew thousands of California college students to protests on at least 10 campuses, including UC-Irvine, UCLA, and UC-Berkeley, where police forcibly removed students and arrested 39 people. We get a report from John Hamilton, who reports for KPFA.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:972685c0e666daa056eaf3d7560f41043ecba547","amp;dn":"Democracy+Now+-+11+nov+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"972685c0e666daa056eaf3d7560f41043ecba547","infoHashBuffer":{"type":"Buffer","data":[151,38,133,192,230,102,218,160,86,234,243,215,86,15,65,4,62,203,165,71]},"announce":[],"urlList":[]}}