{"title":"Daytrader - Twelve Years (2012) [FLAC]","uid":8225865,"size":271503176,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:98ad23e71ca3b5c03e14f3385e13cba4803ae23f&amp;dn=Daytrader+-+Twelve+Years+%282012%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1362595271,"description":"After talking about forming a band for years, members of Long Island's Daytrader finally got the timing right and started writing together during the summer of 2010; they brought a sound to the punk scene that hearkened back to the late-'90s/early-2000s emo bands -- such as Further Seems Forever and Saves the Day -- that helped influence them. The group comprised scene vets vocalist Tym Barash (ex-Divider), guitarist Gary Cioni (ex- Crime in Stereo), drummer Pat Schramm (ex-Bridge and Tunnel, Latterman), bassist Jon Murray (ex-Monikers), and guitarist Mike Weiss (ex-the Motorcycle Industry); Schramm and Murray were later replaced by drummer Derrick Flanagan and bassist Matt Mascarenas (ex-Reviver). Daytrader didn't waste much time once they began, and within a few months, they had released a three-song demo and played out live shows with like-minded acts the Wonder Years, Such Gold, and Fireworks. The band ultimately signed with Run for Cover Records, and released their debut EP, Last Days of Rome, in January 2011. Touring followed, with the group supporting the record out on the road alongside Transit and Into It. Over It. By fall, Daytrader had joined the Rise Records roster and recorded their next album with Long Island producer Mike Sapone (Taking Back Sunday, Brand New). The resulting full-length, Twelve Years, appeared in May 2012.","torrent":{"xt":"urn:btih:98ad23e71ca3b5c03e14f3385e13cba4803ae23f","amp;dn":"Daytrader+-+Twelve+Years+%282012%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98ad23e71ca3b5c03e14f3385e13cba4803ae23f","infoHashBuffer":{"type":"Buffer","data":[152,173,35,231,28,163,181,192,62,20,243,56,94,19,203,164,128,58,226,63]},"announce":[],"urlList":[]}}