{"title":"The Unholy Three (1925) DVD5 - Silent Movie [DDR]","uid":9293637,"size":4339992576,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:98cc8e4020ba19172ce62c6ed349d320e5e1e50f&amp;dn=The+Unholy+Three+%281925%29+DVD5+-+Silent+Movie+%5BDDR%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"SaM","files":-1,"time":1386128863,"description":"The Unholy Three (1925) DVD5 - Silent Movie [DDR]\n\nThe Unholy Three is a 1925 American silent film melodrama involving a crime spree, directed by Tod Browning and starring Lon Chaney.\nThe film was remade in 1930 as a talkie. In both the 1925 and the 1930 version, the roles of Professor Echo and Tweedledee are played by Chaney and Harry Earles respectively. \nBoth were based on the novel of the same name by Clarence Aaron &quot;Tod&quot; Robbins.\n\nCAST:-\nLon Chaney as Professor Echo, the ventriloquist, aka Mrs. 'Granny' O'Grady\nMae Busch as Rosie O'Grady\nMatt Moore as Hector McDonald\nVictor McLaglen as Hercules, the strongman, aka 'Son-in-Law'\nHarry Earles as Tweedledee, the midget, aka Baby 'Little Willie'\nMatthew Betz as Detective Regan\nEdward Connelly as The Judge\nWilliam Humphrey as Defense Attorney (billed as William Humphreys)\nE. Alyn Warren as Prosecuting Attorney (billed as A.E. Warren)\n\nDirected by Tod Browning\nProduced by Tod Browning, Irving Thalberg (uncredited)\nWritten by Clarence Aaron &quot;Tod&quot; Robbins and Waldemar Young\n\nMOVIE REVIEW:- The Unholy Three (1925) Silent Film\nAlthough Lon Chaney and director Tod Browning had made a couple of films together earlier in their careers, this unique melodrama marked the beginning of a string of chilling, macabre silent films, which included West of Zanzibar, The Unknown, and The Black Bird. Chaney is Echo, a sideshow ventriloquist. He cooks up a scam with two other members of the sideshow -- Hercules, the strong man (Victor McLaglen), and Tweedledee, a midget (Harry Earles). The three of them open up a bird store full of parrots that have impressive vocabularies -- but only when Echo, dressed as proprietress Granny O'Grady, is around. When the buyer takes the bird home and it won't talk, Granny comes around with a baby (Tweedledee in swaddling clothes). While &quot;Granny&quot; (using his powers of ventriloquism) coaxes the parrot into speaking, the midget cases the joint to see if there's anything worth robbing later. Trouble comes when they hire Hector, a simple soul (Matt Moore), as a clerk. Echo's pickpocket sweetheart, Rosie (Mae Busch) falls in love with him. Meanwhile, Hercules and Tweedledee murder a man while they're in the midst of one of their robberies. Hector is arrested for the crime while the others flee. To save Hector, Rosie finally agrees to give him up if Echo saves him. By throwing his voice, Echo makes Hector appear to give testimony which frees him. When Rosie goes to Echo, however, he sends her back to Hector, while he returns to the side show. His two cohorts meet their end when they run afoul of Echo's pet gorilla. This hugely successful film was remade as Chaney's first -- and last -- talkie. Harry Earles (who might also be remembered from his starring role in Freaks) reprises his role as Tweedledee.\n\nPRODUCTION NOTES:-\nDuring the scene where Echo and company are fleeing the pet store, Echo decides to take his pet ape with them. The &quot;Ape&quot; was actually a three-foot-tall chimpanzee who was made to appear gigantic with camera trickery and perspective shots. When Echo removes the ape from his cage, the shot shows Echo (with his back turned to the camera) unlocking the cage and walking the ape to the truck. The ape appears to be roughly the same size as Echo. This effect was achieved by having midget actor Harry Earles (who played &quot;Tweedledee&quot; in the film) play Echo for these brief shots, and then cutting to the normal sized Lon Chaney, making it seem as though the Ape is gigantic. (In the 1930 remake the ape is played by a man in a costume.)\n\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: MPEG-2\nVideo Bitrate: 4999 kbps\nVideo Resolution: 720x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 29.970\nAudio Codec:  AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages: Silent Movie\nRunTime 86 mins\nSubtitles: None\nRipped by: Trinidad [DDR]\nDuration: 86 mins","torrent":{"xt":"urn:btih:98cc8e4020ba19172ce62c6ed349d320e5e1e50f","amp;dn":"The+Unholy+Three+%281925%29+DVD5+-+Silent+Movie+%5BDDR%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98cc8e4020ba19172ce62c6ed349d320e5e1e50f","infoHashBuffer":{"type":"Buffer","data":[152,204,142,64,32,186,25,23,44,230,44,110,211,73,211,32,229,225,229,15]},"announce":[],"urlList":[]}}