{"title":"Shooting Sherriffs Saturday","uid":6587214,"size":7931988389,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:9a05a89f4a6c555e890df7a05577d4c218ee414a&amp;dn=Shooting+Sherriffs+Saturday&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"AntiSecurity","files":-1,"time":1312660055,"description":"                                               `..--.                           \n                                          `:.#antisec#;:                        \n                                         :antisec#anti;+.`                      \n                                         :sec#antisec#a;/:                      \n                                         ntisec#antisec#+a                      \n                                         .ntisec#antisec;:                      \n      `-`                                 +#antisec#anti:s/                     \n /.:+:/+.`..`                             `;+;ec#antisec::+                     \n  :.;;+`-./-:`                            .+:#antisec#anti-++`                  \n   `-` -:.``;                          `:.+.sec#antisec#a:  -;-                 \n      `;   -:::.                   `-:+..;/:ntisec#an.-` :+``+-                \n      `.+-  `./;.-            `-/++++:`.:-;tisec#anti++   -s;`/;//-             \n        `-:`    .-:-        /::+-`      :/+;ec#ant;i;/..   ;s:.;:++.:           \n          `/      .:`     `;:/`          .+..+///:::/:.    /:e;c#a:;/+-`        \n       `:+..      ..   .:.;n+/++.         `---...````      `tisec#an:/:++-      \n     -::-`    `.--`  -t:./;:ise./.`..                  .:+.;;c#antisec#:.;;     \n    +-      .::.`  .;:.;antisec;.+;;+`                 .--:;..:.#;antisec;;/    \n   `.`   `++-`   ./;;#antisec#a;:nt;i+.`         `         ;.    `-;sec#an:.`   \n    .:.  .;-`    t+.isec#;a:;:;;nt;i+::.-``  ..:-`         ..      .;sec#a+:.   \n     --::...;    ..;ntise+c;:-`  :;.-`:++.+//:-           `/        `;#ant;+:   \n       ./:::.:   +::isec;#.      `an..                 .-/.;          -tisec/   \n        `.+.::/``/+:#an:;.        .ti+`            `./;;:`;+           sec#.+`  \n           /anti:;..sec#;          .an.         `-+.;+::.-..          ti;+:`:;` \n           /sec#antise/c           `#a-     ``-;..//+.+:.-.          -ntis:::/; \n           ec#antisec#:+            /a.    ////+//./..+++..`         `;nti./:`:`\n           `sec#antisec#/           /;:+///...+:/.//;;;:././+-         `;ant+/;`\n             isec#antis;.         `;ec#antisec#antisec#ant:.:;;.         :/:-`  \n              isec#antis:        -;ec#antisec#antisec#anti;.- .;/               \n              /sec#antise/       c#antisec#antisec#antis.:-`    .               \n               /;;ec#an::.       tise.`                                        \n                `+.c#..+`        ;+-.;`                                         \n                                  `:/:          \n                                  \n      &quot;Alright Dirty, yall boys ready? Bout to turn drive-bys revolutionary&quot;\n                                  \n////////////////////////////////////////////////////////////////////////////////\n## #FREETOPIARY #FREEMERCEDES #FREEBRADLEYMANNING #SHOOTINNGSHERIFFSSATURDAY ###\n### OWN &amp; RM ### OWN &amp; RM ### OWN &amp; RM ### OWN &amp; RM ### OWN &amp; RM ### OWN &amp; RM ##\n////////////////////////////////////////////////////////////////////////////////\n\n      _  _                   __  .__                      \n   __| || |__ _____    _____/  |_|__| ______ ____   ____        #anonymous\n   \\   __   / \\__  \\  /    \\   __\\  |/  ___// __ \\_/ ___\\       #antisec\n    |  ||  |   / __ \\|   |  \\  | |  |\\___ \\\\  ___/\\  \\___       #lulzsec\n   /_  ~~  _\\ (____  /___|  /__| |__/____  &gt;\\___  &gt;\\___  &gt;      #freetopiary\n     |_||_|        \\/     \\/             \\/     \\/     \\/       #SSS\n\n\n////////////////////////////////////////////////////////////////////////////////\nANTISEC DELIVERS OVER 10GB OF PRIVATE POLICE EMAILS, TRAINING FILES, SNITCH INFO\nAND PERSONAL INFO IN RETALIATION FOR ANONYMOUS ARRESTS #ShootingSheriffsSaturday\n////////////////////////////////////////////////////////////////////////////////\n\n&quot;Missouri Sheriff's Association Executive Director Mick Covington tells KHQA\nthat the most the hackers got from their organization were email addresses. \nContrary to AntiSec's announcement, there were no critical details like names,\nsocial security numbers or other personal information details on their server\nthat was hacked.&quot;  (DOX AND EMAILS DROPPED)\n(http://www.connecttristates.com/news/story.aspx?id=646614)\n\n&quot;Based upon past releases of information, the content of these releases are\nsometimes manipulated and edited in an attempt of embarrass or discredit\ngovernment agencies and law enforcement. Also in their release, they threaten to\npublish the names of inmates and confidential informants. Informant and other\nsensitive data are not kept on the website, and we believe any information that\nwould be released would be false in an attempt to hinder future investigations\nby law enforcement.&quot; - Sheriff John Montgomery   (MORE DOX DROPPED)\n(http://www.baxterbulletin.com/article/20110801/NEWS01/110801001/BC-Sheriff-\nWebsite-hacked?odyssey=tab|topnews|text|FRONTPAGE)\n\n&quot;President of the Missouri Sheriff's Association Steve Cox said he thinks the\nhackers claim to have more information than they really do. Cox said the group\njust wants glory and fame.&quot; (DOX AND SSN DROPPED)\n(http://www.komu.com/news/update-group-hacks-missouri-sheriff-s-association/)\n\n&quot;Sheriff Joe Guy says, &quot;We've not lost any information. There's no, we've not\nbeen hacked. I think that's been a fear. No sensitive information is on that\nwebsite anyway.&quot; (DOX AND EMAILS DROPPED AGAIN) &lt;a href=&quot;\nhttp://wdef.com/news/mcminn_county_sheriffs_department_website/08/2011&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://wdef.com/news/mcminn_county_sheriffs_department_website/08/2011&lt;/a&gt;\n\n////////////////////////////////////////////////////////////////////////////////\n\nA week after we defaced and destroyed the websites of over 70 law enforcement\nagencies, we are releasing a massive amount of confidential information that is\nsure to embarass, discredit and incriminate police officers across the US. Over\n10GB of information was leaked including hundreds of private email spools,\npassword information, address and social security numbers, credit card numbers,\nsnitch information, training files, and more. We hope that not only will\ndropping this info demonstrate the inherently corrupt nature of law enforcement\nusing their own words, as well as result in possibly humiliation, firings, and\npossible charges against several officers, but that it will also disrupt and\nsabotage their ability to communicate and terrorize communities.\n\nWe are doing this in solidarity with Topiary and the Anonymous PayPal LOIC\ndefendants as well as all other political prisoners who are facing the gun of\nthe crooked court system. We stand in support of all those who struggle against\nthe injustices of the state and capitalism using whatever tactics are most\neffective, even if that means breaking their laws in order to expose their\ncorruption. You may bust a few of us, but we greatly outnumber you, and you can\nnever stop us from continuing to destroy your systems and leak your data.\n\nWe have no sympathy for any of the officers or informants who may be endangered\nby the release of their personal information. For too long they have been using\nand abusing our personal information, spying on us, arresting us, beating us,\nand thinking that they can get away with oppressing us in secrecy. Well it's\nretribution time: we want them to experience just a taste of the kind of misery\nand suffering they inflict upon us on an everyday basis. Let this serve as a\nwarning to would-be snitches and pigs that your leaders can no longer protect\nyou: give up and turn on your masters now before it's too late.\n\n// A TALE OF TWO OWNINGS\n\nIt took less than 24 hours to root BJM's server and copy all their data to our\nprivate servers. Soon after, their servers were taken down and a news article\ncame out suggesting they received advance FBI &quot;credible threat&quot; notice of a\n&quot;hacking plot&quot;. At this point it was too late for them because the stolen files\nwere gonna get leaked regardless. However we were surprised and delighted to see\nthat not only did they relaunch a few sites less than a week later, but that\ntheir &quot;bigger, faster server that offers more security&quot; carried over our\nbackdoors from their original box. This time we were not going to hesitate to\npull the trigger: in less than an hour we rooted their new server and defaced\nall 70+ domains while their root user was still logged in and active.\n\nWe lol'd as we watched the news reports come in, quoting various Sheriffs who\ndenied that they were ever hacked, that any personal information was stolen,\nthat they did not store snitch info on their servers. Many lulz have been had as\nwe taunted the sheriffs by responding to their denials by tweeting teasers\nexposing their SSNs, passwords, addresses, and private emails. We also took the\nliberty to backdoor their online store and capture a few credit card numbers,\nwhich were used to make involuntary donations to the ACLU, the EFF, the Bradley\nManning Support Network, and more. Despite active FBI investigations and their\nadditional security measures, they could not stop us from owning their servers,\nstealing their identities, and dropping all their data. Two weeks later only a\nfew of the sites are up with limited functionality as we scared them into\nremoving any dynamic PHP scripts, forcing them to use static HTML content.\n\nA recent DHS bulletin has called us &quot;script kiddies&quot; that lack &quot;any capability\nto inflict damage to critical infrastructure&quot; yet we continue to get in and out\nof any system we please, destroying and dropping dox on the mightiest of\ngovernment systems that are supposed to be protecting their sick nightmare of\n&quot;law and order&quot;. GIVE UP. You are losing the cyberwar, and the attacks against\nthe governments, militaries, and corporations of the world will continue to\nescalate. \n\nHackers, join us to make 2011 the year of leaks and revolutions.\n\n////////////////////////////////////////////////////////////////////////////////\n\n   [*] ORIGINAL DEFACEMENT: http://zone-h.org/mirror/id/14515221)\n   [*] BROWSE THE LEAK:    &lt;a href=&quot; http://vv7pabmmyr2vnflf.onion/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://vv7pabmmyr2vnflf.onion/&lt;/a&gt;          (ON TOR)\n                           &lt;a href=&quot; http://vv7pabmmyr2vnflf.tor2web.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://vv7pabmmyr2vnflf.tor2web.com/&lt;/a&gt;    (NOT TOR)\n                          \n   [*] DONATE BITCOINS:     18NHixaoQekQJ3y52aBGJJwgBWX9X3myYR\n\n The booty contains: \n \n   [*] Over 300 mail accounts from 56 law enforcement domains\n   [*] Missouri Sheriff account dump (mosheriffs.com)\n       7000+ usernames, passwords, home addresses, phones and SSNs\n   [*] Online Police Training Academy files\n       PDFs, videos, HTML files\n   [*] &quot;Report a Crime&quot; snitch list compilation (60+ entries)\n   [*] Plesk plaintext server passwords (ftp/ssh, email, cpanel, protected dirs)\n   \n////////////////////////////////////////////////////////////////////////////////\n","torrent":{"xt":"urn:btih:9a05a89f4a6c555e890df7a05577d4c218ee414a","amp;dn":"Shooting+Sherriffs+Saturday","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a05a89f4a6c555e890df7a05577d4c218ee414a","infoHashBuffer":{"type":"Buffer","data":[154,5,168,159,74,108,85,94,137,13,247,160,85,119,212,194,24,238,65,74]},"announce":[],"urlList":[]}}