{"title":"Chet Baker-Chet; audiophile CD, Analogue Productions FLAC","uid":12337228,"size":231616705,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9a0d8b64008802752686be8310c5abeb0cbd4001&amp;dn=Chet+Baker-Chet%3B+audiophile+CD%2C+Analogue+Productions+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rontoolsie","files":7,"time":1441254372,"description":"&quot;This is perhaps the ultimate mood jazz record. Trumpet player Chet Baker, then at the height of his creative powers, chose to do an album entirely made up of ballads. He found excellent support for his project by musicians such as Herbie Mann (flute), Pepper Adams (baritone saxophone) and the fabulous Bill Evans (piano). Alone Together, the first track, is a good demonstration of what this album is all about. It is introduced by a few, widely spaced notes by Bill Evans, which lead to Baker's first brief solo, very soft, very lonely, but after which you will probably already have forgotten all your worldly worries while you are sitting snuggled up in your favourite armchair. Pepper Adams and Herbie Mann, with a very sombre tone, follow with brief solo spots, which sustain the very quiet after hours mood very well. After that, Connie Kay's drums set in and the pace quickens slightly, backing another, longer solo by Chet, before the whole group returns to the mood of the beginning of the tune. This mood is sustained throughout the album, and I think that there is simply no better record for a dark, rainy afternoon than this one. Despite the fact that 45 years have passed since its recording, the superior sound quality of the original plus the 20 Bit Mastering make this an outstanding record.\nMany albums are out that supposedly contain relaxing, moody jazz, with titles using such terms as Lounge Jazz, Bar Jazz and many more. All these records intend to do is to supply you with music that can be listened to without much strain, i.e. music that will be well suited for a quiet evening. Unfortunately, not many of these collections are any good, since they either contain a poor choice of tunes, including many tunes that are none too pleasant, or they are simply too shallow. None of these faults can be found on this album. There is no tune that breaks the mood, nor is the playing in any way shallow. And for once, I will quote the liner notes that say &quot;above all there is an overall cohesiveness and beauty that makes this [...] an unusually pleasurable and warm listening experience.&quot; Right he is.&quot;","torrent":{"xt":"urn:btih:9a0d8b64008802752686be8310c5abeb0cbd4001","amp;dn":"Chet+Baker-Chet%3B+audiophile+CD%2C+Analogue+Productions+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a0d8b64008802752686be8310c5abeb0cbd4001","infoHashBuffer":{"type":"Buffer","data":[154,13,139,100,0,136,2,117,38,134,190,131,16,197,171,235,12,189,64,1]},"announce":[],"urlList":[]}}