{"title":"3 Cohens - 2011 - Family FLAC","uid":8499271,"size":457859786,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9ac4b12b71c897fb164d0fc7ce25db2089e63b0e&amp;dn=3+Cohens+-+2011+-+Family+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"eika256","files":-1,"time":1369250499,"description":"3 Cohens - 2011 - Family FLAC\n\nHaving more than one notable jazz artist in a family isn't unusual, but it is a bit more rare for three related, talented jazz musicians to record together, whose surname isn't Marsalis. Israel natives Anat Cohen (clarinet and tenor sax), trumpeter Avishai Cohen, and soprano saxophonist Yuval Cohen are all siblings, while they are supported by a potent rhythm section consisting of pianist Aaron Goldberg, bassist Matt Penman, and drummer Gregory Hutchinson. Their spirited interpretation of Duke Ellington's early gem &quot;The Mooche&quot; (not &quot;The Mooch&quot; as shown on the cover) retains elements of the original arrangement with Anat's warm clarinet and Yuval's modern-sounding soprano. Their updated approach to &quot;Do You Know What It Means to Miss New Orleans&quot; has a distinctive modern touch and a rich reharmonization, with powerful ensembles by the Cohens. the Cohens also show off their skills as composers. Avishai penned the lush, moving &quot;Family,&quot; a beautiful ballad with a melancholy air, along with the imaginative &quot;With the Soul of the Greatest of Them All&quot; (dedicated to Charles Mingus), which opens with Penman's intense bass solo. Yuval wrote the intriguingly titled &quot;Blues for Dandi's Orange Bull Chasing an Old Sack,&quot; which has the flavor of early Mingus, with its walking bass and gradual increase in tempo. NEA Jazz Master Jon Hendricks, a young 89 years old at the time of the session, guests on two songs. He still excels as a scat singer in a deliberate setting of &quot;On the Sunny Side of the Street, while &quot;Roll 'Em Pete&quot; (the lively blues co-written by pianist Pete Johnson and blues shouter Joe Turner) is an all-around showcase for the band, with lively solos across the board and Hendricks' delightful vocal. It's quickly apparent that the 3 Cohens should have frequent family reunions in the studio. (AllMusic)\n\nTrack list:\n01 - Shufla De Shufla\n02 - Blues For Dandi's Orange Bull Chasing an Orange Sack\n03 - With the Soul of the Greatest of Them All [For Charles Mingus]\n04 - The Mooch\n05 - Do You Know What It Means To Miss New Orleans\n06 - Rhapsody In Blake\n07 - On the Sunny Side of the Street\n08 - Tiger Rag\n09 - Family\n10 - Roll 'Em Pete\n\nPersonnel: Anat Cohen: tenor saxophone &amp; clarinet;\nAvishai Cohen: trumpet; (Not to be confused with the bassist with the same name)\nYuval Cohen: soprano saxophone;\nAaron Goldberg: piano;\nMatt Penman: bassl\nGregory Hutchinson: drums.\nSpecial Guest: Jon Hendricks: vocals.\n\nEnjoy and share! ","torrent":{"xt":"urn:btih:9ac4b12b71c897fb164d0fc7ce25db2089e63b0e","amp;dn":"3+Cohens+-+2011+-+Family+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ac4b12b71c897fb164d0fc7ce25db2089e63b0e","infoHashBuffer":{"type":"Buffer","data":[154,196,177,43,113,200,151,251,22,77,15,199,206,37,219,32,137,230,59,14]},"announce":[],"urlList":[]}}