{"title":"Dr. Jeffrey Thompson - Unwind (Alpha Relaxation Solution) [FLAC]","uid":11980872,"size":331751970,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9c0e0f077684e818d2c9989e48753a0873b6c102&amp;dn=Dr.+Jeffrey+Thompson+-+Unwind+%28Alpha+Relaxation+Solution%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"elessedilgirl","files":5,"time":1433202800,"description":"Unwind - with Alpha Brainwave Pulses \n\n Silvia Nakkach is a pioneer in the field of sound, transformation of consciousness, and music shamanism. For this unique collaboration her own ambient vocals, keyboards, percussion, cello, bass, esraj, and guitars are embedded with clinically proven Alpha Relaxation audio processes developed Dr. Jeffrey Thompson. \n\n Alpha waves are the brainwaves which people natural produce in states of deep relaxation. Dr Jeffrey Thompson has developed unique ways to embed these Alpha pulses into musical soundtracks. After a few minutes of listening your own brainwaves lock onto the pulses and carry you to states of renewing relaxation. \n\n This synergistic fusion of ethereal melodies recorded by Silvia Nakkach, with Dr. Thompson s pioneering audio processes will transport you to a place of inner peace and quiet joy. \n\n Silvia Nakkach, M.A., is an award-winning composer, singer, and psychologist. She is the founding director of the Vox Mundi Project, an organization devoted to the education, preservation, and performance of sacred vocal arts. Silvia was named by Utne Reader magazine as one of forty cutting-edge artists that will shake the art world in the new millennium. \n\n Dr. Jeffrey Thompson s clinical research with thousands of patients over 25 years has led to groundbreaking discoveries in how sound frequency patterns built into musical soundtracks can alter states of consciousness and induce mind-body healing. His audio programs are used by Fortune 500 companies, health care professionals, and individuals worldwide. \n\n 01.Invocation 13.23 \n 02.Refuge 17.29 \n 03.Transformation 16.53 \n 04.Dedication 13.13 \n\n reference libFLAC 1.3.1 20141125 \n\n Secure rip and all tracks AccurateRip verified. Rip log included","torrent":{"xt":"urn:btih:9c0e0f077684e818d2c9989e48753a0873b6c102","amp;dn":"Dr.+Jeffrey+Thompson+-+Unwind+%28Alpha+Relaxation+Solution%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c0e0f077684e818d2c9989e48753a0873b6c102","infoHashBuffer":{"type":"Buffer","data":[156,14,15,7,118,132,232,24,210,201,152,158,72,117,58,8,115,182,193,2]},"announce":[],"urlList":[]}}