{"title":"Lulu - New Routes (1970) MP3@256kbps","uid":9633868,"size":63075649,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9c295bf165f4ae069d6bbd64099faa90da929b76&amp;dn=Lulu+-+New+Routes+%281970%29+MP3%40256kbps&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"AaronVincent","files":16,"time":1392822248,"description":"Lulu in Muscle Shoals, with Duane Allman on guitar? It's just too bad somebody went a little wild with big-band and orchestra arrangements, for with these songs and a small combo, this could have been really fine material. Blame can go to the producing triumvirate, but also to her husband. During this stage of Lulu's career she was married to Maurice Gibb of the Bee Gees, who seems to have had a habit of luring artists into recording near-muzak, with the &quot;near&quot; added out of a sense of politeness. For this to be happening in the musically gritty atmosphere of Muscle Shoals, with not only Allman but three other hot guitarists on board, is practically cause for criminal proceedings. Lulu still has that thick, soulful voice, but at times the way it sits on the arrangements may make the listener think of an Anne Murray record. On the positive side, the cover of the Bee Gees' &quot;Marley Purt Drive&quot; is a rollicking version of one of the Gibbs brothers' best, and largely forgotten, songs. Miracles are done with the warhorse &quot;Mr. Bojangles,&quot; between the bluesy guitar licks and the intoxicating surprise that Lulu is actually pulling it off. Then again there is &quot;Feelin' Allright,&quot; which should have been great but instead sounds like a high school stage band warming up.","torrent":{"xt":"urn:btih:9c295bf165f4ae069d6bbd64099faa90da929b76","amp;dn":"Lulu+-+New+Routes+%281970%29+MP3%40256kbps","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c295bf165f4ae069d6bbd64099faa90da929b76","infoHashBuffer":{"type":"Buffer","data":[156,41,91,241,101,244,174,6,157,107,189,100,9,159,170,144,218,146,155,118]},"announce":[],"urlList":[]}}