{"title":"Adobe Photoshop CS4 Portable","uid":4478535,"size":65275374,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:9d541786b649c2520c4062287c0cd694af9d7832&amp;dn=Adobe+Photoshop+CS4+Portable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"back1ply","files":-1,"time":1225458717,"description":"Adobe Photoshop CS4 software provides improved access to its unrivaled power through a more intuitive user experience, greater editing freedom, and significant productivity enhancements.\n \nPhotoshop CS4, the current eleventh iteration of the program. Photoshop CS4 features additions such as the ability to paint directly on 3D models, wrap 2D images around 3D shapes, convert gradient maps to 3D objects, add depth to layers and text, get print-quality output with the new ray-tracing rendering engine, and enjoy exporting to supported common 3D formats; the new Adjustment and Mask Panels; Content-aware scaling (previously known as seam carving); Fluid Canvas Rotation and File display options . On 30 April, Adobe released Photoshop CS3 Extended, which includes all the same features of Adobe Photoshop CS3 with the addition of capabilities for scientific imaging, 3D, and high end film and video users. The successor to Photoshop CS3, Photoshop CS4, is the first 64-bit Photoshop on consumer computers.\n \n\nAdjustments panel\n Simplify image adjustment by easily accessing every tool you need to nondestructively adjust and enhance the color and tone of your images; on-image controls and a wide variety of presets are also included in the new live and dynamic Adjustments panel.\n\nMasks panel\nQuickly create and edit masks from the new Masks panel. This panel offers all the tools you need to create editable pixel- and vector-based masks, adjust mask density and feathering, easily select noncontiguous objects, and more.\n\nContent-Aware Scaling\n Use the new and revolutionary Content-Aware Scaling feature to automatically recompose an image as you resize it, smartly preserving vital areas as the image adapts to the new dimensions. Get the perfect image in one step without time-intensive cropping and retouching.\n\nExtended depth of field\n Easily create a single image from a series of shots that have different focal points with the enhanced Auto-Blend Layers command, which smoothly blends color and shading and now extends your depth of field, automatically correcting vignettes and lens distortion.\n\nAuto-alignment of layers\nCreate accurate composites with the enhanced Auto-Align Layers command. Move, rotate, or warp layers to align them more accurately than ever before. Or use spherical alignment to create breathtaking panoramas.\n\nEfficient file management with Adobe Bridge CS4\nGet instant access to Adobe Bridge CS4 with faster start-up, use new workspaces to jump to the right display for every task, easily create web galleries and PDF contact sheets, and more.\n","torrent":{"xt":"urn:btih:9d541786b649c2520c4062287c0cd694af9d7832","amp;dn":"Adobe+Photoshop+CS4+Portable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d541786b649c2520c4062287c0cd694af9d7832","infoHashBuffer":{"type":"Buffer","data":[157,84,23,134,182,73,194,82,12,64,98,40,124,12,214,148,175,157,120,50]},"announce":[],"urlList":[]}}