{"title":"Frank Zappa - 1970 - Weasels Ripped My Flesh","uid":5528399,"size":283279397,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9d5da6028de45e80af62a10b86f88c6f52a84962&amp;dn=Frank+Zappa+-+1970+-+Weasels+Ripped+My+Flesh&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"lonesomecowboy","files":-1,"time":1272853051,"description":"F R A N K   Z A P P A\n- Weasels Ripped My Flesh -\n\n&quot;A fascinating collection of mostly instrumental live and studio material recorded by the original Mothers of Invention, complete with horn section, from 1967-1969, Weasels Ripped My Flesh segues unpredictably between arty experimentation and traditional song structures. Highlights of the former category include the classical avant-garde elements of &quot;Didja Get Any Onya,&quot; which blends odd rhythmic accents and time signatures with dissonance and wordless vocal noises; these pop up again in &quot;Prelude to the Afternoon of a Sexually Aroused Gas Mask&quot; and &quot;Toads of the Short Forest.&quot; The latter and &quot;The Eric Dolphy Memorial Barbecue&quot; also show Frank Zappa's willingness to embrace the avant-garde jazz of the period. Yet, interspersed are straightforward tunes like a cover of Little Richard's &quot;Directly From My Heart to You,&quot; with great violin from Don &quot;Sugarcane&quot; Harris; the stinging Zappa-sung rocker &quot;My Guitar Wants to Kill Your Mama,&quot; and &quot;Oh No,&quot; a familiar Broadway-esque Zappa melody (it turned up on Lumpy Gravy) fitted with lyrics and sung by Ray Collins. Thus, Weasels can make for difficult, incoherent listening, especially at first. But there is a certain logic behind the band's accomplished genre-bending and Zappa's gleefully abrupt veering between musical extremes; without pretension, Zappa blurs the normally sharp line between intellectual concept music and the visceral immediacy of rock and R&amp;B. Zappa's anything-goes approach and the distance between his extremes are what make Weasels Ripped My Flesh ultimately invigorating; they also even make the closing title track a minute and a half of squalling feedback, followed by applause perfectly logical in the album's context.&quot;\n\n(from www.allmusic.com)\n\n- for further information look at included cover sheet","torrent":{"xt":"urn:btih:9d5da6028de45e80af62a10b86f88c6f52a84962","amp;dn":"Frank+Zappa+-+1970+-+Weasels+Ripped+My+Flesh","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d5da6028de45e80af62a10b86f88c6f52a84962","infoHashBuffer":{"type":"Buffer","data":[157,93,166,2,141,228,94,128,175,98,161,11,134,248,140,111,82,168,73,98]},"announce":[],"urlList":[]}}