{"title":"Earthquakes - Plate Tectonics and Earthquake Hazards Pdf Gooner","uid":12026949,"size":11758739,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9e811f3d536c20b019fd20c6d8904fa9bbc6288e&amp;dn=Earthquakes+-+Plate+Tectonics+and+Earthquake+Hazards+Pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1434499342,"description":"Pages: 169 \nPublisher: Facts on File (J); 1 edition (March 2008)\nLanguage: English\nISBN-10: 0816064628\nISBN-13: 978-0816064625\n\nEvery day parts of the surface of the Earth are rattled by earthquake tremors, and occasionally, some regions are shaken violently during earthquakes, resulting in widespread damage and destruction. Earthquakes in Iran, Turkey, and Japan have demonstrated how the motion of the Earth's tectonic plates can suddenly make apparently safe environments dangerous and even deadly.&quot;Earthquakes&quot; focuses on the furious power of nature unleashed and the massive devastation that is often a result of the relentless forces that build up within the Earth. Presenting the main ideas of plate tectonics, this comprehensive and insightful reference provides readers with an understanding of how, why, and where most earthquakes occur. Coverage includes what happens during an earthquake, using many examples of hazards such as landslides, passage of seismic-earthquake waves through the ground, and other phenomena that people have encountered during real earthquakes. Black-and-white photographs and line illustrations, an index, a glossary, and a geologic timescale enhance this in-depth resource.Chapters include: General Earth Structure and Plate Tectonics; Divergent Plate Boundaries; Transform Plate Boundaries and Transform Faults; Convergent Margins; Earthquakes; Earthquake Hazards; Earthquake Prediction, Preparation, and Response; and, Descriptions of Earthquake Disasters","torrent":{"xt":"urn:btih:9e811f3d536c20b019fd20c6d8904fa9bbc6288e","amp;dn":"Earthquakes+-+Plate+Tectonics+and+Earthquake+Hazards+Pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e811f3d536c20b019fd20c6d8904fa9bbc6288e","infoHashBuffer":{"type":"Buffer","data":[158,129,31,61,83,108,32,176,25,253,32,198,216,144,79,169,187,198,40,142]},"announce":[],"urlList":[]}}