{"title":"(.ePUB) Raymond Carver - What We Talk About When We Talk About L","uid":10243914,"size":982370,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9ecee6f3a53bd7a9dda4903ac02357c61579d16e&amp;dn=%28.ePUB%29+Raymond+Carver+-+What+We+Talk+About+When+We+Talk+About+L&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"anmisto","files":3,"time":1401236135,"description":"Title: What We Talk About When We Talk About Love\n\nAuthor: Raymond Carver\n\nFormat: .ePUB\n\nDescription:\n\nThis powerful collection of stories, set in the mid-West among the lonely men and women who drink, fish and play cards to ease the passing of time, was the first by Raymond Carver to be published in the UK. With its spare, colloquial narration and razor-sharp sense of how people really communicate, the collection was to become one of the most influential literary works of the 1980s.\n\nNotes: \n\nHaving read the book, it is one of the best short story collections, I have ever come across. Carver's characters are all human beings but the mood is always bleak as if the his characters do not know how to laugh and see the good side of things. Don't get me wrong though; these stories will not dampen your mood. Rather, it will make you think of your own life as you see yourself (even if you are not an American), in those stories. They are short (the shortest is 3 pages) but told in minimalist manner totally devoid of excess words. Every word has a purpose and if you speed read, you will not get what the message is and you will have to go back and read again.\n\nNow onto the .ePUB, it is a conversion from the completely Proofread text of the book done with comparison with the Paperback.","torrent":{"xt":"urn:btih:9ecee6f3a53bd7a9dda4903ac02357c61579d16e","amp;dn":"%28.ePUB%29+Raymond+Carver+-+What+We+Talk+About+When+We+Talk+About+L","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ecee6f3a53bd7a9dda4903ac02357c61579d16e","infoHashBuffer":{"type":"Buffer","data":[158,206,230,243,165,59,215,169,221,164,144,58,192,35,87,198,21,121,209,110]},"announce":[],"urlList":[]}}