{"title":"Dott - Swoon (2013) [FLAC]","uid":9286986,"size":234830196,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9f02d546957e7199ee12578f1c5611044e7b1455&amp;dn=Dott+-+Swoon+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1386036846,"description":"\n  Dott - Swoon (2013) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Indie Pop, Noise Pop, Punk-Pop\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bit Rate: ~ 900 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  01 Small Pony\n  02 Day That I Found You\n  03 Rain Day\n  04 TEFL\n  05 Leave Tonight\n  06 Talk To You\n  07 Love You Too\n  08 Start All Over\n  09 Love You Forever\n  10 Last Summer\n  11 Cherry Blossom\n \n  On their debut album, Swoon, the gals and guy of Dott play a brand of pleasantly upbeat, politely noisy indie pop that will appeal to anyone who misses the glory days of bands like the Popguns and the Darling Buds who were successful with the same basic formula. Like those groups, Dott write instantly hooky songs about love, both lost and found, brought to life by punchy guitars, peppy drums, and powerful lead vocals that are surrounded by lush harmonies. Anna McCarthy is the lead vocalist in question and she's got a perfect voice for this kind of pop, snappy and tough on the uptempo songs, dreamily sweet on the ballads. She delivers a knockout blow on the rollicking &quot;Small Pony,&quot; taps into her inner Julee Cruise on the swooning &quot;TEFL,&quot; and generally sounds like she's auditioning for the lead role in the Shangri-Las' story. And getting the part for sure. \n\n  It's an impressive performance from start to finish and her efforts are matched by the band's throughout. Using a basic guitar-bass-drums approach, they whip up a storm of noise and energy on the fast ones, while stepping back on the slow and midtempo tracks in a nice display of restraint. It's a well-traveled sound, but Dott add plenty of spunky grit and determination to the template, as well as crafting a batch of songs that make some of the bands that inspired them look a little weak in comparison. Almost any song here could be taken out of context to serve as the highlight of a noisy indie pop playlist, but taken together they add up to a steady blast of frolicsome fun and melancholy that will bring back warm memories to fans of classic female-fronted, girl group-inspired indie pop, but should win over people who don't know the Popinjays from the Charlottes just as easily.","torrent":{"xt":"urn:btih:9f02d546957e7199ee12578f1c5611044e7b1455","amp;dn":"Dott+-+Swoon+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f02d546957e7199ee12578f1c5611044e7b1455","infoHashBuffer":{"type":"Buffer","data":[159,2,213,70,149,126,113,153,238,18,87,143,28,86,17,4,78,123,20,85]},"announce":[],"urlList":[]}}