{"title":"Something Possibly Quite Roman - Crusader Kings II mod","uid":11029579,"size":2569464,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:9f0f93c596d5f1f5e9e1eb02497ef205cd1829a3&amp;dn=Something+Possibly+Quite+Roman+-+Crusader+Kings+II+mod&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Nimbleton","files":-1,"time":1410706138,"description":"Something Possibly Quite Roman - Crusader Kings II mod\n\n\nExtract 7zip to your Users[user]DocumentsParadox InteractiveCrusader Kings IImod folder\n\n\n\n\nDESCRIPTION\nNOTE: This mod is considered somewhat finished, thus no longer supported (not even for future patches). However, there is a new mod which is being worked on for the purpose of succeeding this mod. Feel free to check them out at the official Paradox Forum. \n\nEver wondered what the hell ERE meant, as if it was some kind of typo of the HRE? Perhaps you wanted to rule an empire by the name of the Eastern Roman Empire, but all you get is something called the Byzantine Empire? Or ponder if there was an Eastern Roman Empire then why there isnt a Western Roman Empire? Obviously, the Holy Roman Empire is no such thing (don't you dare quote Voltaire)! The answer to this and much more is that history and historical revisionism is a â™¥â™¥â™¥â™¥â™¥ and that is a fact! \n\nThis mod probably does nothing to address any of these questions and issues, but it does bring something more &quot;Romanism&quot; into an era that is supposed to be devoid of such thing and rather filled with those who like to pretend to be it. There has been a recent trend of a &quot;better Roman stuff&quot; mod that intends to bring back historical fidelity into the game when it comes to the topic of all things Roman, this on the other hand though does not shy away from real history, brings historically plausible fantasy into the world of Crusader Kings II. ERE? Check. HRE? Check. WRE? Check. Fantasy empires that really shouldn't exist in this time period? Of course! There are a bit more to this, so check them out below. \n\nRequirements: \n\nCrusader Kings II version 2.1.6 \nLegacy of Rome DLC \nSons of Abraham DLC \n\nFeatures: \n\n- Introducing a forgotten Empire: the Western Roman Empire with its own honorary titles to hand out. \n- New formable Empires and Kingdoms. \n- New bookmarks. \n- Renaming of several empires including the now Eastern Roman Empire. \n- Special Casus Belli to challenge Imperial Authority. \n- De-Latinisation of previously Latinised Empire. \n- Restore the united Roman Empire via traditional conquest route or by uniting the two halves. \n- Catholics can now mend the schism with the results being all of Christendom becoming united (same goes for Orthodox decision as well). \n- Turks with the correct title can now claim or wage war to become the Qaisar of Rum. \n- Once the player restores the borders of the Ancient Roman Empire at its peak, the player can decide to re-divide the empire back into West and East. \n- If the player is sick of blobbing, then they can now opt to return the Dominate back to the Principate, the result being Rome will now become a Merchant Republic (requires being a Roman and &quot;The Republic&quot;). \n- Once making money becomes boring, they are free to either return to being an Empire or commit the ultimate taboo: declare yourself King (requires being Roman). \n- If a player feels like a challenge, via decisions and events, they can revive the old Roman culture and/or return to the Hellenic Pagan religion (latter requires &quot;Sons of Abraham&quot; and &quot;The Old Gods&quot;). \n- As a homage (nothing more, nothing less), Roman Hellenic Pagan can form both the Western and the Eastern Roman Empires as well as restoring the united Roman Empire. \n- As a Roman, the player can now adopt a person of their choosing (Augustus). \n- New Roman cultural buildings and retinues. \n- Just cause it â™¥â™¥â™¥â™¥ed me off, there are no republic or theocracy vassal limit. \n- Once finished, you can now convert to Europa Universalis with its own converter (Converter Kings Universalis) which also ports over new nations and what-not (requires the &quot;Europa Universalis IV Converter&quot;). \n","torrent":{"xt":"urn:btih:9f0f93c596d5f1f5e9e1eb02497ef205cd1829a3","amp;dn":"Something+Possibly+Quite+Roman+-+Crusader+Kings+II+mod","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f0f93c596d5f1f5e9e1eb02497ef205cd1829a3","infoHashBuffer":{"type":"Buffer","data":[159,15,147,197,150,213,241,245,233,225,235,2,73,126,242,5,205,24,41,163]},"announce":[],"urlList":[]}}