{"title":"Hentai / Romance is in the Flash of the Sword II  eps 1-6 ","uid":6601293,"size":1728080079,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:9f18c0fa226f29347dddf67c1d592effdcbe5e1b&amp;dn=Hentai+%2F+Romance+is+in+the+Flash+of+the+Sword+II++eps+1-6+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jimevjr","files":7,"time":1313223269,"description":"UNCENSORED/ENGLISH AUDIO\n\neps 1\n\nRomance is what human encounters produce... And, sometimes, it impales one\\'s heart the way a flash of a \nsword can... The times are hard in these lands. Our group of blade swingers and demon catchers battle \nagainst evil, trying to stop the resurrection of a horrible demon. Little do they know all she needs is \nKeith\\'s sacred fluid. Jannette, the female mercenary who came to help Keith, is kidnapped by bandits and \nis taken to their stronghold. They repeatedly have there way with her. \nWill Keith arrive in time to rescue her before the chief of the bandits succeeds in penetrating her? \nWith the sexual stimulant applied, her desire is too strong, and she can\\'t help but beg Keith to provide \nwhat her body demands. Will Keith succeed in satisfying her sexual desires? \n\neps 2\n\nKeith and Rena embark on a new adventure to find the high Priestess that has been captured by the evil \nDolfus. Dolfus, a demonic monster, holds her in his lair as he has his way with her. He waits for Rena \nto fall into his trap. The monster is after her sex elixir, its hidden energy is to resurrect its \nmaster, the God of Darkness. Will Keith be able to save them all?\n\neps 3\n\nA new job falls into the lap of Keith, the Adventurer!!!\n\nA HOT piece of tail can be quite persuasive as Keith soon finds out. Lyons precious Lute was taken by a \nrobber. The evil Duke is plotting to murder the royal family as he amuses himself by leaving his load in \na group of fair maidens. Sexually charged, the Duke finds pleasure not only in woman but also in men. \nWill Keith and Lyon recover her precious Lute and save the royal family?\nWill she reward him for his loyalty with her firm knockers and precious pink Cadillac? \n\neps 4 \n\nNew Encounters, New Adventures!!!\n\nOn their way to deliver the Silver Rainbow, Keith and his gorgeous childhood crush, Mysty, stumble upon \na band of thieves as they kidnap a beautiful virgin elf and her magic unicorn. With their long time pent \nup frustration flowing through their bodies, Keith &amp; Mysty succumb to their desire when no sooner do they \nneed to rescue the virgin elf from her scheming assailants. The elf, unable to suppress her desire for her \nhero, hesitates before telling Keith \\&quot;As an elf, I must give my virginity to my rescuer\\&quot;. As they engage \nin raw, passionate sex, all Keith can do is smile and think \\&quot;To the victor goes the spoils\\&quot;.\n\neps 5\n\nSpecial Massage at The House Of Adventurers !!! When Keith happens across Spika, he notices another beautiful \nwoman shadowing her. Is it a ghost? Determined to solve the mystery, Keith follows Spika to some haunted ruins, \nwhere a masseuse works on her naked body, touching and exciting her sexual desires. As he watches, strange smoke \nfrom incense drifts over, knocking him unconscious. The next thing he knows, he\\'s having heated sex with the \nmasseuse. With Keith\\'s unflinching desire to help, Ellise regains her physical body and consummates her sexual \ndesires.\n\nWill Keith Slay the creature and save Ellise?\n\nHot Sex and Hot Secrets are about to be exposed!!!\n\n\neps 6\n\nKeith witnesses a monster kidnap Elfarcia. The creature takes her to an old castle on top of a lonely island \ndeserted in the middle of a lake. The monster is a servant of an evil wizard, who is after her prize and her \nbody. The wizard intends to destroy the Earth using black magic.\n\nWill Keith arrive before Elfarcia is penetrated? Will the wizard prove to be too powerful to defeat?\n\nOnly Keith\\'s friends, Spika, Jannette, Rena, Carmine, Rycure, Bagas and Slimester can come to his rescue. \n\nThe sexually explosive finale to this exciting series!!","torrent":{"xt":"urn:btih:9f18c0fa226f29347dddf67c1d592effdcbe5e1b","amp;dn":"Hentai+%2F+Romance+is+in+the+Flash+of+the+Sword+II++eps+1-6+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f18c0fa226f29347dddf67c1d592effdcbe5e1b","infoHashBuffer":{"type":"Buffer","data":[159,24,192,250,34,111,41,52,125,221,246,124,29,89,46,255,220,190,94,27]},"announce":[],"urlList":[]}}