{"title":"Politically Incorrect Documentaries","uid":4308811,"size":9435647398,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9f1f5ce7fdc5c28e9bcf83b08a661ccf8a4f31c8&amp;dn=Politically+Incorrect+Documentaries&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"echopulse","files":16,"time":1216694386,"description":"This is a collection of documentaries that question the status quo of the Media, and debunks a lot of what most people believe about various political and issues. If you are a close-minded liberal, some of them will offend you, but you will learn something. They present the viewpoint of many different political persuasions, including liberalisim, and libertarianisim. Have fun!\n\n\n1. Four Centuries of American Education:\n\nHow has American education changed since America was founded? What did the founding fathers think about mixing God and the classroom? What would they say if they could see how secular it is now? What did they think about prayer in school? This educational documentary answers those questions, and a whole lot more.\n\n\n2. A Tax System Worthy of 21st Century America:\n\nThis short video properly explains the history of the income tax, how it has been abused, and why it should be replaced. Then it answers the question: Can the income tax be replaced with a national retail sales tax? Should it? It then explains the Fair Tax in detail, a plan that will not only abolish the income tax and the IRS, but just about every other federal tax you can think of. Interesting!\n\n3. America: From Freedom to Fascism:\n\nThis eye-opening documentary describes Aaron Russo's quest to answer the question: Did congress ever pass a law mandating that we must pay an income tax? Also, was the 16th amendment really ratified by a majority of states? He does not think so, and sets out to prove it. He also questions the legality of the Federal Reserve System, and presents his take on many other topics concerning government control of our lives.\n\n\n4. Cochise County: Cries from the Border:\n\nCochise County Arizona resident Mercedes Maharis directs this documentary about a community living in the crosshairs of an ongoing immigration battle. As Americans react with growing alarm to a porous southern border, Maharis asks residents to comment on their experience living in a contested zone. Features footage of border crossings, and interviews with Border Patrol officials, civil rights activists, and illegal immigrants.\n\n\n5. Expelled - No Intelligence Allowed - Trailer\n\nBen Stein's documentary simply explains the obvious, and does so with genius, humor, and truth. After seeing this excellent movie, you will understand why it takes a whole lot more faith to believe in evolution than it does to believe in Intelligent Design. This film will make the academic pride folks squirm. Why are they so irate? Could it be that they are just proving Stein's message? Stein films Mr.Dawkins sharing how he hates God, yet denying God exists. (Note from Uploader: I did not write this review, it comes from IMDB.)\n\n\n6. Global Warming or Global Governance:\n\nIs there an agenda that motivates supporters of catastrophic man-made global warming? Are the leaders and advocates really a benevolent confederation of concerned scientists and citizens who simply desire to protect the environment \nand care for the poor? Or are they being used by others who have a political goal in mind? In this eye opening documentary, you will not only hear from leading scientist and climatologist who refute the current crop of alarmists cries; but also congressmen, economists, newscasters and sociologists who believe that something more sinister is involved.\n\n\n7. Indoctrinate U:\n\nSpeech codes. Censorship. Enforced political conformity. Hostility to diversity of opinion. Sensitivity training. We usually associate such things totalitarian regimes, not with the American universities that nurtured the free speech movement. When we think of going to college, we think of intellectual freedom. We imagine four years of exploring ideas through energetic, ongoing, critical thinking and debate, but the reality is very far from the ideal. What most of us do not know is that American college students check their First Amendment rights and individual freedom at the door.\n\n\n8. Left of the Dial:\n\nThis undercover documentary charts the long-anticipated rise, scandalous near-fall, and subsequent salvation of Air America Radio, a liberal radio network geared towards those whose opinions skew a bit more to the Left of the Dial. Told through verite footage shot at the New York-based station over a nine-month period the 90-minute film documents the network's evolution twelve days before and up to its March 2004 launch through a much-publicized scandal involving bounced checks that nearly ended the dream. It concludes with a disappointing 2004 election that spawned new resolve among the talent staff and management of the station.\n\n\n9. Manufacturing Dissent:\n\nIn the realm of documentary filmmaking there is no greater icon than Michael Moore but are his films really the truth, the whole truth, and nothing but the truth? At what point does the manipulation of fact become a work of fiction? See for yourself when the lens is turned on the most controversial director of our time. Discover the film that Michael Moore doesn't want you to see.\n\n\n10. Michael Moore Hates America:\n\nThe controversial documentary by Michael Wilson examines the filmmaking methods of Director Michael Moore (Fahrenheit 9/11, Bowling for Columbine, Roger &amp; Me) and finds that not all is as it seems in the world of Hollywood documentaries. With the goal of getting an interview with the increasingly embittered and elusive Moore, Michael Wilson travels the country to tell the inspiring story of a nation and its everyday people, resulting in a film so honest and surprisingly self-critical that it will never win the top prize at Cannes. \n\n\n11. The Fair Tax: It's Time!\n\nThis short video documents the growing grassroots movement that sprung up supporting the Fair Tax, and explains how they plan to abolish the IRS, the income tax, and just about every other federal tax you can think of.\n\n\n12. The Great Global Warming Swindle:\n\nEverything you\u001ave ever been told about Global Warming is probably untrue. From Al Gore's An Inconvenient Truth to news reports from the popular media outlets and even public classrooms which, in chicken little fashion, seem to be screaming - the sky is falling. But is it really? This film blows the whistle on what may be the biggest swindle in modern history.\n\n\n13. Voices of Iraq:\n\nThe people of Iraq tell their amazing stories in this fascinating and important documentary which gives Iraqi men and women the chance to describe in their own words their years under Saddam Hussein and their struggle to create their own stable society in a period of appalling violence. Producers Eric Manes Archie Drury and Martin Kunert distributed 150 digital video cameras to Iraqis all over the country and the resulting 400 hours of footage includes powerful testimony from sheiks and insurgents mothers and children and everyday workers each discussing their perspective hopes and daily lives.\n\n\n14. Who Killed the Electric Car?\n\nIn 1996 electric cars began to appear on roads all over California. They were quiet and fast produced no exhaust and ran without gasoline. Ten years later these futuristic cars were almost entirely gone. What happened? Why should we be haunted by the ghost of the electric car? After watching this eye-opening film, you will be amazed when you find out who's really guilty for killing the electric car.\n\n\n15. Why Wal*Mart Works, and Why that Makes Some People Crazy:\n\nDocumentary producers Ron and Robert Galloway present an insider's look at the world's largest company, and how Wal-Mart's quest for better pricing has created new efficiencies in distribution and an overall stronger marketplace. What makes Wal-Mart work? Is it better pricing, convenience, quality and selection? Perhaps, but the Galloways discover that the incredible family of Wal-Mart Associates may well be the company's greatest asset of them all.","torrent":{"xt":"urn:btih:9f1f5ce7fdc5c28e9bcf83b08a661ccf8a4f31c8","amp;dn":"Politically+Incorrect+Documentaries","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f1f5ce7fdc5c28e9bcf83b08a661ccf8a4f31c8","infoHashBuffer":{"type":"Buffer","data":[159,31,92,231,253,197,194,142,155,207,131,176,138,102,28,207,138,79,49,200]},"announce":[],"urlList":[]}}