{"title":"The Grapes of Wrath 1940 DVDRip Sonata Premiere","uid":9168968,"size":736988396,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9f38cca7b0f8988c903c4ff0d3c7081624d1033d&amp;dn=The+Grapes+of+Wrath+1940+DVDRip+Sonata+Premiere&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"klinho","files":6,"time":1384037534,"description":"The adaptation of Nobel Prize-winner John Steinbeck's Pulitzer Prize-winning novel of dirt-poor Dust Bowl migrants by 4-time Oscar-winning director John Ford starred Henry Fonda as Tom Joad, who opens the movie returning to his Oklahoma home after serving jail time for manslaughter. En route, Tom meets family friend Casey (John Carradine), a former preacher who warns Tom that dust storms, crop failures, and new agricultural methods have financially decimated the once prosperous Oklahoma farmland. Upon returning to his family farm, Tom is greeted by his mother (Oscar-winner Jane Darwell), who tells him that the family is packing up for the &quot;promised land&quot; of California. Warned that they shouldn't expect a warm welcome in California--they've already seen the caravan of dispirited farmers, heading back home after striking out at finding work--the Joads push on all the same. Their first stop is a wretched migrant camp, full of starving children and surrounded by armed guards. Further down the road, the Joads drive into an idyllic government camp, with clean lodging, indoor plumbing, and a self-governing clientele. When Tom ultimately bids goodbye to his mother, who asks him where he'll go, he delivers the film's most famous speech: &quot;I'll be all around...Wherever there's a fight so hungry people can eat...Whenever there's a cop beating a guy, I'll be there...And when the people are eatin' the stuff they raise and livin' in the houses they build. I'll be there too.&quot; \n\n\nSubs srt: Portuguese / Spanish / French / Italian / German","torrent":{"xt":"urn:btih:9f38cca7b0f8988c903c4ff0d3c7081624d1033d","amp;dn":"The+Grapes+of+Wrath+1940+DVDRip+Sonata+Premiere","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f38cca7b0f8988c903c4ff0d3c7081624d1033d","infoHashBuffer":{"type":"Buffer","data":[159,56,204,167,176,248,152,140,144,60,79,240,211,199,8,22,36,209,3,61]},"announce":[],"urlList":[]}}