{"title":"Artemis Fowl and the Time Paradox read by Nathaniel Parker","uid":4657999,"size":320110707,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:9fbd627376ab82c65105dacbe6d783ae3da91498&amp;dn=Artemis+Fowl+and+the+Time+Paradox+read+by+Nathaniel+Parker&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zennscott","files":169,"time":1232279568,"description":"Picking up at Fowl Manor, we learn that three years have passed while Artemis was otherwise occupied, and that he now has two brothers, twins named Beckett and Myles. This book goes in a different direction to the previous plot, making no mention of some of the characters introduced in The Lost Colony. There are references to certain events, but other than the main characters, most of the story is new material.\n\nAs the title implies, an older and more mature Artemis Fowl enlists the help of his friend Captain Holly Short, dwarf Mulch Diggums and the imp warlock No.1 to journey to the past to correct a mistake he made earlier in his eventful life. His mother has contracted a rare disease that can only be cured by an extract from the brain of an extinct lemur, and ironically, the extinction was hastened by young Fowl himself.\n\nThe time trip gets very complicated when Artemis matches wits with his younger self, and rescuing the lemur from Dr. Damon Kronski, leader of the Extinctionists cult, proves to be much easier planned than achieved. To make it more complicated, there's now a fledgling romantic situation in play, and the return of an enemy from the past who also wants possession of the lemur.","torrent":{"xt":"urn:btih:9fbd627376ab82c65105dacbe6d783ae3da91498","amp;dn":"Artemis+Fowl+and+the+Time+Paradox+read+by+Nathaniel+Parker","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9fbd627376ab82c65105dacbe6d783ae3da91498","infoHashBuffer":{"type":"Buffer","data":[159,189,98,115,118,171,130,198,81,5,218,203,230,215,131,174,61,169,20,152]},"announce":[],"urlList":[]}}