{"title":"Magic Window 1.4","uid":8645701,"size":584778019,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:a008730341c973ff9339d618f0586c5b38d56011&amp;dn=Magic+Window+1.4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"bjornagainswede","files":-1,"time":1372980238,"description":"Our friend with the Fancy Chinese DNG installers uploaded this one yesterday,,, seemingly seeded it to around 60% and then quietly pissed off... and seemingly took the torrent with him! Big thanks dude! Anyhow... grabbed it elsewhere so here you go!\n\n===================================================================\n\nMagic Window shows complete time lapse sunrises and sunsets as your wallpaper. Watch as time slowly moves by and the sun and clouds paint the skies beautiful colors. These are living pictures that progress slowly and are not distracting like video.\n\nThe accompanying screensaver lets you watch the Timelapse scenes at faster speeds. Perfect for flat panels and external displays, your friends and co-workers will gawk at your beautiful and amazing desktop.\n\nCreated by the same team that brought you Magic Window for iPad and iPhone, the Mac version takes a completely new approach by bringing Timelapses directly to your desktop. We have included some of our absolute best photography including beaches, cities, coasts, and more for you to enjoy while you work or relax at home.\n\nMagic Window for Mac scenes are 1920Ã—1200 resolution which looks fantastic on every single Mac as well as HD displays. These are truly high definition wallpapers, not stretched low resolution videos. Magic Window also fully supports multiple monitors, allowing you to have different scenes on each display.\n\nMagic Window offers a variety of speeds that let you control how much CPU it consumes. On the slowest speed Magic Window can consume less than 1% CPU, leaving your Mac free to focus on other tasks.\n\nThis version includes 20 scenes: 5 are built into the app, and 15 are downloaded after you install the app. We use scene downloads so we can bring you more and more scenes without making the app larger and larger. Updates will include additional scenes.\n\nEach scene contains over 1,000 photographs.\n\nScenes Included:\n\nArroyo Seco Parkway, Los Angeles\nBoston Logan Airport\nChicago Skyline\nGlen Lake Sunset, Montana\nHalf Moon Bay Cliffs, California\nCarson Valley, Nevada\nLifeguard Tower #22, Santa Monica\nLos Angeles Skyline\nMartinez Refinery\nNew York City Skyline\nOakland Railyards\nPacifica Cliffs, California\nPortland Skyline\nSeattle Skyline\nSanta Monica Bay, California\nGolden Gate Sunrise, San Francisco\nTank Hill, San Francisco\nOne Sansome, San Francisco\nTreasure Island View, San Francisco\nThird and Market, San Francisco\nPLEASE NOTE: This is not a system screensaver, it works independently of the system screensaver.\n\nMo' Here: http://magicwindowapp.com/","torrent":{"xt":"urn:btih:a008730341c973ff9339d618f0586c5b38d56011","amp;dn":"Magic+Window+1.4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a008730341c973ff9339d618f0586c5b38d56011","infoHashBuffer":{"type":"Buffer","data":[160,8,115,3,65,201,115,255,147,57,214,24,240,88,108,91,56,213,96,17]},"announce":[],"urlList":[]}}