{"title":"Lana_Del_Rey_-_Born_To_Die-PROPER-Ltd_Deluxe_Edition-2012-MOD","uid":6987078,"size":116634777,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a085fab449c15c389330b863b02205e4822070ef&amp;dn=Lana_Del_Rey_-_Born_To_Die-PROPER-Ltd_Deluxe_Edition-2012-MOD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"RoffeTheCoolMan","files":16,"time":1327603420,"description":"Beskrivning:\nArtist: Lana Del Rey\nTitle Of Album: Born to die\nYear Of Release: 26-01-2012\nLabel: Vertigo Berlin (Universal)\nGenre: Indie Pop\nFormat: mp3\nQuality: avg. 255kbps\nTotal Time: 60:49 min\nfilepost.com ,\n\nTracklist:\n1. Born To Die\n2. Off To The Races\n3. Blue Jeans\n4. Video Games\n5. Diet Mountain Dew\n6. National Anthem\n7. Dark Paradise\n8. Radio\n9. Carmen\n10. Million Dollar Man\n11. Summertime Sadness\n12. This Is What Makes Us Girls\n13. Without You\n14. Lolita\n15. Lucky Ones\n\nEditorial Reviews\nSometimes stars emerge. Sometimes stars are thrust upon us. And sometimes stars simply slip into the atmosphere as if propelled by something otherworldly. It is into this last category that the astonishing presence, voice, look and feel of Lana Del Rey falls. Musical stardom is not an option with Ms Del Rey. It is her vocation. She calls herself the `gangsta Nancy Sinatra' and defines her genre as `Hollywood pop/ sadcore', a dramatic new loop for pop music. \n\nLana Del Rey grew up Lizzy Grant in Lake Placid on the outer edges of New York State. Herein some of her unique music flavour was incubated. `It has an epic, nostalgic feel. It's in the middle of a national park that is six hours from New York City. But it's also a struggle because it's a town built on tourism that no-one goes to anymore.' \n\nAt 18, she fulfilled her lifelong ambition of decamping to New York City. `Since I was little I knew I would end up there,' she says, `Every day is a pleasure there. Every single day I walk out of the door is a good day. I like everything about it. New York totally rewards me for my love of it.' \n\nLana Del Rey's direct influences were visual as well as musical; David Lynch, soundtracks for `50s black and white movies, the whirring sound of the Ferris at Coney Island, fame itself. She lived in a New Jersey trailer park and decked her homestead in flags, streamers and seasonally inappropriate Christmas lights. `All the things I love,' she notes. This was Lana's world now and it needed to sparkle. \n\nShe intends to work with hip-hop heavyweights, with the future-perfect foot soldiers at the coal face of exciting pop. `I know it is going to take a lot of work to get there. But that's OK when you have people around you who believe in you. The record is going to be gorgeous. That much we know. Whether or not it will work? That much we don't know.' \n\nAs for the inevitable stardom that will come her way? That is something Lana Del Rey does not fear. `I know a lot of different people. When they are drunk, in the dark of the night they all want the same thing. They all want to be famous. It's innately human to want other people to bear witness to your life. It's important for people to be watched. They don't want to be alone. I don't want to be alone.' \n \n \n","torrent":{"xt":"urn:btih:a085fab449c15c389330b863b02205e4822070ef","amp;dn":"Lana_Del_Rey_-_Born_To_Die-PROPER-Ltd_Deluxe_Edition-2012-MOD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a085fab449c15c389330b863b02205e4822070ef","infoHashBuffer":{"type":"Buffer","data":[160,133,250,180,73,193,92,56,147,48,184,99,176,34,5,228,130,32,112,239]},"announce":[],"urlList":[]}}