{"title":"Energy Efficiency Manual - Donald R. Wulfinghoff","uid":14700109,"size":40825669,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a098043ae58bce1abcb9aade31cfa8d13fbb6a46&amp;dn=Energy+Efficiency+Manual+-+Donald+R.+Wulfinghoff&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1464295436,"description":"Energy Efficiency Manual - Donald R. Wulfinghoff (Energy Institute Press, 1999).pdf\r\n\r\nISBN 0-9657926-7-6\r\n\r\nPublisher Provided Annotation Energy Efficiency Manual, by Donald Wulfinghoff, is the new comprehensive reference &amp; how-to-book for energy conservation in commercial buildings, residential buildings &amp; industrial plants. It combines the features of encyclopedia, textbook &amp; practical field manual. This handbook details 400 actions for conserving energy in design, construction, retrofit, operation &amp; maintenance. They cover heating &amp; cooling efficiency, water conservation, insulation, air leakage, lighting, daylighting, solar heating &amp; industrial equipment. The second part explains renewable energy sources, passive solar, wind energy, geothermal heat pumps, energy conservation codes, environmentally safe refrigerants, energy management computers &amp; building automation systems, electricity rates, high efficiency motors, boilers, air conditioning equipment, fans, pumps, insulation, high efficiency lamps, thermostats, time controls &amp; many other topics. Written as an easy conversation with readers of all backgrounds, it is packed with ratings, tips, illustrations &amp; examples that make it easy to find the right conservation measures for every application. The clear non-mathematical presentation is for everyone from homeowners to architects, engineers, contractors, property managers, plant operators, business owners, financial managers, energy auditors, public utilities, students &amp; faculty. Environmental protection, comfort, health &amp; safety are major themes. Learn how to improve indoor air quality &amp; avoid &quot;sick building syndrome.&quot;","torrent":{"xt":"urn:btih:a098043ae58bce1abcb9aade31cfa8d13fbb6a46","amp;dn":"Energy+Efficiency+Manual+-+Donald+R.+Wulfinghoff","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a098043ae58bce1abcb9aade31cfa8d13fbb6a46","infoHashBuffer":{"type":"Buffer","data":[160,152,4,58,229,139,206,26,188,185,170,222,49,207,168,209,63,187,106,70]},"announce":[],"urlList":[]}}