{"title":"The Fiery Cross (Unabridged) by Diana Gabaldon","uid":4236872,"size":1576956308,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a0d4f512bde5648c338abbdeb931ac24702fbf4b&amp;dn=The+Fiery+Cross+%28Unabridged%29+by+Diana+Gabaldon&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ithasn","files":47,"time":1213339870,"description":"This is the full length Unabridged version of the fifth book in the Outlander series created by Diana Gabaldon. I had a difficult time finding this book. I was getting so desperate I almost decided to pay to rent it from Recorded Books. It seems that the abridged version is everywhere but hardly anyone carries the Unabridged version. Even my local library has all the other Outlander books in Unabridged but this one is only available in the shortr version. Seeing as the full version is over 55 hours long and the abridged version is 9 hours long I couldn\\\\\\&amp;#039;t see how they could cut 46 hours out and still tell a good story. So I searched and finally through an inter library loan program I was able to obtain it.\n\nSo here it is all 55 hours 37 minutes and 45 seconds of listening pleasure.\n\nI have yet to listen to it so I can\\\\\\&amp;#039;t give you a critique\\\\\\&amp;#039;\nIf it\\\\\\&amp;#039;s like her other work though I am sure you\\\\\\&amp;#039;ll enjoy it. I know I have enjoyed the series so far.\n\nThere are 47 individual MP3s. I ripped and encoded each CD into one MP3. Sorry, no cue sheets. They are encoded at highest quality 64 bit rate stereo. I wanted them to be small but decent quality.\n\nEnjoy.\n\nOh one last thing, please help me seed this if you can because I am not able to seed everyday.\n\nThanks,\nIthasn","torrent":{"xt":"urn:btih:a0d4f512bde5648c338abbdeb931ac24702fbf4b","amp;dn":"The+Fiery+Cross+%28Unabridged%29+by+Diana+Gabaldon","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a0d4f512bde5648c338abbdeb931ac24702fbf4b","infoHashBuffer":{"type":"Buffer","data":[160,212,245,18,189,229,100,140,51,138,187,222,185,49,172,36,112,47,191,75]},"announce":[],"urlList":[]}}