{"title":"Pino Daniele - Nero A Meta TQMP","uid":4906312,"size":240356143,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a122a4f2a541d7dfeadd98bbc4f52ec55e920c4e&amp;dn=Pino+Daniele+-+Nero+A+Meta+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"zootallure","files":25,"time":1242912572,"description":"Pino e grande. Quelli che lo conoscete lo sapete, queli che non lo conoscete, scaricate e ascoltate...\n\nPino Daniele was born to a working-class family of Naples, his father being a port worker. A self-taught guitarist, he began his career as a musician playing for other successful singers of the 1970s.\n\nHis striking debut in the Italian music world was in 1977 with the album Terra mia, which proved to be a successful mix of Neapolitan tradition and Blues sounds. Daniele defined his music with the term &quot;taramblu&quot;, which indicated a mix of tarantella, blues and rumba. His lyrics also attracted critical praise: written and sung in an intense Neapolitan, they contained strong though bitter accusations against the social injustices of Naples, as well as Italian society in general, and included melancholic personal themes. Several of the later songs are characterized by a free intermingling of English, Italian and Neapolitan passages.[citation needed]\n\nDaniele's talent was confirmed on the following album Pino Daniele (1979). He scored his greatest success in 1980, with Nero a metÃƒÂ  (&quot;Half-Black Skinned&quot;), which was noted by some authorities as the hallmark of the rebirth of Neapolitan song. In that year Daniele opened the Bob Marley concert at the San Siro stadium in Milan. In 1981 Vai Mo was released. The presence of some of the most renowned musicians of the Neapolitan musical milieu, including James Senese, Enzo Avitabile, Tullio De Piscopo and Tony Esposito, as session men on his albums has also been widely praised.\n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project we, fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill :)\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC with 1024kb/s\nGet Your Free Copy of the EAC and FLAC suite at: &lt;a href=&quot;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&lt;/a&gt;\n\nPlease feel free to join the TQMP project!\nThe &quot;rules&quot; are simple: Rip your CD (no 1980's cassettetapes or vinylrips please!) in lossless format AND include artwork. Include cue- and logfiles for the purists and the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..)\n\nSay Ã‚Â»thank youÃ‚Â« by seeding... just seed, it is not harmful to your health :-)","torrent":{"xt":"urn:btih:a122a4f2a541d7dfeadd98bbc4f52ec55e920c4e","amp;dn":"Pino+Daniele+-+Nero+A+Meta+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a122a4f2a541d7dfeadd98bbc4f52ec55e920c4e","infoHashBuffer":{"type":"Buffer","data":[161,34,164,242,165,65,215,223,234,221,152,187,196,245,46,197,94,146,12,78]},"announce":[],"urlList":[]}}