{"title":"Filter and The Crystal Method - (Can't You) Trip Like I Do [prom","uid":11624519,"size":136558596,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:a13cbe916955070b30633f5298c61c7c8d50ce72&amp;dn=Filter+and+The+Crystal+Method+-+%28Can%27t+You%29+Trip+Like+I+Do+%5Bprom&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"SgtRlee","files":-1,"time":1417603168,"description":"Filter and The Crystal Method - (Can't You) Trip Like I Do [promo].VOB\n\n\nHQ rare promo music video from a promo DVD. &quot;(Can't You) Trip Like I Do&quot; is a reworking of &quot;Trip Like I Do&quot;, a song featured on The Crystal Method's debut album Vegas. The track was recorded for the 1997 film adaptation of the Spawn comic book series. The song was co-written by Filter, who also appeared on vocals and guitars and in the song's video. &quot;(Can't You) Trip Like I Do&quot; is the opening song on the film's soundtrack release, Spawn: The Album and is heard in the credits. The song was also used for the theatrical trailer of The Matrix and promotional trailers for the Enter The Matrix video game but it does not appear in the film, nor on the soundtrack. \n\nPeak chart position 1997 U.S. Billboard Modern Rock Tracks #29\n\n\nFilter is an American industrial rock group formed in 1993 in Cleveland by singer Richard Patrick and guitarist/programmer Brian Liesegang. The band was formed after Patrick desired to start his own band after leaving Nine Inch Nails as their touring guitarist. Their debut album, Short Bus, was released in 1995, and ended up going platinum, selling over one million copies, largely due to the success of the band's single &quot;Hey Man, Nice Shot&quot;. After the album, the band would go through the first of many line-up changes, leaving Patrick as the only consistent member across all music releases.\n\n\nThe Crystal Method is made up of two members, Ken Jordan and Scott Kirkland. Before The Crystal Method was formed, Ken and Scott started working on music while working at a grocery store and while Ken was a local DJ in Las Vegas as well as the college radio program director at UNLV. Ken taught Scott how to DJ, and when Ken moved to L.A. to work for a producer, Scott took over his job DJing at the local club. Scott would follow Ken out to L.A., and they formed The Crystal Method in 1993.\n\nThe Crystal Method have released 4 studio albums, 4 extended plays, 3 mix albums, 1 soundtrack album, 30 singles, and 9 music videos. The album Vegas has sold more than one million copies in the United States, certifying it platinum. It is one of the best selling electronic albums in the United States, and it puts The Crystal Method in the top five best selling electronic bands in the United States. The Crystal Method's other three studio albums, Tweekend, Legion of Boom, and Divided by Night have charted high on the Billboard 200, especially for electronic albums, all making it to the thirties and charting especially high on the &quot;Top Electronic Albums&quot; category.\n(video does not have any logos)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/(Can't_You)_Trip_Like_I_Do&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/(Can't_You)_Trip_Like_I_Do&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/KaIllAaGa&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/KaIllAaGa&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic:     \n   Video: MPEG2 Video 720x480 (4:3) 29.97fps 8000kbps\n   Audio: Dolby Digital AC3 48000Hz stereo 192kbps\n   Duration: 00:04:23\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.7.7\n\n*Media Player Classic Home Cinema*         &lt;a href=&quot;\nhttp://mpc-hc.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.org/&lt;/a&gt; \n\nSgtRlee (Sgt.R.Lee)","torrent":{"xt":"urn:btih:a13cbe916955070b30633f5298c61c7c8d50ce72","amp;dn":"Filter+and+The+Crystal+Method+-+%28Can%27t+You%29+Trip+Like+I+Do+%5Bprom","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a13cbe916955070b30633f5298c61c7c8d50ce72","infoHashBuffer":{"type":"Buffer","data":[161,60,190,145,105,85,7,11,48,99,63,82,152,198,28,124,141,80,206,114]},"announce":[],"urlList":[]}}