{"title":"LIMBO - Full Game - Pre Cracked - [InsertionPoint]","uid":8098377,"size":76026370,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a22138111930e2c0ea4e919a4aa7dce31c67244d&amp;dn=LIMBO+-+Full+Game+-+Pre+Cracked+-+%5BInsertionPoint%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"InsertionPoint","files":3,"time":1359909728,"description":"Limbo is a 2D sidescroller, incorporating the physics system Box2D to govern environmental objects and the player character. The player guides an unnamed boy through dangerous environments and traps as he searches for his sister. The developer built the game's puzzles expecting the player to fail before finding the correct solution. Playdead called the style of play &quot;trial and death&quot;, and used gruesome imagery for the boy's deaths to steer the player from unworkable solutions.\n\nThe game is presented in monochromatic black-and-white tones, using lighting, film grain effects and minimal ambient sounds to create an eerie atmosphere often associated with the horror genre.\n\nThe primary character in Limbo is a nameless boy who awakens in the middle of a forest on the &quot;edge of hell&quot;.  While seeking his missing sister, he encounters only a few human characters, who either attack him, run away, or are dead. At one point during his journey, he encounters a female character, who abruptly vanishes before he can reach her. The forest eventually gives way to a crumbling city environment. On completion of the final puzzle, the boy is thrown through a pane of glass and back into the forest. He walks a short distance until he again encounters a girl, who, upon his approach, stands up, startled. At this point, the game abruptly ends.\n\n\nThis is an executable file, no extraction required...so just download, install and PLAY...!\n\nComment any error except the ones mentioned in the readme file.\n\nRegards InsertionPoint","torrent":{"xt":"urn:btih:a22138111930e2c0ea4e919a4aa7dce31c67244d","amp;dn":"LIMBO+-+Full+Game+-+Pre+Cracked+-+%5BInsertionPoint%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a22138111930e2c0ea4e919a4aa7dce31c67244d","infoHashBuffer":{"type":"Buffer","data":[162,33,56,17,25,48,226,192,234,78,145,154,74,167,220,227,28,103,36,77]},"announce":[],"urlList":[]}}