{"title":"FSX VoxATC","uid":7112782,"size":6458911,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a284a1f4ab643dcc35c5acbf42013a657eaece5e&amp;dn=FSX+VoxATC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"highlander21","files":1,"time":1332118213,"description":"Latest News: Version 6.05 Released\nNow You're talking!\n\nVoxATC is a huge advance in Flight Simulation that adds a whole new dimension to the experience. VoxATC is the first ATC add-on for FSX that has been developed with integrated voice recognition. Talk to the controllers using standard ATC phraseology and what you say will be heard. Just like in the real world, requests must be properly constructed, instructions complied with and read back correctly. Some FS add-ons let you talk to the computer, with VoxATC you talk to Air Traffic Control. Download and try VoxATC for yourself, free for 7 days.\n\nFeatures\nProperly Integrated Voice Recognition\n\nVoxATC is the only ATC add-on for FSX which was designed for voice recognition. When you press to talk and speak, the ATC environment is listening to what you say so you won't be interrupted as in other environments that attempt to fit voice recognition on top of the built in FSX ATC or other ATC add-ons. What you say is also checked so that incorrect read backs are picked up and corrected.\nA Complete ATC Environment\n\nVoxATC generates its own AI traffic and controllers. The phraseology and procedures more closely reflect those in the real world as VoxATC is not tied to the ATC or AI built into FSX.\nRealistic Phraseology\n\nCommunicate with ATC the way real pilots do.\nMore\nIFR\n\nVoxATC supports all aspects of Instrument Rules flight.\nMore\nVFR\n\nVoxATC supports all aspects of Visual Rules flight.\nVoices\n\nAny SAPI voice available on your system can be used as a controller or pilot voice. The volume and speed of each can be set individually. VoxATC can also use the open source VoxPop Voices. As many voices as the resources of the system can support may be used with VoxATC. \n\nCracked by axisr0x ...\n\nHave fun Guys. :+)","torrent":{"xt":"urn:btih:a284a1f4ab643dcc35c5acbf42013a657eaece5e","amp;dn":"FSX+VoxATC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a284a1f4ab643dcc35c5acbf42013a657eaece5e","infoHashBuffer":{"type":"Buffer","data":[162,132,161,244,171,100,61,204,53,197,172,191,66,1,58,101,126,174,206,94]},"announce":[],"urlList":[]}}