{"title":"Drowned God","uid":10519883,"size":1783320939,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a29a678c33e4ee466b787c52123cd33e8b2b6258&amp;dn=Drowned+God&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Psychodad149","files":61,"time":1404962508,"description":"UPDATE: this is a different torrent from the one previously uploaded.\nThe old one is no longer active.\n\nHi all, hope you enjoy this game.  I personally thought it was great fun first time through, when it was new.\n\nThat said.\n\nThere are a couple things I'd like to pass on.  As noted in the walkthrough/hints file, this game does have a tendency to be buggy.  Despite the walkthru, I can't get it to run correctly off of a virtual drive, I had to burn actual copies (or use the originals).  If you see:  &quot;File read error: Handle/Offset file&quot;, that's what it is; you will get that right at the start going through to the Henge, as well as other places where scenes shift like that.\n\nGo ahead and install the Patch #4 at once. However, run the install from outside the installation directory or you will lose the actual .exe file.  Right from this download file is probably best, just don't install to this same one, see the othe guide, please install to the default directory!\n\nAlso, it's best to invoke Windows 95 compatibiity and force 640 x 480 resolution.  Worst comes to worst, you can set up a Windows 95 or 98 MS Virtual Machine and run it inside that.  \n\nThe scanned game manual includes solutions to a couple of the first puzzles.\n\nThe Nine Man's Morris puzzle in the pyramid is ridiculously difficult.  I solved it honestly once, long ago. This time, I found this site:  \n &lt;a href=&quot;\nhttp://merrelles.com/English.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://merrelles.com/English.html&lt;/a&gt;\n\nYou can set up the web game to play either side first, ideally on a 2nd computer so you can have both screens viewable at once.  Set the Merrelles game to play computer first, and play those computer moves as your moves in DG and vice versa. Gameplay should be nearly mirror image, because sometimes there are only one or two possible moves that make sense.  You should be able to beat the DG game in one or two tries like this.","torrent":{"xt":"urn:btih:a29a678c33e4ee466b787c52123cd33e8b2b6258","amp;dn":"Drowned+God","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a29a678c33e4ee466b787c52123cd33e8b2b6258","infoHashBuffer":{"type":"Buffer","data":[162,154,103,140,51,228,238,70,107,120,124,82,18,60,211,62,139,43,98,88]},"announce":[],"urlList":[]}}