{"title":"The Anthony Cumia Show 2015-03-02 MP4 MP3 combo","uid":11730763,"size":336981188,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:a2bf66d9c008c7e8e82c76509ad14c8a07732cef&amp;dn=The+Anthony+Cumia+Show+2015-03-02+MP4+MP3+combo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mothergoose58","files":2,"time":1425396301,"description":"*** CAUTION: 100% UNCENSORED CONTENT!!! ***\n\n-NOT FOR VIEWING BY CHILDREN OR THE FAINT OF HEART-\n\nFresh off his &quot;separation&quot; from SiriusXM, Anthony Cumia, formerly of The Opie and Anthony Show launches his live, uncensored HD video webcast at AnthonyCumia.com Monday-Thursday 4pm-6pm EST. Current events, politics, news and anything can and will be discussed with celebrity guests and comedians stopping by as well. This show is not for those who are inclined to be &quot;politically correct&quot; and will contain boundary-pushing language and topics. Proceed with caution...\n\n\nEpisode 119: TACS week starts with some hot topics on social media this weekend such as &quot;the dress&quot;, the dumb llamas, Obama previously threatening to shoot down Israeli planes if they attack Iran, and Ronda Rousey being an absolute beast. We watch a video of a new LAPD shooting, check out a live high speed chase in a rental, learn the city of Cleveland isn't to blame for a 12-year-old being shot by police, and watch a news story about school spirit. Or maybe it was about taunting. Whatever. Ant then gets into the latest with Barry Williams, talks about William Shatner not attending Leonard Nimoy's funeral, plays a throwback video from Opie and Anthony, and KtC tells us about a high speed chase he once dealt with. We see the SNL sketch that has people divided, go back to the high speed chase and while we wait to see what happens next, Ant goes through Monday's mail. Anthony then talks about H1Z1, shows off the new TACS poker chips, discusses Tinder and your cell phone being a cock blocker if you let it, a caller puts Ant onto cruising Craigslist for hook-ups, we look at a dude covered in Mentos take a bath in Diet Coke, see a little kid get blown into a manhole, and watch a couple of shitty elevator videos. Wrapping up today's show, we see a non-story about a portrait of Bill Clinton, hear Israeli Prime Minister Netanyahu address Iran, find out Cindy Crawford threatened a lawsuit over her &quot;untouched&quot; photos, and hear about the upcoming guests for this week\n\n\nIncludes an MP4 video file and an MP3 audio file; download both or only what you need and please seed!\n\n\n\nNew ups at: http://thepiratebay.se/user/mothergoose58/\n\nSubscribe at AnthonyCumia.com!!!","torrent":{"xt":"urn:btih:a2bf66d9c008c7e8e82c76509ad14c8a07732cef","amp;dn":"The+Anthony+Cumia+Show+2015-03-02+MP4+MP3+combo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a2bf66d9c008c7e8e82c76509ad14c8a07732cef","infoHashBuffer":{"type":"Buffer","data":[162,191,102,217,192,8,199,232,232,44,118,80,154,209,76,138,7,115,44,239]},"announce":[],"urlList":[]}}