{"title":"Figurine discography","uid":4485961,"size":338481152,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a2c88e6afb8210d7107c06ad988bb7219add55f4&amp;dn=Figurine+discography&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"carmensandiego","files":65,"time":1225762073,"description":"All of &quot;Figurine&quot;&amp;#039;s albums and James Figurine&amp;#039;s solo album &quot;Mistake Mistake Mistake Mistake&quot;. This is a repost of a Demonoid torrent for you TPB folks. Description of the band from Wikipedia follows:\n\nFigurine is an electronica band based in the USA. The band members, friends since high school, are somewhat secretive about their identities, using the pseudonyms David Figurine, James Figurine (Jimmy Tamborello) and Meredith Figurine and not releasing any band photos.\n\nWhile the band seems to be inactive as of 2006, all three members are also involved in other bands or have released solo work under their respective Figurine monikers. Mainly a long distance collaboration, the band was a precursor to James Figurine/Tamborello&amp;#039;s later, more commercially successful project The Postal Service. Tamborello has also used the Figurine pseudonym for an official remix of Bright Eyes&amp;#039; Easy/Lucky/Free in 2005 and a solo album in 2006. Meredith is also a vocalist for Boothby.\n\nFigurine lyrics commonly tell whimsical love stories involving technology, such as space stations, instant messaging or internet cafes. Their song &quot;New Mate&quot; was featured on the soundtrack of the 2004 cult film Napoleon Dynamite.","torrent":{"xt":"urn:btih:a2c88e6afb8210d7107c06ad988bb7219add55f4","amp;dn":"Figurine+discography","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a2c88e6afb8210d7107c06ad988bb7219add55f4","infoHashBuffer":{"type":"Buffer","data":[162,200,142,106,251,130,16,215,16,124,6,173,152,139,183,33,154,221,85,244]},"announce":[],"urlList":[]}}