{"title":"The Pulse: A Novel of Surviving the Collapse of the Grid","uid":7940679,"size":544233,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a33e99ffe6af3030e736539826bea790f012c20c&amp;dn=The+Pulse%3A+A+Novel+of+Surviving+the+Collapse+of+the+Grid&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"DaRule762","files":-1,"time":1355969122,"description":"As massive solar flares bombard the Earth, an intense electromagnetic pulse instantly destroys the power grid throughout North America. Within hours, desperate citizens panic and anarchy descends. Surrounded by chaos, Casey Drager, a student at Tulane University, must save herself from the havoc in the streets of New Orleans. Casey and two of her friends evacuate the city and travel north, where they end up in the dangerous backwaters of Mississippi, forced to use their survival skills to seek refuge and fight for their lives.\n\nMeanwhile, thousands of miles away, Casey's father, Artie, finds himself cut off and stranded. His Caribbean sailing vacation has turned into every parent's nightmare. Warding off pirates and tackling storms, Artie uses the stars to guide him toward his daughter.\n\nThe Pulse is a compelling action-adventure novel that reveals what it would take to survive in a world lit only by firelight, where all the rules have changed and each person must fend for himself.","torrent":{"xt":"urn:btih:a33e99ffe6af3030e736539826bea790f012c20c","amp;dn":"The+Pulse%3A+A+Novel+of+Surviving+the+Collapse+of+the+Grid","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a33e99ffe6af3030e736539826bea790f012c20c","infoHashBuffer":{"type":"Buffer","data":[163,62,153,255,230,175,48,48,231,54,83,152,38,190,167,144,240,18,194,12]},"announce":[],"urlList":[]}}