{"title":"Orchestra Baobab Bamba","uid":5642318,"size":418249803,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a341fe56f7b7fa66f5d2250d0a697245bdd7f2dc&amp;dn=Orchestra+Baobab+Bamba&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"syliphone","files":17,"time":1277158671,"description":"The opening &quot;Mouhamadou Bamba&quot; is simply astounding -- the way the feathery introductory guitar trills by Barthelemy Attisso and the ragged-but-melt-in-your-ear harmonies supporting Thione Seck's heart-wrenching vocal lead that drop you into Charles N'Diaye's reggae lope bassline pushing up is simply glorious. And when those &quot;bamba, bamba&quot; backing vocals start dropping in behind Seck after 45 seconds, just forget it. &quot;Mouhamadou Bamba&quot; shifts mid-song into devoted testifying before a rocking guitar solo and fall-apart ending closes out six-and-a-half minutes of brilliant music. The rockin' side of Orchestra Baobab dominates Bamba, which combines the Senegalese group's Mouhamadou Bamba and Sibou Odia albums from 1980 and 1981. It's much louder and liver sounding -- the voices laced with echo, N'Diaye's bass and Papa Ba's rhythm guitar more prominent in the mix, and Attisso brought in his noise toys and gets rowdy. The band sounds confident and in their prime -- the riffs are more thoroughly worked out, mixing solo sax on &quot;Doomou Baye&quot; in with guitar and voices to change the emphasis, or playing the horn section riffs off the vocal harmonies. The trademark galloping rhythm guitar is fully evident on &quot;Boulmamine,&quot; while clarinet pops up on &quot;Ndiawolou&quot; as Attisso goes the crystalline solo route again with some Issa Cissokho tenor sax interjections. &quot;Gnawou&quot; and &quot;Autorail&quot; both work off a rhythm riff very close to the Ritchie Valens &quot;La Bamba&quot; -- Cissokho's sax shines on the former -- and the jaunty &quot;Sou Sedhiou&quot; features clopping drums underneath more good sax and guitar solos. &quot;Ndiambaane&quot; may be a little lightweight to justify its nine minutes, but not &quot;Sibou Odia,&quot; a great 14-minute stretch-out with the percussion percolating with far more drive than the Orchestra Baobab norm. It gives Attisso a chance to play with more guitar tone-altering toys -- he still sounds like he's discovering sounds for the first time, yet it's unfailingly musical -- and he rips off some great solos over Papa Ba's rocksteady gallop. It seems strange to say that a rhythm guitarist might be the real star of a 14-minute jam (and maybe the entire album), but his foundation simply never falters. And it's just as odd that most world music critics dismiss Bamba, but then they tend to like their African music with the root influences showing clearly and not overly rocking and rowdy. Bamba is simply a great album and the perfect place for rock-oriented listeners to enter the world of Orchestra Baobab...or the whole realm of West African pop music, for that matter.\n\nAll Music Guide ","torrent":{"xt":"urn:btih:a341fe56f7b7fa66f5d2250d0a697245bdd7f2dc","amp;dn":"Orchestra+Baobab+Bamba","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a341fe56f7b7fa66f5d2250d0a697245bdd7f2dc","infoHashBuffer":{"type":"Buffer","data":[163,65,254,86,247,183,250,102,245,210,37,13,10,105,114,69,189,215,242,220]},"announce":[],"urlList":[]}}