{"title":"A Dreadful Deceit (2013) Jacqueline Jones (multi)","uid":9421893,"size":11422309,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a3cdb5d0ebb67753d0cf1212a85b89fff297197d&amp;dn=A+Dreadful+Deceit+%282013%29+Jacqueline+Jones+%28multi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"7","files":-1,"time":1388605054,"description":"A Dreadful Deceit: The Myth of Race from the Colonial Era to Obama's America (2013) Jacqueline Jones (multi)\n\nA Dreadful Deceit: The Myth of Race from the Colonial Era to Obama's America by Jacqueline Jones\n\n\nFormat: mobi/epub/azw3\nLength: 402 pages\nGenre: History/United States\nDate: 10 December 2013\n\nExpansive, visionary, and provocative, A Dreadful Deceit explodes the pernicious fiction that has shaped American history.\n\nMacArthur Fellow and Bancroft Prize-winning historian Jones's aim in this heartfelt book is to redefine our ideas of what constitutes &quot;race&quot; while arguing that the entire foundation of racial categorizing is unscientific and deeply injurious historically.\n\nIn 1656, a planter in colonial Maryland tortured and killed one of his slaves, an Angolan man named Antonio who refused to work the fields. Over three centuries later, a Detroit labor organizer named Simon Owens watched as strikebreakers wielding bats and lead pipes beat his fellow autoworkers for protesting their inhumane working conditions.\n\nAntonio and Owens had nothing in common but the color of their skin and the economic injustices they battled - yet the former is what defines them in America's consciousness. In A Dreadful Deceit, award-winning historian Jacqueline Jones traces the lives of these two men and four other African Americans to reveal how the concept of race has obscured the factors that truly divide and unite us.\n\n&quot;Jones forcefully demonstrates how racial ideologies are used to uphold existing power relations and perpetuate injustice, denying some citizens their rightful place in civic life.&quot; -- Publishers Weekly, Best of 2013\n\nAuthor:\n\nJacqueline Jones is Walter Prescott Webb Chair in History and Ideas and Mastin Gentry White Professor of Southern History at the University of Texas at Austin, United States. She is an expert in American social history in addition to writing on economics, women, and class. In 1986, one of her most notable publications, Labor of Love, Labor of Sorrow: Black Women, Work, and the Family from Slavery to the Present, won her the Bancroft Prize. In Labor of Love Labor of Sorrow, Dr. Jones demonstrates her extensive knowledge of the history of the South from 1830-1915.\n","torrent":{"xt":"urn:btih:a3cdb5d0ebb67753d0cf1212a85b89fff297197d","amp;dn":"A+Dreadful+Deceit+%282013%29+Jacqueline+Jones+%28multi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a3cdb5d0ebb67753d0cf1212a85b89fff297197d","infoHashBuffer":{"type":"Buffer","data":[163,205,181,208,235,182,119,83,208,207,18,18,168,91,137,255,242,151,25,125]},"announce":[],"urlList":[]}}