{"title":"Hibernate In Action.pdf","uid":8631118,"size":3116004,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a583e083122a920ee1da9e0ba9c270bd84a83d52&amp;dn=Hibernate+In+Action.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"erahu","files":-1,"time":1372631953,"description":"Hibernate practically exploded on the Java scene. Why is this open-source tool so popular? Because it automates a tedious task: persisting your Java objects to a relational database. The inevitable mismatch between your object-oriented code and the relational database requires you to write code that maps one to the other. This code is often complex, tedious and costly to develop. Hibernate does the mapping for you.\nNot only that, Hibernate makes it easy. Positioned as a layer between your application and your database, Hibernate takes care of loading and saving of objects. Hibernate applications are cheaper, more portable, and more resilient to change. And they perform better than anything you are likely to develop yourself.\n&quot;Hibernate in Action&quot; carefully explains the concepts you need, then gets you going. It builds on a single example to show you how to use Hibernate in practice, how to deal with concurrency and transactions, how to efficiently retrieve objects and use caching.\nThe authors created Hibernate and they field questions from the Hibernate community every day-they know how to make Hibernate sing. Knowledge and insight seep out of every pore of this book.\n&quot;What's Inside&quot;\n- ORM concepts\n- Getting started\n- Many real-world tasks\n- The Hibernate application development process","torrent":{"xt":"urn:btih:a583e083122a920ee1da9e0ba9c270bd84a83d52","amp;dn":"Hibernate+In+Action.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a583e083122a920ee1da9e0ba9c270bd84a83d52","infoHashBuffer":{"type":"Buffer","data":[165,131,224,131,18,42,146,14,225,218,158,11,169,194,112,189,132,168,61,82]},"announce":[],"urlList":[]}}