{"title":"Film Noir Classic - Armored Car Robbery (1950) Xvid 1cd - Charle","uid":9495881,"size":734019584,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a59079fb4cd69dcfb0f8ee4a9e5f79ff4b8d285a&amp;dn=Film+Noir+Classic+-+Armored+Car+Robbery+%281950%29+Xvid+1cd+-+Charle&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SaM","files":-1,"time":1390106818,"description":"Film Noir Classic - Armored Car Robbery (1950) Xvid 1cd - Charles McGraw [DDR]\n\nArmored Car Robbery is a 1950 film noir directed by Richard Fleischer, and starring Charles McGraw. The movie was filmed on location in Los Angeles, California.\n\nArmored Car Robbery is a heist movie, a sub-genre of crime-based films. It tells the story of a well-planned robbery of cash from an armored car when it stops at a sports stadium. The heist goes awry and a tough Los Angeles cop sets off in hot pursuit of the culprits.\n\n    CAST:-\n    Charles McGraw as Lt. Jim Cordell\n    Adele Jergens as Yvonne LeDoux aka Mrs. Benny McBride\n    William Talman as Dave Purvis aka Martin Bell\n    Douglas Fowley as Benny McBride\n    Steve Brodie as Al Mapes\n    Don McGuire as Detective Danny Ryan\n    Don Haggerty as Detective Driving Final Pursuit Car\n    James Flavin as Lt. Phillips\n    Gene Evans as William 'Ace' Foster\n\nDirected by Richard Fleischer\nProduced by Herman Schlom\nScreenplay by Gerald Drayson Adams, Earl Felton\nStory by Robert Leeds, Robert Angus\nMusic by Roy Webb\nRunning time 67 minutes\n\nMOVIE REVIEW:- Armored Car Robbery (1950)\nMastermind Dave Purvis (William Talman) is a professional criminal who devises a scheme to rob an armored car on its last pickup of the day. He recruits Benny McBride, who brings Mapes &amp; Foster to complete the gang of thieves.\n\nBenny needs money because Yvonne (Adele Jergens), his striptease artist wife, has lost interest in him and is seeing another man. Unbeknownst to Benny, the man she is two-timing him with is Purvis.\n\nThe robbery itself, at Wrigley Field in Los Angeles, begins as planned but goes badly wrong when a passing police patrol car intervenes. Purvis kills one of the police officers from the patrol car and he and his fellow robbers make their getaway. Lt. Jim Cordell (Charles McGraw), the dead policeman's partner, takes it upon himself to bring in his partner's killer and throws himself into the case, assisted by a rookie officer.\n\nMeanwhile, Purvis's gang unravels bit by bit as distrust and paranoia begins to build. Benny, wounded by police during the heist, is killed by Purvis as he demands his share of the loot from the robbery and attempts to seek medical help. Foster is killed by the police as the three attempt escape. After Mapes (Steve Brodie) gets away, he looks up Yvonne at the Burly Q where she works, intending to use her as a means to find Purvis, who has kept all the loot for himself. The waiting police, however, arrest Mapes at the Burly Q and learn Purvis's identity.\n\nAfter a further manhunt, Lt. Cordell and his team corner Purvis and Yvonne at Los Angeles Metropolitan Airport, and Purvis is crushed by a taking-off plane as he tries to escape across the tarmac.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 855 kbps\nVideo Resolution: 640x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 23.976\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages:English\nRunTime 99 mins\nSubtitles: NONE\nRipped by: Trinidad [DDR]\nDuration: 99 mins","torrent":{"xt":"urn:btih:a59079fb4cd69dcfb0f8ee4a9e5f79ff4b8d285a","amp;dn":"Film+Noir+Classic+-+Armored+Car+Robbery+%281950%29+Xvid+1cd+-+Charle","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a59079fb4cd69dcfb0f8ee4a9e5f79ff4b8d285a","infoHashBuffer":{"type":"Buffer","data":[165,144,121,251,76,214,157,207,176,248,238,74,158,95,121,255,75,141,40,90]},"announce":[],"urlList":[]}}