{"title":"La Lengua Asesina AKA Killer Tongue","uid":4577862,"size":744335360,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a5930117ace022b382b480b783e4878100ac9579&amp;dn=La+Lengua+Asesina+AKA+Killer+Tongue&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"lord_terabyte","files":-1,"time":1229298005,"description":"Alberto Sciamma - La Lengua Asesina AKA Killer Tongue (1996)\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0116770/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0116770/&lt;/a&gt;\n\n[QUOTE]Well, mommy, it's just you're a girl who can't say no. That's all. [/QUOTE]\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/518D0B1VVGL.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/518D0B1VVGL.jpg&lt;/a&gt;\n\n[COLOR=red]I believe this is an almost completely overlooked gem of a cult film, and I am very happy to finally be able to upload it. (I had help getting it ready.) At first I thought it was complete garbage, but the more I worked on it the more enchanted I became.[/COLOR]\n\nPlot keywords:\n    * B Movie\n    * Tongue\n    * Alien\n    * Desert\n    * Drag Queen\n    * Meteor\n    * Nun\n    * Poodle\n    * Possession\n    * Prison\n    * Cult\n\n\n &lt;a href=&quot;\nhttp://i497.photobucket.com/albums/rr334/little_gigabyte/Clipboard03-3.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i497.photobucket.com/albums/rr334/little_gigabyte/Clipboard03-3.png&lt;/a&gt;\n\n[QUOTE]The incredible story begins in the New Mexico desert at the border of paranormal reality. An unlikely convergence of strange phenomenon spawns a creature with seductive feminine charms and gross mutations. With a parasitic alien inhabiting her monstrous body, Candy, the human host fights a losing battle with the beast until it's secret grip can be broken. This shocking movie breaks all the rules of filmmaking and will stay with you forever... unless you can't stay with IT![/QUOTE]\n &lt;a href=&quot;\nhttp://i497.photobucket.com/albums/rr334/little_gigabyte/Clipboard04-3.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i497.photobucket.com/albums/rr334/little_gigabyte/Clipboard04-3.png&lt;/a&gt;\n\n[QUOTE]Low budget movies are a dime a dozen, but once in a while we find\na gem. Found one in this movie, yes its a strange one, but\nthe director took a stange direction with this one and it works.\nMakes a low budget movie feel like a almost regular weird movie.\nJust a bit too much of one character (the warden) but the movie\nflows pretty good... hey, now that's quite a tongue on that lady.\nThe movie falls into the: Must be seen once Category.[/QUOTE]\n &lt;a href=&quot;\nhttp://i497.photobucket.com/albums/rr334/little_gigabyte/Clipboard05-2.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i497.photobucket.com/albums/rr334/little_gigabyte/Clipboard05-2.png&lt;/a&gt;\n\n[QUOTE]Looking at the video box, you might think this is going to be another spoof of those silly 1950's horror films involving radiation poisoned giant animals. You are so wrong.\n\nIn a nutshell, a meteor crashes to earth and a chunk is ingested by a former nun waiting for her boyfriend to be released from prison. Her tongue grows to about ten feet long, and eventually talks to her. Hijinks of the most offensive order ensue.\n\nThis is such an off the wall surreal nightmare that you must see it to believe it. So many scenes can only be mentioned by their generic names but watch out for the port-a-potty scene, the bathtub scene, the confessional scene, and the super glue scene.\n\nThis somehow escaped with an (R) rating. It has a lot of material that kids should not see, but this is also one of the funniest films out there. My one small complaint is that I could not get this in letterbox version, on the TV screen it really suffers. Robert Englund, as the prison director, gives a better performance here than in all the &quot;A Nightmare on Elm Street&quot; films combined. He shows that his acting genius does not have to include fright makeup, and he should be allowed to do more of these over the top horror comedies. The entire cast looks like they were having a lot of fun here, and it rubs off on the viewer in the right mood. Rent it now![/QUOTE]\n &lt;a href=&quot;\nhttp://i497.photobucket.com/albums/rr334/little_gigabyte/Clipboard07-1.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i497.photobucket.com/albums/rr334/little_gigabyte/Clipboard07-1.png&lt;/a&gt;\n\n[QUOTE]nothing anyone can say will prepare you for the bizarre-o fest that is &quot;Killer Tongue.&quot;[/QUOTE]\n &lt;a href=&quot;\nhttp://i497.photobucket.com/albums/rr334/little_gigabyte/Clipboard08-1.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i497.photobucket.com/albums/rr334/little_gigabyte/Clipboard08-1.png&lt;/a&gt;\n\n[SPOILER]If you would like to watch a very strange horror movie,this one is then a nice choice.When it comes to the plot,the movie is something like this : A couple ( Melinda Clarke &amp; her beau) and two other guys pull off a robbery.In the middle of the desert,on a dusty unpaved road,the mastermind of the crime (Melinda's boyfriend) decides to betray the two cohorts with the aid of his beloved.Bad for them.They got two deadly enemies,who later on will do everything to get even with the couple.The police discover who planned the robbery and arrest him.Melinda,then,not to be caught,hides in a convent for four years,which is the amount of time the love of her life stays in jail whose warden is fruity nutty but somehow funny and mean (Robert &quot;Freddy Krueger&quot; Englund).When Melinda is about to meet her boyfriend who is going to be released from prison in 4 days,a series of unbelievable incidents,accidents and events happen to them,as well as to the other characters.An outer space creature possesses Melinda's beautiful body,mind,face,hair(!) and tongue.Her four poodles also change and become her and the creature's bodyguards : THEY TURN INTO A HOMO,2 DRAG QUEENS and a TRANSVESTITE ! The effects are nice (produced by BOB &quot;HELLRAISER PTs.1,2,3 &amp; 4&quot; KEEN),the producer is Christopher Figg (HELLRAISER PTs 1,2,3 &amp; 4) and DOUG &quot;PINHEAD-HELLRAISER&quot; BRADLEY takes part in it.It's a very weird but original flick.I recommend you watch it if you a real horror movie lover.If not do not dare to watch it.You may not enjoy it or have the guts to get a kick out of it.[/SPOILER]\n &lt;a href=&quot;\nhttp://i497.photobucket.com/albums/rr334/little_gigabyte/Clipboard09.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i497.photobucket.com/albums/rr334/little_gigabyte/Clipboard09.png&lt;/a&gt;\n\n---Not my rip.----\n\nThere is a story behind this rip. The rip I found on a private tracker was simply bad. I found a nice looking rip in the correct aspect ratio on the mule, but dubbed in Spanish. I found another rip with the correct audio, but a different frame rate. I gave up on trying to fix the audio and the files sat on my hard drive for well over 6 months. Eventually I found out that Quigley has expertise in fixing audio so I sent what I had to him and he worked magic. Until, or if, there is a proper DVD release of this in English, this film is not available anywhere else in good quality. So I hope a lot of people will be able to enjoy what should become a cult classic. \n\n~~~~~~ La Lengua asesina.avi ~~~~~~                                     \n                                                               \nFile Size (in bytes):...........................744,335,360                     \n                                                                                \n--- Video Information ---                                                       \nVideo Codec Name:...............................XviD 1.1.0 Final              \nDuration (hh:mm:ss):............................1:34:39                \nFrame Count:....................................141952             \nFrame Width (pixels):...........................688                  \nFrame Height (pixels):..........................304                  \nAspect Ratio:...................................2.263                     \nFrames Per Second:..............................25.000          \nVideo Bitrate (kbps):...........................908                 \n......MPEG-4......B-VOP........................                    \nQuality Factor (bits/pixel)/frame:..............0.174&quot;                     \n                                                                                \n--- Audio Information ---                                                       \nAudio Codec:....................................0x0055 MPEG-1 Layer 3                   \nAudio Sample Rate (Hz):.........................44100             \nAudio Bitrate(kbps):............................128                 \nAudio Bitrate Type (&quot;CBR&quot; or &quot;VBR&quot;):............CBR            \nAudio Channel Count:............................2           \n\n\n[COLOR=red]It would not have been possible to present this film to the file sharing world without the help of Quigley, who corrected the audio![/COLOR]\n\nI found it necessary to change the audio device when playing in VLC to mono for better sound.\n\nVideo source is probably a Spanish DVD, audio the US release.\n\n*********************************** FREAKYFLICKS ************************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n\n\n'If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE'","torrent":{"xt":"urn:btih:a5930117ace022b382b480b783e4878100ac9579","amp;dn":"La+Lengua+Asesina+AKA+Killer+Tongue","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a5930117ace022b382b480b783e4878100ac9579","infoHashBuffer":{"type":"Buffer","data":[165,147,1,23,172,224,34,179,130,180,128,183,131,228,135,129,0,172,149,121]},"announce":[],"urlList":[]}}