{"title":"Adsorption and Collective Paramagnetism","uid":14428749,"size":3982080,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a6287237d3beb916d75219a33dd5d14b651bf20b&amp;dn=Adsorption+and+Collective+Paramagnetism&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1461591605,"description":"Adsorption and Collective Paramagnetism - Pierce W. Selwood (AP, 1962).pdf\r\n\r\nAdsorption and Collective Paramagnetism describes a novel method for studying chemisorption. The method is based on the change in the number of unpaired electrons in the adsorbent as chemisorption occurs. The method is applicable to almost all adsorbates, but it is restricted to ferromagnetic adsorbents such as nickel, which may be obtained in the form of very small particles, that is to say, to ferromagnetic adsorbents with a high specific surface. While almost all the data used illustratively have been published elsewhere this is the first complete review of the subject.\r\nThe book is addressed primarily to readers interested in heterogeneous catalysis and related areas of surface chemistry, surface physics, and physical metallurgy. For that reason there are included a number of definitions, and an elementary introduction to magnetism. But it is hoped that specialists in magnetism and solid state physics may also find here something of value. For that reason there is included an introduction to adsorption phenomena. If one group finds the detailed magnetic descriptions and calculations to be tedious it is to be hoped that the adsorption work will be found comprehensible, and vice versa","torrent":{"xt":"urn:btih:a6287237d3beb916d75219a33dd5d14b651bf20b","amp;dn":"Adsorption+and+Collective+Paramagnetism","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a6287237d3beb916d75219a33dd5d14b651bf20b","infoHashBuffer":{"type":"Buffer","data":[166,40,114,55,211,190,185,22,215,82,25,163,61,213,209,75,101,27,242,11]},"announce":[],"urlList":[]}}