{"title":"Tripping.The.Rift.S02.DVDRip.XviD-SAiNTS","uid":9767497,"size":2381606912,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a6c4ae41e96453cad13146168c75ce4b45ddcd50&amp;dn=Tripping.The.Rift.S02.DVDRip.XviD-SAiNTS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"druyid","files":13,"time":1394903122,"description":"Tripping the Rift is a CGI science fiction comedy television series.\n\nThe universe is modeled largely after the Star Trek universe, with references to 'warp drive' and 'transporter' beam technology, occasional time travel, the Federation and the Vulcans. The series also includes elements borrowed from other sources such as Star Wars, 2001: A Space Odyssey and Battlestar Galactica.\nThe general setting is that known space is politically divided between two superpowers: the Confederation (led by Humans, and a parody of the Federation from Star Trek) and the Dark Clown Empire (a parody of the Galactic Empire from Star Wars). The Dark Clown Empire is a totalitarian, tyrannical police state, led by the evil Darph Bobo. In contrast, the Confederation is technically a democratic and free society, but in practice, is dominated by mega-corporations and bloated bureaucracies. Ultimately, both superpowers end up exploiting and restricting their inhabitants, albeit in different ways. For example, the value placed on life is so commercialized in the Confederation that clearly sentient robots and androids are reduced to essentially slave-status. The Dark Clown Empire practices actual slavery, and while the Confederation does not, most of its inhabitants (including the Human ones) are openly described as living in wage slavery. The only place that anyone can truly be free is in the border region between the two superpowers, which is directly controlled by neither. This borderland is known as &quot;the Rift&quot;, hence those outlaws on the fringes of society who cling to their freedom by moving back and forth around the Confederation/Dark Clown Empire border to evade detection are said to be &quot;Tripping the Rift&quot;. The series follows one such group of outlaws led by Chode aboard the Spaceship Bob, taking odd-jobs and usually pursuing various get-rich-quick schemes.\n\nSeason 2\n1. &quot;Cool Whip&quot;\n2. &quot;You Wanna Put That Where?&quot;\n3. &quot;Honey, I Shrunk the Crew&quot;\n4. &quot;Ghost Ship&quot;\n5. &quot;Benito's Revenge&quot;\n6. &quot;All for None&quot;\n7. &quot;Extreme Chode&quot;\n8. &quot;Roswell&quot;\n9. &quot;Santa Clownza&quot;\n10. &quot;Chode and Bobo's High School Reunion&quot;\n11. &quot;Creaturepalooza&quot;\n12. &quot;Chode's Near-Death Experience&quot;\n13. &quot;Six, Lies and Videotape&quot;\n\nProperties:\n25fps\nXviD.MP3","torrent":{"xt":"urn:btih:a6c4ae41e96453cad13146168c75ce4b45ddcd50","amp;dn":"Tripping.The.Rift.S02.DVDRip.XviD-SAiNTS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a6c4ae41e96453cad13146168c75ce4b45ddcd50","infoHashBuffer":{"type":"Buffer","data":[166,196,174,65,233,100,83,202,209,49,70,22,140,117,206,75,69,221,205,80]},"announce":[],"urlList":[]}}