{"title":"Before I Wake by Robert J Wiersema (retail EPUB)","uid":10844748,"size":3363764,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a82e6e2f3f9a863050aede5784841e8b0541caee&amp;dn=Before+I+Wake+by+Robert+J+Wiersema+%28retail+EPUB%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gratefuldawg77","files":6,"time":1408764243,"description":"After an unthinkable tragedy happens, an unbelievable miracle begins. . . \n\nThree-year-old Sherry is the adored only child of Simon and Karen Barrett. When Sherry is critically injured in a hit-and-run accident, the fault lines in the Barretts's marriage begin to show. As her parents' marriage falls apart, it is discovered that Sherry--in her coma-like state--has miraculous healing powers. \n   \nMeanwhile, the guilt-stricken driver of the truck attempts suicide--but is unable to die. Henry Denton instead finds himself in a place of darkness, somewhere between this world and the next, invisible to all but a group of mysterious and downtrodden men. Haunted by his shame, Henry struggles to understand this mysterious limbo, and what he must do to free himself. \n    \nAs word of Sherry's powers spread, her parents must decide how best to shelter their daughter and help the many sick and dying who are drawn to her side. At the same time, a larger battle is brewing--one that has been raging for close to two-thousand years, and one that might yet claim the lives of Sherry and her family.","torrent":{"xt":"urn:btih:a82e6e2f3f9a863050aede5784841e8b0541caee","amp;dn":"Before+I+Wake+by+Robert+J+Wiersema+%28retail+EPUB%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a82e6e2f3f9a863050aede5784841e8b0541caee","infoHashBuffer":{"type":"Buffer","data":[168,46,110,47,63,154,134,48,80,174,222,87,132,132,30,139,5,65,202,238]},"announce":[],"urlList":[]}}