{"title":"Warrior of Rome books 4-6","uid":9389641,"size":2301690874,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a9daba1c3c14c3152bf58d7c89da4fcc75f3b74d&amp;dn=Warrior+of+Rome+books+4-6&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mustafa-crap","files":37,"time":1387861377,"description":"Not my rips.\n\nBook 4 The Caspian Gates\nAD 262 --the Roman Imperium is in turmoil after the struggle for the throne that brought Gallienus to power. And Ephesus, the metropolis of the Eastern Empire, lies in ruins, shattered by a mighty earthquake. Its citizens live in fear as the mob overwhelms the city, baying for blood to avenge the gods who have punished them. Yet an even greater threat to the Empire advances from the North: the barbaric Goth tribes, determined to pillage the city. Only Ballista, Warrior of Rome, knows the ways of the barbarians, and only he can defeat them. In a relentlessly gripping and richly authentic tale of ancient warfare, The Caspian Gates is an adventure for Rome enthusiasts and scholars alike.\n\nBook 5 The Wolves of the North\nn AD 263, the Roman Empire faces violentuprisings that threaten to shatter the fragile balance of power. In the north,the tribes are increasingly bold in their raids on the Imperium. Ballista mustundertake his most treacherous journey yet, facing the Herulithe Eaters of Flesh,the Wolves of the Norththe most brutal tribe of all, and try to turn themagainst one another. As Ballista and his retinue make their journey, someone or something is hunting them, picking them off one byone, leaving a trail of mutilated corpses and terror. Ballista is in a strangeland among strange people, but is it possible that the greatest threat may comefrom within his own circle?\n\nBook 6 The Amber Road\nIn the sixth novel in Harry Sidebottom s bestselling Warrior of Rome historical fiction series, Ballista returns to undertake yet another epic mission while the Roman Empire reels in chaos around him.\n\nIn AD 264, the Roman Empire has been torn in two. The western provinces Gaul, Spain, and Britain have been seized by Postumus, the pretender to the throne. To the east, on the plains of northern Italy, the armies of the emperor Gallienus muster, and he is keen to take his rightful place of power. A war between two emperors is coming, and everyone must choose a side.\n\nOn a mission shrouded in secrecy and suspicion, Ballista is sent by Gallienus back to his home of Hyperborea, the place of the people of his birth, to raise an army against Postumus. This means Ballista must journey along the Amber Road to the far north. Along the way Ballista meets a fearsome, masked warlord who attacks, bringing fire and sword against Ballista and his men. And in his home of Hyperborea, not all welcome Ballista s return. In the battle between Postumus and Gallienus, only one can survive and be emperor.\n\nRenowned for their skilled blending of action and historical accuracy, Sidebottom s Warrior of Rome novels take the reader from the shouts of the battlefield to the whisperings of the emperor s inner circle. Rich in detail and punctuated by harrowing action, these books will transport you back to the days of the Roman Empire","torrent":{"xt":"urn:btih:a9daba1c3c14c3152bf58d7c89da4fcc75f3b74d","amp;dn":"Warrior+of+Rome+books+4-6","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9daba1c3c14c3152bf58d7c89da4fcc75f3b74d","infoHashBuffer":{"type":"Buffer","data":[169,218,186,28,60,20,195,21,43,245,141,124,137,218,79,204,117,243,183,77]},"announce":[],"urlList":[]}}