{"title":"DeathSpank.Thongs.of.Virtue-SKIDROW","uid":5999947,"size":1411930157,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:aa9a66af0f62782f298b7d9bd618909938bdffe3&amp;dn=DeathSpank.Thongs.of.Virtue-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"aoloffline","files":31,"time":1291155940,"description":"S  K  i  D  R  O  W\n\n-  T H E  L E A D i N G  F O R C E  -\n\nproudly presents\nDeathspank: Thongs of Virtue / EA\n\nRELEASE DATE : 30-11-2010              PROTECTION : Steam  CEG\nGAME TYPE    : Action                  DISKS      : 1 DVD\n\nRelease Notes:\n\nThe Skid Rowdies are looking new blood to fill up the ranks.\nWe're a professional team of dedicated sceners with big mark\nunder sceners. We believe on the ground idealism of the root\nof the real old school scene. We do all this for fun and\nnothing else. We don't earn anything on our hobby, as we do\nthis for the competition and the heart of what got the scene\nstarted in the mid eighties.\n\nIf you think you got something to offer, then don't hold back\non contacting us as soon as possible.\n\n/\n/ / //          / / /  /\n/ / / / //      //// / / / / / /\n/      /      / / / // / /// /\n/// / //////\ntwice the fun  / double the trouble\n\nOn with the game release information:\n\nJoin DeathSpank in the hunt for the Thongs of Virtue Fight\nthrough war-torn battlefields, tame the High Plains and sail\nthe savage seas. Experience fast paced action-RPG combat with\nover 150 quests and tons of weapons, armor and loot to\ncollect.\n\nHilarious NEW Story of EPIC Proportions: Guide DeathSpank on\nan all new voyage spanning massive war-torn battlefields,\nsavage seas, and more as he hunts down magical thongs in an\neffort to combine their powers and create peace and harmony in\nthe universe.\n\nAll NEW Loot to Collect: Vanquish evil using an all new array\nof weapons, armor, and loot spanning different eras of\nhistory.\n\nSidekick Co-Op Mode is BACK, and it Brought A Friend: Grab a\nfriend and choose one of two hilarious sidekicks to help save\nthe world in co-operative couch play. Use your magical skills\nas Sparkles the wizard or your kung-fu moves as the new\nninjatastic Steve.\n\nTons of Hilarious NEW Quests and Characters: Battle your way\nthrough over 150 new quests and puzzles and meet a brand new\ncast of hilarious characters in the funniest game ever\ninvolving...thongs.\n\nInstall Notes:\n\n1. Unpack release\n2. Mount image or burn it\n3. Install\n4. Copy the cracked content from the SKIDROW folder on the DVD\nto the main installation folder and overwrite\n5. Play the game","torrent":{"xt":"urn:btih:aa9a66af0f62782f298b7d9bd618909938bdffe3","amp;dn":"DeathSpank.Thongs.of.Virtue-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa9a66af0f62782f298b7d9bd618909938bdffe3","infoHashBuffer":{"type":"Buffer","data":[170,154,102,175,15,98,120,47,41,139,125,155,214,24,144,153,56,189,255,227]},"announce":[],"urlList":[]}}