{"title":"Infrared and Raman Spectroscopic Imaging 2nd ed","uid":14762829,"size":24226154,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aa9cf8cbf6ee1fc457de454ce5a04849a3cdba35&amp;dn=Infrared+and+Raman+Spectroscopic+Imaging+2nd+ed&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1464859147,"description":"Infrared and Raman Spectroscopic Imaging 2nd ed - Reiner Salzer and Heinz W. Siesler (Wiley-VCH, 2014).pdf\r\n\r\nISBN 978-3-527-33652-4\r\n\r\nThis second edition of the successful ready reference is updated and revised with approximately 30% new content to reflect the numerous instrumental developments and improvements, as well as the significant expansion of this rapidly developing field. For example, the combination of IR imaging with AFM has enhanced the achievable lateral resolution by an order of magnitude down to a few hundred nanometers, thus launching a multiplicity of new applications in material science. Furthermore, Raman and IR spectroscopic imaging have become key technologies for the life sciences and today contribute tremendously to a better and more detailed understanding of numerous biological and medical research topics. \r\nThe topical structure of this new edition is now subdivided into four parts. The first treats the fundamentals of the instrumentation for infrared and Raman imaging and mapping and an overview on the chemometric tools for image analysis. The second part describes a wide varie-ty of applications ranging from biomedical via food, agriculture and plants to polymers and pharmaceuticals. This is followed by a description of imaging techniques operating beyond the diffraction limit, while the final part covers special methodical developments and their utility in specific fields.\r\nWith its many valuable practical tips, this is a must-have overview for researchers in academic and industrial laboratories wishing to obtain reliable results with this method","torrent":{"xt":"urn:btih:aa9cf8cbf6ee1fc457de454ce5a04849a3cdba35","amp;dn":"Infrared+and+Raman+Spectroscopic+Imaging+2nd+ed","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa9cf8cbf6ee1fc457de454ce5a04849a3cdba35","infoHashBuffer":{"type":"Buffer","data":[170,156,248,203,246,238,31,196,87,222,69,76,229,160,72,73,163,205,186,53]},"announce":[],"urlList":[]}}