{"title":"Lenovo IdeaPad S10 / S10e Netbook Windows XP Home Recovery Image","uid":4811336,"size":3826209743,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:abb1667c27c395a663783c986661177d7c79d070&amp;dn=Lenovo+IdeaPad+S10+%2F+S10e+Netbook+Windows+XP+Home+Recovery+Image&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"untrueparadox","files":2,"time":1238387240,"description":"This is a backup image of the original and unmodified Windows XP Home that comes preinstalled. It is in factory condition and you will be guided through SysPrep and User Setup. All OEM software, drivers, and bloatware will also be included in this Norton Ghost image. Splashtop / QuickStart is also included but you will need a S10e and enable it in the bios to use it. I made this because there have been requests and complaints about how Lenovo does not include recovery disks. For many of the curious and adventurous people that didn't backup their drive prior to installing Linux, OS X, Windows Vista, Windows 7, etc, here is the original Windows most of you paid for. It will also work on the Linux versions of the S10e by erasing everything. The image is created for a 80GB drive but should be able to adapt to 160GB with Ghost.\n\nInstructions:\n\n1. Extract Norton Ghost 11 with WinRAR or 7zip.\n2. Burn the .iso image onto a CD with Nero or Alcohol 120%.\n3. Open the self-extracting Ghost backup and extract to your USB hard drive or thumb drive.\n4. Connect your USB DVD/CD drive to the S10 and turn it on.\n5. Press FN + F11 for the F12 boot menu and select your CD/DVD drive.\n6. Plug in your USB hard drive or thumb drive while the system is booting from the CD.\n7. In the menu, select &quot;Local&quot; -&gt; &quot;Disk&quot; -&gt; &quot;From Image&quot;\n8. Browse to your file you extracted earlier and put on the USB drive.\n9. Click &quot;Open&quot; and follow the rest of the onscreen instructions.\n\nThe whole process should take about 1 hour. Please seed when you're done. It will help the others that come after you.\n\nThis torrent is guaranteed to be virus free. It came from a stock S10e that I bought from Lenovo which should not contain any malware. The executable archive has been scanned with both McAfee Antivirus 2009 and Norton AntiVirus 2009.","torrent":{"xt":"urn:btih:abb1667c27c395a663783c986661177d7c79d070","amp;dn":"Lenovo+IdeaPad+S10+%2F+S10e+Netbook+Windows+XP+Home+Recovery+Image","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"abb1667c27c395a663783c986661177d7c79d070","infoHashBuffer":{"type":"Buffer","data":[171,177,102,124,39,195,149,166,99,120,60,152,102,97,23,125,124,121,208,112]},"announce":[],"urlList":[]}}