{"title":"World War II Data Book: Hitler's Secret Weapons 1933-1945","uid":5739596,"size":58751694,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:abbe0ec4a9d4189dee0a00feaae25b3251f880b6&amp;dn=World+War+II+Data+Book%3A+Hitler%5C%27s+Secret+Weapons+1933-1945&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Djofullinn","files":1,"time":1280952736,"description":"World War II Data Book: Hitler's Secret Weapons 1933-1945\nAmber Books Ltd | 2010 | ISBN: 190662674X | English | 196 Pages | PDF | 50,5 MB\n\nThe German Third Reich had the most technologically advanced and innovative weapons industries in World War II, with aircraft, tanks and bombs that could match and beat anything else in the World. What is less known is the extent of Germany's secret weapons development. Germany pioneered rocket and jet-propelled aircraft, the pilotless plane, long-range rocket technology and 'robot bombs', and the world's first super-heavy tanks. Many of these weapons had a real impact on the course of the war. Following the invasion of the Soviet Union and the realization that the war could continue for years, Hitler put great resources into the development of new and technologically advanced weaponry, in the belief that the production of 'wonder weapons' were the key to winning the war.\n\n'World War II Data Book: Germany's Secret Weapons, 1939-45' gets behind this little-know aspect of the Nazi war machine to reveal the real extent of German secret weapons' development. Broken down by weapon types, the book includes exhaustive reference tables, diagrams, colorful maps and charts, presenting all the core data in easy-to-follow formats. 'World War II Data Book: Germany's Secret Weapons, 1939-45' is an essential reference guide for anyone interested in the history and make-up of Germany's secret weapons industry. amazon.com","torrent":{"xt":"urn:btih:abbe0ec4a9d4189dee0a00feaae25b3251f880b6","amp;dn":"World+War+II+Data+Book%3A+Hitler%5C%27s+Secret+Weapons+1933-1945","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"abbe0ec4a9d4189dee0a00feaae25b3251f880b6","infoHashBuffer":{"type":"Buffer","data":[171,190,14,196,169,212,24,157,238,10,0,254,170,226,91,50,81,248,128,182]},"announce":[],"urlList":[]}}