{"title":"EXPLOITED COLLEGE GIRLS - Mindy - Pastors Daughter Creampied SD","uid":8769102,"size":489290673,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:ac7945704088e56a5cb32c7dc4e0c13f13743c26&amp;dn=EXPLOITED+COLLEGE+GIRLS+-+Mindy+-+Pastors+Daughter+Creampied+SD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"beta2008x","files":1,"time":1375405766,"description":" &lt;a href=&quot;http://imgboxxx.com/viewer.php?file=157d5_ecg_mindy_s.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://imgboxxx.com/viewer.php?file=157d5_ecg_mindy_s.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgboxxx.com/viewer.php?file=p1y7y_mnd.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgboxxx.com/viewer.php?file=p1y7y_mnd.jpg&lt;/a&gt;\n\nOur interview starts off great when Mindy reveals that in addition to being a pastor's daughter she might be a legitimate nymphomaniac! A sex fiend with a grudge, perfect. While she's pretty average, girl next door in the looks department; she's got a fun, silly personality and a really sexy kind of enthusiasm that is a huge turn on. She's yet another ASU girl, but unlike the party girl porn wannabes I normally find in Tempe, she's slightly goofy and a real first timer who just loves to fuck and isn't shy about doing it on camera. And by &quot;it&quot; I mean getting her brains fucked out and pussy pounded into a gooey creampie.\n\nIf you are a fan of tiny titties and puffy nips, Mindy will be right up your alley. When she pulls off her shirt and reveals two freshly pierced nipples I'm pleasantly surprised. You don't normally see girls with tiny titties getting pierced, but hell people put 20's on Honda Civics, right? When she finally strips she reveals a very fine bod highlighted with some nice tan lines. I have her lay back and I start in with fingers and toys to try to get her revved up. Even though she claims to only masturbate with a shower head, she warms right up to the vibrator. After a nice solid orgasm, I tell her to drop to her knees. She's already confessed to having an oral fixation and I'm anxious to see just how fixated she is.\n\nHer oral skills are simply amazing. She absolutely loves sucking dick and does it with enthusiasm. I can't seem to push past her gag reflex, but she still takes to a nice face fucking and it's just crazy hot. I have her get my dick nice and wet and then get her back up on the bed for the main event. She really takes to getting fucked, as I pound her she fingers her clit and gets herself off at least 2-3 times.\n\nAfter watching her fine ass bounce on my cock, I'm ready to blow. I have her get face down so I can get a perfect shot of the creampie and I fuck her like I'm trying to break the bed. I know I end up doing the &quot;pin down&quot; position every week, and I plan to try more positions int he future but the girls love it and Mindy specifically requests it, though she calls it 'face down ass up.' She really gets into it, fingering herself and begging me to pull her hair and fuck her harder. She cums one last time and then I do. Her pussy is totally wet and overflowing with jizz - this might be my best creampie ever.","torrent":{"xt":"urn:btih:ac7945704088e56a5cb32c7dc4e0c13f13743c26","amp;dn":"EXPLOITED+COLLEGE+GIRLS+-+Mindy+-+Pastors+Daughter+Creampied+SD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac7945704088e56a5cb32c7dc4e0c13f13743c26","infoHashBuffer":{"type":"Buffer","data":[172,121,69,112,64,136,229,106,92,179,44,125,196,224,193,63,19,116,60,38]},"announce":[],"urlList":[]}}