{"title":"Michael Jackson - Thriller [Ogg Vorbis -q6]","uid":3357001,"size":62076654,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ac8959f9b6e67db9abd5bc5e108ca021b5b55941&amp;dn=Michael+Jackson+-+Thriller+%5BOgg+Vorbis+-q6%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Cuthbert","files":10,"time":1121526360,"description":"Ripped with EAC and oggdropXPd V1.8.3 using -q6\n\nThis is a very nice rip of Michael Jackson's bestselling album Thriller (1982).\n\n01. Wanna Be Startin' Somethin'\n02. Baby Be Mine\n03. The Girl Is Mine\n04. Thriller\n05. Beat It\n06. Billie Jean\n07. Human Nature\n08. P.Y.T. (Pretty Young Thing)\n09. The Lady In My Life\n\n\nReview by Stephen Thomas Erlewine (www.allmusic.com):\n\nOff the Wall was a massive success, spawning four Top Ten hits (two of them number ones), but nothing could have prepared Michael Jackson for Thriller. Nobody could have prepared anybody for the success of Thriller, since the magnitude of its success was simply unimaginable -- an album that sold 40 million copies in its initial chart run, with seven of its nine tracks reaching the Top Ten (for the record, the terrific &quot;Baby Be Mine&quot; and the pretty good ballad &quot;The Lady in My Life&quot; are not like the others). This was a record that had something for everybody, building on the basic blueprint of Off the Wall by adding harder funk, hard rock, softer ballads, and smoother soul -- expanding the approach to have something for every audience. That alone would have given the album a good shot at a huge audience, but it also arrived precisely when MTV was reaching its ascendancy, and Jackson helped the network by being not just its first superstar, but first black star as much as the network helped him. This all would have made it a success (and its success, in turn, served as a new standard for success), but it stayed on the charts, turning out singles, for nearly two years because it was really, really good. True, it wasn't as tight as Off the Wall -- and the ridiculous, late-night house-of-horrors title track is the prime culprit, arriving in the middle of the record and sucking out its momentum -- but those one or two cuts don't detract from a phenomenal set of music. It's calculated, to be sure, but the chutzpah of those calculations (before this, nobody would even have thought to bring in metal virtuoso Eddie Van Halen to play on a disco cut) is outdone by their success. This is where a song as gentle and lovely as &quot;Human Nature&quot; coexists comfortably with the tough, scared &quot;Beat It,&quot; the sweet schmaltz of the Paul McCartney duet &quot;The Girl Is Mine,&quot; and the frizzy funk of &quot;P.Y.T. (Pretty Young Thing).&quot; And, although this is an undeniably fun record, the paranoia is already creeping in, manifesting itself in the record's two best songs: &quot;Billie Jean,&quot; where a woman claims Michael is the father of her child, and the delirious &quot;Wanna Be Startin' Something,&quot; the freshest funk on the album, but the most claustrophobic, scariest track Jackson ever recorded. These give the record its anchor and are part of the reason why the record is more than just a phenomenon. The other reason, of course, is that much of this is just simply great music.","torrent":{"xt":"urn:btih:ac8959f9b6e67db9abd5bc5e108ca021b5b55941","amp;dn":"Michael+Jackson+-+Thriller+%5BOgg+Vorbis+-q6%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac8959f9b6e67db9abd5bc5e108ca021b5b55941","infoHashBuffer":{"type":"Buffer","data":[172,137,89,249,182,230,125,185,171,213,188,94,16,140,160,33,181,181,89,65]},"announce":[],"urlList":[]}}