{"title":"KISS Ultimate Lossless Audio Collection Additions Part 1 - Mick","uid":10137415,"size":7983523609,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:acb65474c05e7c7dc8544ff248b306087f50f9b8&amp;dn=KISS+Ultimate+Lossless+Audio+Collection+Additions+Part+1+-+Mick+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Flyfisher61","files":380,"time":1399959307,"description":"First run of additions to this project. Many more to come.\n\nThe Goal?\n\nTo fit all KISS audio onto one (or 2) 32gb usb stick(s) in LOSSLESS wave format (16/44100).\n\nTo find the best possible quality sources for material.\n\nTo present the material as close as possible to it's original, natural intent.\n\nTo make sure all songs are uniform in volume, left to right stereo panning perfectly even, and all tracks speed and pitch corrected.\n\nThe Ultimate Goal? THE definitve KISS audio collection.\n\nSpecial Thanks: Friedalive and Vinylhound for their amazing vinyl rips, and what I consider THE BEST and ONLY way to listen to music!\n\nA very special thanks: ALL my friends, traders and collectors and for those who helped me along the way.\n\nI've gone through every track over and over and over again. Adjusting pitch, speed, volume, panning, to\nmake this as close to the perfect and definitve KISS audio collection. For that rare person who thinks, &quot;Big deal! All you did\nwas download vinyl off the net!&quot;. WRONG! I went over every track numerous times, to assure every aspect was as perfect as possible. Most may not realize how much of a variance\nthere is from KISS album to KISS album. Most don't realize, that even on the same album, there are very noticeable fluctuations. This was not a quick, nor easy project. This wasn't about simply using waves and meters and making sure peaks were visually equal. This was about using my ear and trying to match every track sonically and in volume. Please, appreciate the effort.\n\nThe idea for this project came about 3 years ago when I was fed up with brickwalled cd's and scratched, skipping cdr's in my car, and the constant changing of discs. Now that usb ports are possible in almost every thing we use elctronically, including our vehicles, the project was a no brainer for me. With that said, I know it is not perfect. But, please enjoy.\n\nnote: bonus live tracks from YWTBYGTB are also Friedalive vinyl rips.\n\nnote: NONE of the vinyl rips have been compressed or brickwalled. They are as natural as can be All non-vinyl audio was brought down in volume\nto match the vinyls natural sound.\n\nnote: &quot;tweaked&quot; means I did some eq'ing or altering of the track.\n\nnote: You will notice the odd, minor track from the official boxset not included.\n\nnote: I've included all cover scans so generously provided by Vinylhound. Amazing and HUGE scans!\n\n\n** most recent Friedalive vinyl rip.\n\n## most recent Vinylhound rip.\n\n^^ KISS Remastered cd\n\n\n\n\n3B.Hotter Than Hell** - Mick E. Gee &quot;tweaked&quot; version - some tracks pitch corrected 10 tracks\n\n7B.Rock And Roll Over** - Mick E. Gee &quot;tweaked&quot; version - some tracks pitch corrected 10 tracks\n\n9. Alive 2** - Mick E. Gee version with new track order - 15 tracks\n\n9B.Rock And Roll Party In Tokyo - Mick E. Gee &quot;tweaked&quot; version of the lost Alive 2 album from Tokyo 1977. Includes side 4 demos - 16 tracks\n\n16B.Creatures Of The Night - 1985 remix - 9 tracks\n\n33.Destroyer Resurrection - 24/96 audio rip. NEW! Stereo matrix of both versions of Sweet Pain - 1 track\n\n35.The Casablanca singles 1974-1982 - cd rips. Some tracks pitch corrected - 58 tracks\n\n\nI enjoyed listening to volume 1 of this project very much. What made it most enjoyable for me, was having uniform volume throughout, with the ability to flip from track to track in any random order. \nSo I figured, why not start adding the most popular, and/or best sounding KISS bootlegs? \nIt's not the easiest task balancing random bootlegs, spanning a 40 year career, with their studio album counterparts.\n\nI &quot;tweaked&quot; them ALL to MY LIKING. Stereo balanced and leveled them to flow as well as I could. It's not perfect, nor can it ever be:)\n\n\n\n-1973 Rehearsals - 8 tracks\n-1973 Daisy - 11 tracks\n-1974 Detroit - 9 tracks\n-1974 Lafayette - 9 tracks\n-1974 East Lansing - 11 tracks\n-1974 Long Beach - 7 tracks\n-1975 Cleveland - 6 tracks\n-1975 Tulsa - 11 tracks\n-1975 Providence - 10 tracks\n-1976 Cobo Arena nite 1 - 10 tracks\n-1976 Cobo Arena nite 2 - 13 tracks\n-1976 Jersey city - 15 tracks\n-1976 Paris - 12 tracks\n-1976 Toronto - 14 tracks\n\n","torrent":{"xt":"urn:btih:acb65474c05e7c7dc8544ff248b306087f50f9b8","amp;dn":"KISS+Ultimate+Lossless+Audio+Collection+Additions+Part+1+-+Mick+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"acb65474c05e7c7dc8544ff248b306087f50f9b8","infoHashBuffer":{"type":"Buffer","data":[172,182,84,116,192,94,124,125,200,84,79,242,72,179,6,8,127,80,249,184]},"announce":[],"urlList":[]}}