{"title":"Soulcalibur Legends[WII][PAL][MULTI5].iso","uid":4365897,"size":4699979776,"categoryP":"games","categoryS":"wii","magnet":"?xt=urn:btih:ad0595bfdfacb65e569c380aa28552bc143b4b1c&amp;dn=Soulcalibur+Legends%5BWII%5D%5BPAL%5D%5BMULTI5%5D.iso&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"webchella","files":1,"time":1219889225,"description":"El Wiimote y el Nunchuk se convertirÃƒÆ’Ã‚Â¡n en tus armas mientras realizas tus movimientos y combos. Domina los ataques especiales que vayas adquiriendo a lo largo de la aventura mientras combates en diversos escenarios, machacando hordas de enemigos y gigantescos jefes finales. Con la ayuda de otros personajes de Soulcalibur, disfruta del universo de Soulcalibur desde una perspectiva completamente distinta.\n\nExclusivo para Wii: Juego diseÃƒÆ’Ã‚Â±ado especÃƒÆ’Ã‚Â­ficamente para Nintendo Wii, usa el Wiimote y el Nunchuk para manejar los ataques de tu personaje y poder reunir las piezas de Soul Edge\n\nElige a tus aliados prudentemente: Intercambia entre los distintos personajes que encontrarÃƒÆ’Ã‚Â¡s a lo largo del juego para conseguir mayor versatilidad en cada situaciÃƒÆ’Ã‚Â³n\n\nSoulcalibur ClÃƒÆ’Ã‚Â¡sico: Juega y sube de nivel a tu personaje favorito de Soulcalibur mientras sigues su camino en la historia y lo posicionas gracias al sistema de rankings\n\nNuevos enemigos y jefes finales: Las capacidades de lucha con espada se han llevado al limite para que te puedas encontrar a la altura de los nuevos enemigos y jefes finales\n\nProgresiÃƒÆ’Ã‚Â³n de las armas: Las armas evolucionan con tu experiencia, permitiÃƒÆ’Ã‚Â©ndote tener mejor control y ataques mÃƒÆ’Ã‚Â¡s poderosos\n\nLiberaciÃƒÆ’Ã‚Â³n Espiritual: Desata el ataque especial gracias a la LiberaciÃƒÆ’Ã‚Â³n Espiritual para machacar a tus enemigos.\n\nModo CampaÃƒÆ’Ã‚Â±a: Juega en 12 entornos distintos y lucha entre sus espectaculares paisajes que hacen a la vez de campo de batalla en 40 bÃƒÆ’Ã‚Âºsquedas\n\nModo Multijugador: Pon aprueba tus habilidades junto o contra un amigo en distintos modos de partida\n\nModo Versus: Lucha contra un amigo para saber quien es el verdadero maestro de las armas\n\nWii Competitivo: Compite por tener el record de bajas mientras derrotas los temibles enemigos.","torrent":{"xt":"urn:btih:ad0595bfdfacb65e569c380aa28552bc143b4b1c","amp;dn":"Soulcalibur+Legends%5BWII%5D%5BPAL%5D%5BMULTI5%5D.iso","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad0595bfdfacb65e569c380aa28552bc143b4b1c","infoHashBuffer":{"type":"Buffer","data":[173,5,149,191,223,172,182,94,86,156,56,10,162,133,82,188,20,59,75,28]},"announce":[],"urlList":[]}}