{"title":"[PDF] [2008] The New Testament as Literature A Very Short Introd","uid":6400333,"size":531335,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ae06a55a3ae84c2c5957a3ab9f89713595952180&amp;dn=%5BPDF%5D+%5B2008%5D+The+New+Testament+as+Literature+A+Very+Short+Introd&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"lyndavilla","files":2,"time":1305643284,"description":"DOWNLOAD MORE EBOOKS, MAGAZINES, &amp; PDFS:\n &lt;a href=&quot;\nhttp://buyabook.ws/download-ebooks-magazines-pdfs-more/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://buyabook.ws/download-ebooks-magazines-pdfs-more/&lt;/a&gt;\n\nBOOK INFO:\n\nThe words, phrases, and stories of the New Testament permeate the English language. Indeed, this relatively small group of twenty-seven works, written during the height of the Roman Empire, not only helped create and sustain a vast world religion, but also have been integral to the larger cultural dynamics of the West, above and beyond particular religious expressions.\n\nLooking at the New Testament through the lens of literary study, Kyle Keefer offers an engrossing exploration of this revered religious text as a work of literature, but also keeps in focus its theological ramifications. Unique among books that examine the Bible as literature, this brilliantly compact introduction offers an intriguing double-edged look at this universal text--a religiously informed literary analysis. The book first explores the major sections of the New Testament--the gospels, Paul's letters, and Revelation--as individual literary documents. Keefer shows how, in such familiar stories as the parable of the Good Samaritan, a literary analysis can uncover an unexpected complexity to what seems a simple, straightforward tale. At the conclusion of the book, Keefer steps back and asks questions about the New Testament as a whole. He reveals that whether read as a single document or as a collection of works, the New Testament presents readers with a wide variety of forms and viewpoints, and a literary exploration helps bring this richness to light.\n \nA fascinating investigation of the New Testament as a classic literary work, this Very Short Introduction uses a literary framework--plot, character, narrative arc, genre--to illuminate the language, structure, and the crafting of this venerable text.","torrent":{"xt":"urn:btih:ae06a55a3ae84c2c5957a3ab9f89713595952180","amp;dn":"%5BPDF%5D+%5B2008%5D+The+New+Testament+as+Literature+A+Very+Short+Introd","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae06a55a3ae84c2c5957a3ab9f89713595952180","infoHashBuffer":{"type":"Buffer","data":[174,6,165,90,58,232,76,44,89,87,163,171,159,137,113,53,149,149,33,128]},"announce":[],"urlList":[]}}