{"title":"War Inc Modern World Combat v1.317 apk","uid":13129541,"size":104571218,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:ae1b650ba711c5ea7388b10388afd6cfe5750294&amp;dn=War+Inc+Modern+World+Combat+v1.317+apk&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tiropitaki","files":1,"time":1451826100,"description":"War Inc. is a modern combat military game of skill and world domination! Command your army to glory in this epic war game! Deploy powerful towers, create an advanced military force, and conquer your enemies as you clash in battle against thousands of players! \r\n\r\nIn War Inc., you build an army of fast-paced modern Marines and Snipers, and command heavy Mechs, Scorpion Tanks, and Walkers to reduce your enemy's base to rubble! Do you have what it takes to conquer the War Corp ranks and rise to glory as you battle against your foes? \r\n\r\nFEATURES\r\n★ AMAZING GAMEPLAY: Deploy nuclear missiles and drone strikes to carpet bomb the base!\r\n★ LIVE EVENTS &amp; COMPETITIONS: Participate in weekly challenges and win prizes!\r\n★ FUTURISTIC COMMANDERS: Unleash the EMP Strike, Frequency HAARP, and many more commanders!\r\n★ MODERN UNITS &amp; TRAPS: Introducing the Mech, Walker, Teleportation, and Drone!\r\n★ MEGA ALLIANCE BASE: Build and upgrade a powerful alliance sector with your allies!\r\n★ ADVANCED UPGRADE SYSTEM: Turn your Command Center into an unbreakable fortress and unlock powerful researches to build an unstoppable force!\r\n★ MASSIVELY MULTIPLAYER: Online global battle with millions of players!\r\n★ GRIPPING SINGLE-PLAYER CAMPAIGN: Fight through hundreds of missions against the Rebellion!\r\n\r\n\r\n -THE WAR CORP STORY- \r\nThe year is 2085. In the wake of World War 3, leading governments have crumbled in the face of annihilation and a new power has emerged known only as the War Corp. To expand its power, conquer territory, and maintain order, the Corp inducts and trains the world's most skilled and powerful commanders, giving them command of its outposts.\r\n\r\nGlobal currency has now been replaced by Saphrite, a rare mineral, and oil has become an impacted resource with major battles being fought over control of the world's depleted reserves. As an Independent Military Contractor, you have just been recruited by the Corp…\r\n \r\nNote: Requires network connection and **at least** the following specs:\r\n0.5 GB of RAM (1GB or more recommended).\r\nA screen resolution of 800x480\r\nThere are country restrictions on Google Play for this game\r\nAndroid OS 2.3.3 or better","torrent":{"xt":"urn:btih:ae1b650ba711c5ea7388b10388afd6cfe5750294","amp;dn":"War+Inc+Modern+World+Combat+v1.317+apk","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae1b650ba711c5ea7388b10388afd6cfe5750294","infoHashBuffer":{"type":"Buffer","data":[174,27,101,11,167,17,197,234,115,136,177,3,136,175,214,207,229,117,2,148]},"announce":[],"urlList":[]}}