{"title":"The Island House - {CHB Books}","uid":14995789,"size":2303189,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ae70835b73c865a5213b93c77572e9bf80e72206&amp;dn=The+Island+House+-+%7BCHB+Books%7D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Rahul8826","files":1,"time":1466351448,"description":"Author: Nancy Thayer\r\nHardcover: 304 pages\r\nPublisher: Ballantine Books (May 31, 2016)\r\nLanguage: English\r\nISBN-10: 1101967048\r\nISBN-13: 978-1101967041\r\n\r\n\r\n\r\nNew York Times bestselling author Nancy Thayer evokes the shimmering seascape of Nantucket in a delightful novel that resonates with the heartache and hope of growing up, growing wise, and the bittersweet choices we must be brave enough to make.\r\n\r\nCourtney Hendricks will never forget the magical summers she spent on Nantucket with her college roommate, Robin Vickerey, and Robin’s charismatic, turbulent, larger-than-life family, in their gorgeous island house. Now a college English professor in Kansas City, Courtney is determined to experience one more summer in this sun-swept paradise. Her reason for going is personal: Courtney needs to know whether Robin’s brother James shares the feelings she’s secretly had for him.\r\n\r\nTime with the Vickerey family always involves love and laughter, and this season is no different. Vivacious matriarch Susanna Vickerey is celebrating her sixtieth birthday, but beneath the merriment, trouble is brewing. The family patriarch, Dr. Alastair Vickerey, is quiet and detached, while unspoken tension looms over oldest son Henry, a respected young surgeon. Warm and witty Robin, the most grounded of the siblings, is keeping a secret from her parents. Iris, the colorful baby of the brood, remains rudderless and in need of guidance. And the sexy, stunningly handsome, untouchable James—to Courtney’s dismay—may be in love with a beautiful and vibrant local artist. As the summer unfolds, a crisis escalates, surprising truths are revealed, and Courtney will at last find out where her heart and her future lie.\r\n\r\nWeaving the trials and uncertainty of real life into a tapestry of passion, hope, and courage,The Island House is a beautifully told story about the ties that bind us—and how the blessings of love and family heal us in ways we never dream possible","torrent":{"xt":"urn:btih:ae70835b73c865a5213b93c77572e9bf80e72206","amp;dn":"The+Island+House+-+%7BCHB+Books%7D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae70835b73c865a5213b93c77572e9bf80e72206","infoHashBuffer":{"type":"Buffer","data":[174,112,131,91,115,200,101,165,33,59,147,199,117,114,233,191,128,231,34,6]},"announce":[],"urlList":[]}}