{"title":"Tap Master - Improve Brain Accuracy Version 1.18","uid":13280587,"size":5199635,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:af6e35e7071610e2db082d700a113b692c8823b1&amp;dn=Tap+Master+-+Improve+Brain+Accuracy+Version+1.18&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"kazakhprinze","files":1,"time":1453485659,"description":"Tap Master is a simple but superbly entertaining tapping game that will keep you engrossed on your Android device for long. The beauty of this fast finger game is its simplicity of action, but mastering its trial and beating the achievement level is really challenging!\r\n\r\nHow to play the game:\r\n\r\nAfter downloading, simply start tapping as fast as possible on the screen following the color clue given for your next action. You have to tap all the same colored buttons at lightning fast speed to master this fast finger game. The faster you tap, the more you can score. At the end of the game, you will get to see your score, the best score, the number of games you have played and the number of taps you have performed so far. Once you have unlocked the achievement level, you can play against a pre set timer! Time-tap will get more challenging and exciting!\r\n\r\nPlay the app game Tap Master and check online how you are performing! You can access the achievement and leaderboard and can easily assess how you are mastering this tap-tap integrated sped up game.\r\n\r\nApp Features:\r\n\r\nBefore you download and start playing the app Tap Master, which is a reflex-packed tapping game, take a quick look at its interesting features:\r\n\r\n•Easy-to-understand user interface to learn and play the tap game at ease,\r\n•You need to tap faster in order to score more, \r\n•Once you unlock the achievement level, you will take your level up!\r\n•Access leaderboard to check how other online players are playing.\r\n•You can share your score of this reflex game on your social networking sites\r\n•There is no interrupting ad here: you can play this fast finger game at random without any distraction.\r\n•The app is optimized for all Android devices.\r\n\r\nDownload the free app Tap Master now and start patting as fast as possible to enjoy a tapping frenzy with your fingertips. This is a kid-friendly game: ask your kid to play the game. The fast tapping game will improve your kid’s motor skills and reflex play for sure!","torrent":{"xt":"urn:btih:af6e35e7071610e2db082d700a113b692c8823b1","amp;dn":"Tap+Master+-+Improve+Brain+Accuracy+Version+1.18","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af6e35e7071610e2db082d700a113b692c8823b1","infoHashBuffer":{"type":"Buffer","data":[175,110,53,231,7,22,16,226,219,8,45,112,10,17,59,105,44,136,35,177]},"announce":[],"urlList":[]}}