{"title":"Ferrell-International Meat Crisis(contaminated meat)(2001)","uid":4692299,"size":502265,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b291200eaaea047bbedc63cc058f4e60870b7a36&amp;dn=Ferrell-International+Meat+Crisis%28contaminated+meat%29%282001%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"red_gonzo","files":1,"time":1233434793,"description":"This is Vance H. Ferrell's shocking book International Meat Crisis - The Meat You Eat is Contaminated and Infected to a Degree Never Before Known in Human History (2001) which exposes the unnatural stuff that is put into the animal feed, the infections in livestock, the diseases we get from meat eating and proposes how to solve the problem. In the 21st century we have entered upon a level of contamination and disease in food animals that is beyond anything earlier experienced in human history. This is the story of what produced this situation and why, if you eat meat, it can be a serious danger to your health. Because the meat industry in the Western world ships its products to every continent, this has become a worldwide meat crisis. Extensively referenced and divided into three parts, the first one is about mad cow disease, second tells how meat is raised and slaughtered, the third tells about other diseases from meat eating. International Meat Crisis spells it all out what some people have been feeling all along, namely that due massive unnatural substances that are put into the animals we eat, they have become so chemically contaminated that they are today a danger to our health. 175 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:b291200eaaea047bbedc63cc058f4e60870b7a36","amp;dn":"Ferrell-International+Meat+Crisis%28contaminated+meat%29%282001%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b291200eaaea047bbedc63cc058f4e60870b7a36","infoHashBuffer":{"type":"Buffer","data":[178,145,32,14,170,234,4,123,190,220,99,204,5,143,78,96,135,11,122,54]},"announce":[],"urlList":[]}}