{"title":"The Office (US) Complete Seasons 1-7 for iPod Touch (mp4 format)","uid":6518093,"size":11664451869,"categoryP":"video","categoryS":"handheld","magnet":"?xt=urn:btih:b2eb0f03d76530bca0eb13389b027f77c6281307&amp;dn=The+Office+%28US%29+Complete+Seasons+1-7+for+iPod+Touch+%28mp4+format%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"Slammer94","files":140,"time":1309898784,"description":"This is the TV series &quot;The Office&quot; (US version, not UK) Seasons 1 through 7 converted into mp4 format to watch on an iPod Touch! \n\nI noticed there is no torrent on TPB with all seasons converted and decided to make one myself. All I did was download these seasons from different torrents on TPB, convert them to mp4 using Jodix Free iPod Video Converter, and rename the files to make them easier to manage. \n\nI have watched every episode on my touch and most of them are great. The only problem I found was that the audio is pretty out of sync in like 3 of the episodes in Season 1. This was a problem with the original files I downloaded, I didn't mess them up. I just don't care enough to figure out how fix them, sorry :) you can use VLC Media player (google it; it's free) to watch those and use it to fix the audio sync if you want. Otherwise, just deal with it on those episodes. If someone wants to fix the audio in those for everyone, just upload those three files (maybe it was four files, I can't remember) after they're fixed and put a link in the comments to them or something.\n\nPLEASE NOTE: I converted these specifically to iPod Touch format. They should still play just fine on any device that supports this format, but the resolution is only set to 480x320, so watching them on any bigger screen will result in some loss of quality. I did this to save as much space as possible, because I was only going to be watching them on my iPod.\n\nThe bitrate is like 320 as well, so don't expect anything HD. Just good enough quality to watch it without a problem. You can just download the first episode to test it if you want. \n\nPlease enjoy my first video upload that I hope a lot of people will really enjoy!!!","torrent":{"xt":"urn:btih:b2eb0f03d76530bca0eb13389b027f77c6281307","amp;dn":"The+Office+%28US%29+Complete+Seasons+1-7+for+iPod+Touch+%28mp4+format%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2eb0f03d76530bca0eb13389b027f77c6281307","infoHashBuffer":{"type":"Buffer","data":[178,235,15,3,215,101,48,188,160,235,19,56,155,2,127,119,198,40,19,7]},"announce":[],"urlList":[]}}