{"title":"Brainbombs - Obey","uid":5259853,"size":86158271,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b2f52053353e587bcb4c86bba46ca5ae58b84a45&amp;dn=Brainbombs+-+Obey&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"frank_pe","files":-1,"time":1262700498,"description":"Brainbombs - Obey\n\nGenre: Rock\nStyle: Garage Rock, Lo-Fi, Industrial, Noise\nYear: 1996\n\nDon't let the jaunty little Lawrence Welk ditty that opens Obey lull you into any sort of peaceful state, you'd best be prepared for the hateful murderous mayhem that Obey has in store for you. Then again, that's probably precisely what the Brainbombs had in mind. A gentle voice luring you into a dark alley, a shiny trinket distracting you while the burlap sack goes over your head and you're dragged kicking and screaming into the woods, a sweet piece of candy draws you just close enough so you can be knocked unconscious, tied up, and stuffed in the trunk. Those of you familiar with the brutal musical world of Brainbombs will know exactly what we're going on about. The rest of you, be very very careful. They traffic in a sludgey, jazzy garage rock scuzz stomp, repeated riffs, simple pounding drums, a lurching leering fuzzed out psychedelic dirge underpinning tales of murder and mayhem, murder and rape, death and dismemberment. This is probably their most overtly harsh record. Mostly because unlike the rest of their releases you can actually hear what these Swedes are singing about. All delivered in a sort of fey, heavily accented English. As if the song titles weren't enough,&quot;Kill Them All&quot;, &quot;Die You Fuck&quot;, &quot;Anal Desire&quot;, &quot;Lipstick On My Dick&quot;, &quot;Fuckmeat&quot;, the lyrics are misogynistic, misanthropic and just plain messed up. The sound is like Melvins meets Whitehouse filtered through the fuzzy garage stomp of the Stooges but with a maniacally repetitive looped quality, that cranks up the tension, while the vocalist slowly unravels and gets meaner and meaner, more and more insane. And let's not forget the occasional warbly warped trumpet (!). What can we say? We love Brainbombs.\n\nThe Releasing Eskimo\nProfile:\nThe main purpose for THE ESKIMO projekt is to make the underground music, writings and\nart, spread to a wider public. This by offering the presented products to a cheap price as possible.\nSublabel:\nArt-ic Culture\nContact Info:\nESKIMO\nBOX 120 11\n402 41 GOTHENBURG\nSWEDEN\n &lt;a href=&quot;\nhttp://anka.dyndns.org/brainbombs/interv/smackattack2.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://anka.dyndns.org/brainbombs/interv/smackattack2.html&lt;/a&gt;","torrent":{"xt":"urn:btih:b2f52053353e587bcb4c86bba46ca5ae58b84a45","amp;dn":"Brainbombs+-+Obey","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2f52053353e587bcb4c86bba46ca5ae58b84a45","infoHashBuffer":{"type":"Buffer","data":[178,245,32,83,53,62,88,123,203,76,134,187,164,108,165,174,88,184,74,69]},"announce":[],"urlList":[]}}