{"title":"Mechanical Properties of Polymers based on Nanostructure and Mor","uid":15445317,"size":21003743,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b479da6707a36f87fd0f17afb674eaf622aa847a&amp;dn=Mechanical+Properties+of+Polymers+based+on+Nanostructure+and+Mor&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"clouderone","files":1,"time":1469873919,"description":"Mechanical Properties of Polymers based on Nanostructure and Morphology - G.H. Michler, F.J. Baltá-Calleja (CRC, 2005).pdf\r\n\r\nThe improvement of strength and durability in polymers has implications relevant to industrial, medical, and household applications. Enhanced by the improved knowledge of the interactions between complex hierarchical structures and functional requirements, Mechanical Properties of Polymers Based on Nanostructure and Morphology focuses on new polymer materials that possess a combination of improved mechanical and other physical properties. \r\n\r\nThis book specifies techniques used in structural and morphological characterization, discusses crazing and molecular variables of fracture behavior, and clarifies various modes of deformation mechanisms and orientation processes for semicrystalline polymers, block copolymers, and composites. The volume examines microindentation hardness studies and mechanisms of toughness enhancement for particle modified, amorphous and semicrystalline polymers and blends using model analysis. Experts in the field present innovations that illustrate new aspects of manufacturing, structure development, and properties of practical relevance in nanoparticle-filled thermoplastic polymers and the applications of carbon nanotube and nanofiber reinforced polymer systems. Other topics discussed in the book include alternative methods of polymer modification based on micro- and nanolayered polymers and hot compaction of oriented fibers and tapes.\r\n\r\nThis book reflects the continuing research of mechanisms contributing to the structure-function relationship of nanostructured polymers and nanocomposites. Mechanical Properties of Polymers Based on Nanostructure and Morphology presents effective ways to combine improved mechanical and physical properties in polymers and form new, performance-enhanced composite materials.\r\n« Less","torrent":{"xt":"urn:btih:b479da6707a36f87fd0f17afb674eaf622aa847a","amp;dn":"Mechanical+Properties+of+Polymers+based+on+Nanostructure+and+Mor","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b479da6707a36f87fd0f17afb674eaf622aa847a","infoHashBuffer":{"type":"Buffer","data":[180,121,218,103,7,163,111,135,253,15,23,175,182,116,234,246,34,170,132,122]},"announce":[],"urlList":[]}}