{"title":"Gene Simmons","uid":4090956,"size":277729735,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:b584893f792384c75ed115e88b043c9a72ea3b38&amp;dn=Gene+Simmons&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ELI341","files":99,"time":1206061397,"description":"Gene Simmons\nSex, Money, Kiss\n2003 Publication\n\nAudio Book\n264mb\n\nThe legendary lothario of the rock band Kiss believes that the most important things in life are money, sex and more money-and he repeats variations on this theme in this highly entertaining book, which that covers much of the same autobiographical ground as his successful KISS and Make-Up, albeit with a different slant. Simmons readily admits that &quot;just because I stick out my tongue a lot and spit fire doesn&amp;#039;t mean I have any qualifications to advise anyone on relationship, money or career issues.&quot; What he does have is a highly successful rock band and, apparently, a highly developed ego, and he uses both to present a philosophy of work that is rooted, some would say ironically, in traditional Puritan virtues-work hard, save your money, don&amp;#039;t smoke, don&amp;#039;t drink, don&amp;#039;t get high, equate time with money and know that being rich is better than being poor. His example of a successful man is his equally hard-working Kiss partner Paul Stanley; as in his first book, Simmons trashes the bad habits of his other bandmates. His view of the sexes, however, is Neanderthal: the &quot;power of women is completely based on whether she can attract a man, biologically speaking,&quot; while &quot;the power of man is in achieving wealth and `killing things&amp;#039; so we can come back to the cave with a big piece of meat over our shoulder.&quot; This belief translates into Simmons&amp;#039;s main financial advice: &quot;The worst thing a man can do, financially and biologically speaking, is to get married.&quot; His messages are bound to resonate with the book&amp;#039;s prime target audience: not-so-young professional guys. 24 pages of color photos; b&amp;w photos throughout.","torrent":{"xt":"urn:btih:b584893f792384c75ed115e88b043c9a72ea3b38","amp;dn":"Gene+Simmons","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b584893f792384c75ed115e88b043c9a72ea3b38","infoHashBuffer":{"type":"Buffer","data":[181,132,137,63,121,35,132,199,94,209,21,232,139,4,60,154,114,234,59,56]},"announce":[],"urlList":[]}}