{"title":"Terminator 2 - Judgment Day.mp4","uid":6062156,"size":2410907418,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:b5c0136a107b281c489a2ac1f634b272df9bf848&amp;dn=Terminator+2+-+Judgment+Day.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"amartya61","files":1,"time":1293174696,"description":"............................High-res Movie.................................\nTerminator 2:\n Judgment Day, commonly abbreviated T2, is a 1991 science fiction action film directed, co-written, and co-produced by James Cameron and starring Arnold Schwarzenegger, Linda Hamilton, Edward Furlong, and Robert Patrick. A sequel to 1984's The Terminator, it follows the characters of Sarah Connor (Hamilton, reprising her role from the original film) and her son John  (Furlong) as they are pursued by a new, more advanced Terminator, the T-1000 (Patrick). Schwarzenegger reprises his role as the Terminator, but while the character was the antagonist of the first film, in Terminator 2  he is a protagonist, defending John and Sarah from the T-1000 and assisting them in their attempt to prevent Judgment Day, a future event in which machines will begin to exterminate humanity.\n\nTerminator 2 was a significant box office and critical success. It had an impact on popular culture, and is considered hugely influential in the genres of action and science fiction.[1] The film's visual effects included many breakthroughs in computer-generated imagery, marking the first use of natural human motion for a computer-generated character and the first partially computer-generated main character.[2] It received many accolades, including four Academy Awards for makeup, sound mixing, sound editing, and visual effects.","torrent":{"xt":"urn:btih:b5c0136a107b281c489a2ac1f634b272df9bf848","amp;dn":"Terminator+2+-+Judgment+Day.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5c0136a107b281c489a2ac1f634b272df9bf848","infoHashBuffer":{"type":"Buffer","data":[181,192,19,106,16,123,40,28,72,154,42,193,246,52,178,114,223,155,248,72]},"announce":[],"urlList":[]}}