{"title":"Tom T. Hall - Ballad Of Forty Dollars / Homecoming (1968)","uid":9433673,"size":130448244,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b5efb6f8c505eec8d514069d3c650416dacc1100&amp;dn=Tom+T.+Hall+-+Ballad+Of+Forty+Dollars+%2F+Homecoming+%281968%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1388851437,"description":"mp3 256\n\nHere are two albums from Tom T. Hall's late-'60s period, both of them stellar examples of his worth as a storyteller and a songwriter. A journeyman songwriter, Hall viewed his work as a job, but one he showed a passion for learning and living. The two albums featured here showcase Hall at one of the creative peaks of his life. There are a total of 26 tracks with Hall and his band, the Storytellers, including classics such as &quot;Shame on the Rain,&quot; &quot;That's How I Got to Memphis&quot; (which registers as one of the saddest brokenhearted love songs in country music history), &quot;Forbidden Flowers,&quot; &quot;The World the Way I Want It,&quot; &quot;Kentucky in the Morning,&quot; &quot;Margie's at the Lincoln Park Inn,&quot; and many others. The beauty of Hall's work during this period, and indeed for the most of the rest of his career, is that his writing comes from the point of empathy. The grain in his voice on these recordings is that of a friend or a neighbor who witnesses without judgment. Even in the first person there is no instance where the protagonist is saying, &quot;Why me God?&quot; In the desperation and sadness as well as in the joy or bewilderment, there is a quiet or raucous acceptance of life as it is. There is a generosity in this approach extended to the listener, which allows for our place in the narrative, not as an extension of our experience or his, but as a sharing of experience. Bear Family's choices in these two albums, recorded in 1968, is a phenomenal portrait in miniature of one of the greatest storytellers and songwriters of the 20th century. This is essential Tom T. Hall for the collector, and a tremendous introduction for the novice. - Allmusic (5/5 stars, AMG Album Pick)","torrent":{"xt":"urn:btih:b5efb6f8c505eec8d514069d3c650416dacc1100","amp;dn":"Tom+T.+Hall+-+Ballad+Of+Forty+Dollars+%2F+Homecoming+%281968%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5efb6f8c505eec8d514069d3c650416dacc1100","infoHashBuffer":{"type":"Buffer","data":[181,239,182,248,197,5,238,200,213,20,6,157,60,101,4,22,218,204,17,0]},"announce":[],"urlList":[]}}