{"title":"Pumped BMX +","uid":12458055,"size":163135835,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b6a36b0499f8c0a1316e9e0fd6c197b67907cb38&amp;dn=Pumped+BMX+%2B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dauphong","files":1,"time":1442769552,"description":"About This Game\nPumped BMX+ is a fast-paced arcade BMX game full of tricks, stunts and combos which originates from one of the most well-known BMX franchises in the world. Master over 500 challenges in this breathtaking sports game.\n\nOriginally developed by one-man studio Yeah Us!, Pumped BMX + is all about tricks, speed and skill. Players ride their way through increasingly challenging levels while pulling off crazy and impressive trick combinations. The game lets players choose their rider style and throw down their best stunts whilst racing through more than 500 challenges to reach the top of the leaderboards.\n\n- Beautifully rendered and varied environments: Bike through four distinct environments, ridin the simplest dirt tracks right up to lengthy and complex tracks filled with half-pipes, loops and death-defying leaps.\n\n- A new enhanced and intelligent control system: Play via the keyboard or with a controller, with easy to learn controls and an 'instant reset' button for those trickier stages.\n\n- A fully licensed electronic soundtrack from some of the best upcoming artists and bands.\n\n- Authentic BMX tricks which can be combined for almost unlimited creativity: Play with 8 basic and 8 advanced real-world tricks, and chaining them together to create a nearly unlimited amount of combos!\n\n- Customisable Bikes and Riders","torrent":{"xt":"urn:btih:b6a36b0499f8c0a1316e9e0fd6c197b67907cb38","amp;dn":"Pumped+BMX+%2B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b6a36b0499f8c0a1316e9e0fd6c197b67907cb38","infoHashBuffer":{"type":"Buffer","data":[182,163,107,4,153,248,192,161,49,110,158,15,214,193,151,182,121,7,203,56]},"announce":[],"urlList":[]}}