{"title":"J Church - 12 Albums (1993-2007) [FLAC]","uid":8024645,"size":3124764315,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b7b99c3655f3455c28b8b41090d1687cf88f2e82&amp;dn=J+Church+-+12+Albums+%281993-2007%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"politux","files":-1,"time":1358279265,"description":"\n  J Church - 12 Albums (1993-2007) [FLAC]\n\n  1993 - Quetzalcoatl\n  1994 - Camels, Spilled Corona and the Sound of Mariachi Bands\n  1994 - Prophylaxis\n  1995 - The Procession of Simulacra \n  1995 - Nostalgic for Nothing\n  1995 - Arbor Vitae\n  1996 - Drama of Alienation\n  1998 - Travels in Hyper Reality\n  1998 - Altamont '99\n  1998 - Cat Food\n  2000 - One Mississippi\n  2007 - Horror of Life\n  \n  Prolific San Francisco punk-pop trio J Church was formed in 1991 by singer/guitarist Lance Hahn and bassist Gardner Fusuhara, longtime friends who previously teamed in Cringer. Named in honor of a local bus route, the group went through a series of drummers before and after the 1993 release of their full-length debut, Quetzalcoatl; the album was quickly followed by Camels, Spilled Corona and the Sound of Mariachi Bands, a collection of early singles. \n\n  Upon completing 1994's Prophylaxis, J Church added drummer Reed Burgoyne, who made his recorded debut on the single &quot;Ivy League College&quot;; the continued flurry of 7&quot;s, split singles, and compilation appearances soon yielded a second compilation, Nostalgic for Nothing. After issuing 1995's Arbor Vitae on Hahn's own Honey Bear label, J Church caused much consternation among fans by signing to Honest Don's Hardly Used Recordings label for 1996's The Drama of Alienation; Burgoyne left the lineup a year later and was replaced by A Minor Forest drummer Andee Connors. \n\n  Yet another singles collection, 1998's Altamont 99, preceded the exits of Fusuhara and Connors, with bassist Jeff Bursley and ex-Jawbreaker drummer Adam Pfahler joining Hahn for 2000's One Mississippi. The round-up compilation Meaty, Beaty, Shitty Sounding appeared in 2001 and gathered together a bunch of the band's 7&quot; singles dating back to 1993; Palestine was released a year later. A split with Storm the Tower followed in the fall of 2003 before J Church officially debuted on Gainesville's No Idea Records with Society Is a Carnivorous Flower in August 2004. By that point, Hahn was rocking out alongside guitarist David DiDonato, bassist Ben White, and drummer Chris Pfeffer. Horror of Life appeared in the spring of 2007 minus DiDonato.","torrent":{"xt":"urn:btih:b7b99c3655f3455c28b8b41090d1687cf88f2e82","amp;dn":"J+Church+-+12+Albums+%281993-2007%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b7b99c3655f3455c28b8b41090d1687cf88f2e82","infoHashBuffer":{"type":"Buffer","data":[183,185,156,54,85,243,69,92,40,184,180,16,144,209,104,124,248,143,46,130]},"announce":[],"urlList":[]}}