{"title":"Stossel.2014.03.06.[Hey Big Spender].Fox Business.CF.avi","uid":9727308,"size":342373440,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b806f48abf77bdd37fe9eb3c3371c1d505c459ad&amp;dn=Stossel.2014.03.06.%5BHey+Big+Spender%5D.Fox+Business.CF.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"skJGZV6z","files":-1,"time":1394312030,"description":"----------\n\nSTOSSEL - [Hey, Big Spender!] - Fox Business Network\n2014, March 06, Thursday\n\nXvid/MP3 AVI - encoded from medium quality ReplayTV stream\n\n----------\n\n[excerpted from John Stossel's blog:]\n\n\nEND OF AUSTERITY?: Rep. Mike Pompeo says it's ridiculous that President Obama's recent budget focuses on spending more money. Romina Boccia of the Heritage Foundation agrees. She debates Bryce Covert of ThinkProgress, who says government should spend more.\n\nUNIVERSAL PRE-K: Part of President Obama's massive spending plan is &quot;free&quot; pre-school for all Americans. He claims every dollar we spend on that now will save $7 later. The president got that number from a study by Nobel prize winning economist James Heckman. I say the $1 to $7 claim is ridiculous. I'll debate Heckman.\n\nENTITLEMENTS: A year ago, the President agreed to make a more accurate cost of living adjustment for Social Security. Under the new budget the sensible agreement vanished. Evan Feinberg of Generation Opportunity says we're doomed.\n\nMILITARY SPENDING: Defense Secretary Chuck Hagel wants to reduce the size of the military to pre-WWII levels. Former presidential candidate Dr. Ron Paul says the military should shrink, but these reductions are &quot;smoke and mirrors.&quot; By the way, President Obama's budget actually proposes increasing military spending by $28 billion. More, always more.\n\nINFRASTRUCTURE: President Obama says his new budget &quot;will create new jobs in manufacturing and energy and innovation and infrastructure...&quot; Economist Ben Powell points out that government spending takes money out of entrepreneurs' hands, money that would create better jobs somewhere else.\n\nMY TAKE: Canada cut spending, and Canada's economy boomed. Even Sweden cut, and grew faster than the rest of Europe. When the Cold War ended, the first President Bush reduced military spending, and a Republican congress kept President Clinton from increasing spending too much. Our economy boomed. When people are free to spend their own money, life gets better. Will politicians ever learn that? Probably not. They love spending other people's money.","torrent":{"xt":"urn:btih:b806f48abf77bdd37fe9eb3c3371c1d505c459ad","amp;dn":"Stossel.2014.03.06.%5BHey+Big+Spender%5D.Fox+Business.CF.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b806f48abf77bdd37fe9eb3c3371c1d505c459ad","infoHashBuffer":{"type":"Buffer","data":[184,6,244,138,191,119,189,211,127,233,235,60,51,113,193,213,5,196,89,173]},"announce":[],"urlList":[]}}