{"title":"Blind Melon - Blind Melon (1992) WMA320","uid":6055753,"size":135712995,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:b93832c1af6f091e98ba4f892e102ab8c379f5c5&amp;dn=Blind+Melon+-+Blind+Melon+%281992%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1292909364,"description":"This is definitely one of my favorite albums that I've enjoyed in the last year or two. I remember buying this CD quite a few years ago on Ebay. Like everyone else, I remembered &quot;No Rain&quot; from the early 90's but I hadn't heard anything else from the album. I loved the song and I was like, &quot;What the hell. Why not buy it?&quot; When I bought it, I was narrow-minded as to what I was listening to, so I listened to the CD once and put it away. I picked it up again about a year ago and found myself listening to it a lot. It affected me quickly and I became in love with the album. This music to me is the deep South in the summer while relaxing on a hammock with a stiff drink in your hand. Like many other people's reviews about their debut album they say that it does grow on you, but this certainly doesn't mean that it won't affect you right away. It did for me the second time around. It is a brilliant album filled with many great songs. I can't think of a song that I won't listen to. The songs are heartfelt, beautifully structured, and perfectly executed. There is a feeling of despair and, at the same time, joy in Shannon Hoon's voice that filters through each song. It becomes clear when you really listen to the songs that Hoon was going through or had gone through some tough times in his life. My favorite songs are 'Change', 'Deserted', 'Tones of Home', 'No Rain', and 'I Wonder'. In my opinion, it is Blind Melon's most complete album and it was one of the best albums of the decade. This band had been shrugged off as a one hit wonder and many only remember them for the girl in the bee costume on the album cover and in the &quot;No Rain&quot; video. They are certainly more than that and more talented than people remember them for. Don't hesitate to check it out. It is a wonderful album filled with genuine songwriting and engaging music. \n\nby Randall Peach\n\nTRACKLIST:\n\n01 - Soak The Skin.wma                                      \n02 - Tones Of Home.wma                                      \n03 - I Wonder.wma                                           \n04 - Paper Scratcher.wma                                    \n05 - Dear Ol' Dad.wma                                       \n06 - Change.wma                                             \n07 - No Rain.wma                                            \n08 - Deserted.wma                                           \n09 - Sleepyhouse.wma                                        \n10 - Holyman.wma                                            \n11 - Seed To A Tree.wma                                     \n12 - Drive.wma                                              \n13 - Time.wma   \n\nWMA 320Kbps 44100Hz STEREO","torrent":{"xt":"urn:btih:b93832c1af6f091e98ba4f892e102ab8c379f5c5","amp;dn":"Blind+Melon+-+Blind+Melon+%281992%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b93832c1af6f091e98ba4f892e102ab8c379f5c5","infoHashBuffer":{"type":"Buffer","data":[185,56,50,193,175,111,9,30,152,186,79,137,46,16,42,184,195,121,245,197]},"announce":[],"urlList":[]}}