{"title":"Supergroup, VH1 - Episode 1-7","uid":3510092,"size":2561118208,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:b9e72f53139214287f843042706c2bd9ee201075&amp;dn=Supergroup%2C+VH1+-+Episode+1-7&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"JLJ27","files":7,"time":1154910655,"description":"While Ozzfest may prosper and Motley Crue shows sell out, the kingdom of hard rock, still waits for a powerful force to regain dominion over the power chords cut by crunk, pop-punk, and indie rock. Fortunately, VH1 has assembled some of the heaviest rock icons,who stand ready to thrash a new trail of carnage and excess and to lead the hard rock world as their new gods of thunder.\n\nVH1&amp;#039;s SUPERGROUP: Ted Nugent, Scott Ian (Anthrax), Sebastian Bach (Skid Row), Evan Seinfeld (Biohazard) and Jason Bonham (Bonham, UFO), are poised to re-conquer the rock world (and hopefully spread a little debauchery and black leather in the process) in the ultimate musical experiment. SUPERGROUP will bring together these five hard rocking icons and present them with the opportunity to create the heaviest SUPERGROUP. Ultimately viewers will see whether or not band will come together as hard rock&amp;#039;s saviors or simply implode.\n\nOver a of period two weeks in Las Vegas, legendary rock manager, Doc McGhee, will shepard the group towards their fate as hard rock heroes. As a respected manager, he automatically commands the respect of the band members and is not afraid to crack the whip. HeÂ´s a taskmaster with a two-week deadline that canÂ´t be missed. On day one, Doc will clearly lay out the stakes, goals, and the limited time that the SUPERGROUP truly has to revitalize and rule hard rock.\n\nTheir quest will culminate with a massive concert at The Empire Ballroom in Vegas. Yet the question remains, hard rock is ready to be saved but is the SUPERGROUP ready to save hard rock?","torrent":{"xt":"urn:btih:b9e72f53139214287f843042706c2bd9ee201075","amp;dn":"Supergroup%2C+VH1+-+Episode+1-7","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b9e72f53139214287f843042706c2bd9ee201075","infoHashBuffer":{"type":"Buffer","data":[185,231,47,83,19,146,20,40,127,132,48,66,112,108,43,217,238,32,16,117]},"announce":[],"urlList":[]}}