{"title":"The Complete Tommy and Tuppence Mystery Collection","uid":7190859,"size":764653778,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:bac9e1ce73d8550723d1d4037e4b3332cf72a0da&amp;dn=The+Complete+Tommy+and+Tuppence+Mystery+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Lucybabe","files":35,"time":1334617032,"description":"All from CD. ( 48 kbps / 44 kHz Mono, Fraunhofer CBR MP3, jetAudio 6+)\nThe title numbering is by year of publication of the original book.\n\n\n\n#1. The Secret Adversary (1922). [7 hrs 37 mins] - Read by Alex Jennings\nAgatha Christie's first Tommy and Tuppence audiobook is a thrill-packed novel of international intrigue and murder with all the Christie hallmarks of suspense and ingenuity. Tommy and Tuppence, two young people short of money and restless for excitement, embark on a daring business scheme -- Young Adventurers Ltd. Their advertisement says they are 'willing to do anything, go anywhere'. But their first assignment, for the sinister Mr Whittington, plunges them into more danger than they ever imagined!\n\n#2. Partners in Crime (1929). [7 hrs 8 mins] - Read by Hugh Fraser\nTommy and Tuppence Beresford were restless for adventure, so when they were asked to take over Blunt's International Detective Agency, they leapt at the chance. After their triumphant recovery of a pink pearl, intriguing cases kept on coming their way.\n\n#3. N or M? (1941). [6 hrs 23 mins] - Read by James Warwick\nIt is World War II, and while the RAF struggles to keep the Luftwaffe at bay, Britain faces an even more sinister threat from 'the enemy within' -- Nazis posing as ordinary citizens. With pressure mounting, the Intelligence service appoints two unlikely spies, Tommy and Tuppence Beresford. Their mission: to seek out a man and a woman from among the colourful guests at Sans Souci, a seaside hotel. But this assignment is no stroll along the promenade. After all, N and M have just murdered Britain's finest agent....\n\n#4. By the Pricking of My Thumbs (1968). [6 hrs 57 mins] - Read by Alex Jennings\nWhen Tommy &amp; Tuppence, older, but still with an unquenchable thirst for adventure and justice, visit an elderly aunt in her gothic nursing home, they think nothing of her mistrust of the doctors: after all she is elderly and has always been a difficult woman. But when Mrs Lockett mentioned a poisoned mushroom stew and Mrs Lancaster talked about 'something behind the fireplace', Tommy and Tuppence realise there could be more to the old lady's words than they originally thought -- and find themselves caught up in an unexpected adventure....\n\n#5. Postern of Fate (1973). [7 hrs 15 mins] - Read by Hugh Fraser\nTommy and Tuppence Beresford are just settling into their new home in a resort town when they come across a collection of children's books hidden away by a previous owner. One of the books bears the message, &quot;Mary Jordan did not die naturally&quot;. As the Beresfords dig deeper, someone in the town is determined to keep Mary's mysterious death a secret forever.... ","torrent":{"xt":"urn:btih:bac9e1ce73d8550723d1d4037e4b3332cf72a0da","amp;dn":"The+Complete+Tommy+and+Tuppence+Mystery+Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bac9e1ce73d8550723d1d4037e4b3332cf72a0da","infoHashBuffer":{"type":"Buffer","data":[186,201,225,206,115,216,85,7,35,209,212,3,126,75,51,50,207,114,160,218]},"announce":[],"urlList":[]}}