{"title":"Being John Malkovich (1999) 720p BrRip x264 - CLOWNSEC (PhreakyF","uid":9235013,"size":3119980442,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:bb4a540d2f7a4a5668635eaa1b08088090a698ed&amp;dn=Being+John+Malkovich+%281999%29+720p+BrRip+x264+-+CLOWNSEC+%28PhreakyF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"clownsec","files":-1,"time":1385154144,"description":"Being John Malkovich (1999) 720p BrRip x264 - CLOWNSEC (PhreakyFlix)\n\nWould you pay money to journey into the mind of the star of Con Air, The Killing Fields, and In The Line of Fire? Puppeteer Craig Schwartz (John Cusack) is having money problems, so he takes a temporary job as a file clerk on the seventh-and-a-half floor of a large office building. One day, while rummaging behind a cabinet, he finds a small door that leads to the center of the mind of actor John Malkovich (played by, you guessed it, John Malkovich). Craig discovers that entering the portal allows him to become John Malkovich for a brief spell, and in time he and his beautiful but aloof co-worker Maxine (Catherine Keener) get the bright idea to charge admission for the privilege of spending 15 minutes inside the head of a well-known actor. Malkovich realizes that something strange is happening to him, but can do little to stop it, as strangers take over his mind for a quarter-hour at a time. Craig's wife, Lotte (Cameron Diaz), eventually takes a trip into Malkovich's psyche, and she soon finds herself in love with Maxine, with whom Malkovich has an affair; meanwhile, Maxine in time becomes infatuated with both Craig and Lotte, but only when they're inside Malkovich. Being John Malkovich marked the feature-length debut of director Spike Jonze, who previously made acclaimed music videos for Weezer, the Beastie Boys, and the Breeders, among others. ~ Mark Deming, Rovi\n\nBROUGHT TO YOU BY CLOWNSEC * HONK *","torrent":{"xt":"urn:btih:bb4a540d2f7a4a5668635eaa1b08088090a698ed","amp;dn":"Being+John+Malkovich+%281999%29+720p+BrRip+x264+-+CLOWNSEC+%28PhreakyF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bb4a540d2f7a4a5668635eaa1b08088090a698ed","infoHashBuffer":{"type":"Buffer","data":[187,74,84,13,47,122,74,86,104,99,94,170,27,8,8,128,144,166,152,237]},"announce":[],"urlList":[]}}