{"title":"Benny Goodman 24 Bit Vinyl Pack","uid":9619018,"size":3059981111,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:bb4f6add28e14b7fe5bff3008fe8783762dc51b8&amp;dn=Benny+Goodman+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"politux","files":-1,"time":1392472850,"description":"\n  Benny Goodman 24 Bit Vinyl Pack\n\n  Genre: Jazz\n  Styles: Big Band, Swing\n  Source: vinyl\n  Codec: FLAC\n  Bitrate: ~ 1,500 - 2,900 kbps\n  Bit Depth: 24\n  Sampling Rate: 96 KHz\n\n  1952 Easy Does It! - Capitol H-295 (1st US Mono)\n  1954 B.G. In Hi-Fi (Part 1) - Capitol H1-565 (1st US Mono)\n  1963 Carnegie Hall Jazz Concert 1938 - Columbia OSL-160 (Mono)\n  1986 How Deep Is the Ocean - Melody - C60 24691\n  \n  Benny Goodman was the first celebrated bandleader of the Swing Era, dubbed &quot;The King of Swing,&quot; his popular emergence marking the beginning of the era. He was an accomplished clarinetist whose distinctive playing gave an identity both to his big band and to the smaller units he led simultaneously. The most popular figure of the first few years of the Swing Era, he continued to perform until his death 50 years later.\n\n  Goodman was the son of Russian immigrants David Goodman, a tailor, and Dora Rezinsky Goodman. He first began taking clarinet lessons at ten at a synagogue, after which he joined the band at Hull House, a settlement home. He made his professional debut at 12 and dropped out of high school at 14 to become a musician. At 16, in August 1925, he joined the Ben Pollack band, with which he made his first released band recordings in December 1926. His first recordings under his own name were made in January 1928. At 20, in September 1929, he left Pollack to settle in New York and work as a freelance musician, working at recording sessions, radio dates, and in the pit bands of Broadway musicals. He also made recordings under his own name with pickup bands, first reaching the charts with &quot;He's Not Worth Your Tears&quot; (vocal by Scrappy Lambert) on Melotone Records in January 1931. He signed to Columbia Records in the fall of 1934 and reached the Top Ten in early 1934 with &quot;Ain't Cha Glad?&quot; (vocal by Jack Teagarden), &quot;Riffin' the Scotch&quot; (vocal by Billie Holiday), and &quot;Ol' Pappy&quot; (vocal by Mildred Bailey), and in the spring with &quot;I Ain't Lazy, I'm Just Dreamin'&quot; (vocal by Jack Teagarden).\n\n  These record successes and an offer to perform at Billy Rose's Music Hall inspired Goodman to organize a permanent performing orchestra, which gave its first performance on June 1, 1934. His instrumental recording of &quot;Moon Glow&quot; hit number one in July, and he scored two more Top Ten hits in the fall with the instrumentals &quot;Take My Word&quot; and &quot;Bugle Call Rag.&quot; After a four-and-a-half-month stay at the Music Hall, he was signed for the Saturday night Let's Dance program on NBC radio, playing the last hour of the three-hour show. During the six months he spent on the show, he scored another six Top Ten hits on Columbia, then switched to RCA Victor, for which he recorded five more Top Ten hits by the end of the year.\n\n  After leaving Let's Dance, Goodman undertook a national tour in the summer of 1935. It was not particularly successful until he reached the West Coast, where his segment of Let's Dance had been heard three hours earlier than on the East Coast. His performance at the Palomar Ballroom near Los Angeles on August 21, 1935, was a spectacular success, remembered as the date on which the Swing Era began. He moved on to a six-month residency at the Congress Hotel in Chicago, beginning in November. He scored 15 Top Ten hits in 1936, including the chart-toppers &quot;It's Been So Long,&quot; &quot;Goody-Goody,&quot; &quot;The Glory of Love,&quot; &quot;These Foolish Things Remind Me of You,&quot; and &quot;You Turned the Tables on Me&quot; (all vocals by Helen Ward). He became the host of the radio series The Camel Caravan, which ran until the end of 1939, and in October 1936, the orchestra made its film debut in The Big Broadcast of 1937. The same month, Goodman began a residency at the Pennsylvania Hotel in New York.\n\n  Goodman's next number one hit, in February 1937, featured Ella Fitzgerald on vocals and was the band's first hit with new trumpeter Harry James. It was also the first of six Top Ten hits during the year, including the chart-topping &quot;This Year's Kisses&quot; (vocal by Margaret McCrae). In December, the band appeared in another film, Hollywood Hotel. The peak of Goodman's renown in the 1930s came on January 16, 1938, when he performed a concert at Carnegie Hall, but he went on to score 14 Top Ten hits during the year, among them the number ones &quot;Don't Be That Way&quot; (an instrumental) and &quot;I Let a Song Go out of My Heart&quot; (vocal by Martha Tilton), as well as the thrilling instrumental &quot;Sing, Sing, Sing (With a Swing),&quot; which later was inducted into the Grammy Hall of Fame.\n\n  By 1939, Goodman had lost such major instrumentalists as Gene Krupa and Harry James, who left to found their own bands, and he faced significant competition from newly emerged bandleaders such as Artie Shaw and Glenn Miller. But he still managed to score eight Top Ten hits during the year, including the chart-topper &quot;And the Angels Sing&quot; (vocal by Martha Tilton), another inductee to the Grammy Hall of Fame. He returned to Columbia Records in the fall. In November, he appeared in the Broadway musical Swingin' the Dream, leading a sextet. The show was short-lived, but it provided him with the song &quot;Darn That Dream&quot; (vocal by Mildred Bailey), which hit number one for him in March 1940. It was the first of only three Top Ten hits he scored in 1940, his progress slowed by illness; in July he disbanded temporarily and underwent surgery for a slipped disk, not reorganizing until October. He scored two Top Ten hits in 1941, one of which was the chart-topper &quot;There'll Be Some Changes Made&quot; (vocal by Louise Tobin), and he returned to radio with his own show. Among his three Top Ten hits in 1942 were the number ones &quot;Somebody Else Is Taking My Place&quot; (vocal by Peggy Lee) and the instrumental &quot;Jersey Bounce.&quot; He also appeared in the film Syncopation, released in May.\n\n  American entry into World War II and the onset of the recording ban called by the American Federation of Musicians in August 1942 made things difficult for all performers. Goodman managed to score a couple of Top Ten hits, including the number one &quot;Taking a Chance on Love&quot; (vocal by Helen Forrest), in 1943, drawn from material recorded before the start of the ban. And he used his free time to work in films, appearing in three during the year: The Powers Girl (January), Stage Door Canteen (July), and The Gang's All Here (December).\n\n  Goodman disbanded in March 1944. He appeared in the film Sweet and Low-Down in September and played with a quintet in the Broadway revue Seven Lively Arts, which opened December 7 and ran 182 performances. Meanwhile, the musicians union strike was settled, freeing him to go back into the recording studio. In April 1945, his compilation album Hot Jazz reached the Top Ten on the newly instituted album charts. He reorganized his big band and scored three Top Ten hits during the year, among them &quot;Gotta Be This or That&quot; (vocal by Benny Goodman), which just missed hitting number one. &quot;Symphony&quot; (vocal by Liza Morrow) also came close to hitting number one in early 1946, and Benny Goodman Sextet Session did hit number one on the album charts in May 1946. Goodman hosted a radio series with Victor Borge in 1946-1947, and he continued to record, switching to Capitol Records. He appeared in the film A Song Is Born in October 1948 and meanwhile experimented with bebop in his big band. But in December 1949, he disbanded, though he continued to organize groups on a temporary basis for tours and recording sessions.","torrent":{"xt":"urn:btih:bb4f6add28e14b7fe5bff3008fe8783762dc51b8","amp;dn":"Benny+Goodman+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bb4f6add28e14b7fe5bff3008fe8783762dc51b8","infoHashBuffer":{"type":"Buffer","data":[187,79,106,221,40,225,75,127,229,191,243,0,143,232,120,55,98,220,81,184]},"announce":[],"urlList":[]}}