{"title":"ES-Computing EditPlus v4.0.555 x86-x64","uid":13278282,"size":4531973,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:bc7e716beb75b65b325b370630cd297e7eb35ec6&amp;dn=ES-Computing+EditPlus+v4.0.555+x86-x64&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"FirstUploads","files":6,"time":1453461732,"description":"Screenshot:   https://5i5.co/C\n\nEditPlus is a text editor, HTML editor, PHP editor, Java editor and Hex Viewer for Windows. While it can serve as a good Notepad replacement, it also offers many powerful features for Web page authors and programmers.\n\n\n    Syntax highlighting for HTML, PHP, Java, C/C++, CSS, ASP, Perl, JavaScript, VBScript, Python andRuby on Rails. Also, it can be extended for other programming languages based on custom syntax files.\n    Seamless Web browser for previewing HTML pages, and FTP (also sftp and FTPS) feature for uploading local files to FTP server.\n    Other features include Hex Viewer, HTML toolbar, user tools, line number, ruler, URL highlighting, auto completion, cliptext, column selection, powerful search and replace, multiple undo/redo, spell checker, customizable keyboard shortcuts, and more.\n\n \nFeatures:\n \nSyntax highlighting\n\nEditPlus supports powerful and customizable syntax highlighting for HTML, CSS, PHP, ASP, Perl, C/C++,Java, JavaScript and VBScript by default. Also, you can create your own syntax file to support other programming languages.\n\nInternet features\n\n    Seamless web browser for previewing the content of your HTML document or Java applet without leaving the editor. Browser window also has common browser commands so you can browse Internet web sites as well as local HTML files.\n    FTP (also sftp and FTPS) feature for uploading your local files to FTP server or for editing remote files directly.\n    Highlights URL and e-mail addresses in normal text files and lets you activate them with a single keystroke (F8) or 'Ctrl + double-click'.\n\nHex Viewer\n\nThe Hex Viewer allows you to display current file in Hex mode. You can switch back and forth between normal editing window and the Hex Viewer with one command.\n\nCode Folding\n\nEditPlus supports fast and convenient code folding feature based on line indentation. You can hide or disply lines of code with its indent levels.\n\nHTML toolbar\n\nThe HTML Toolbar allows you to insert common HTML tags quickly and easily. It also supports useful tools such as HTML Color Picker, Character Picker, Table Generator and Object Picker.\n\nDocument selector\n\nThe Document Selector offers quick mouse access to all document windows currently loaded. Much faster than selecting on Window menu or pressing Ctrl+Tab key multiple times.\n\nUser tools\n\nEditPlus supports user-defined tools, help files and keystroke recording files. The output of tool execution can be captured in the Output Window, so that you can double-click the error line to automatically load the file and locate the cursor to that line.\n\nAuto completion\n\nAuto completion is a time-saving feature which changes a short abbreviation into a complete string. It supports Perl and C/C++ by default. Also, you can create your own auto completion file to support other programming languages.\n\nCliptext window\n\nThe cliptext window is collection of text clips for quick and easy access. You can easily customize them, and you can also create your own cliptext file.\n\nDocument template\n\nDocument template offers a quick start when you create a new document.\n\nOther features\n\nLine number, ruler, column selection, powerful search and replace, multiple undo/redo, spell checker, customizable keyboard shortcuts, and more.\n\nFeature Summary...\n\nThings to do...\n \n \n \nWhat's New:\n \nVersion 4.0 (2015-07-08)\n&lt;Features&gt;\n* Supports keyboard input on column selection.\n* 'Reload unsaved buffers' option ('Preferences'-&gt;'General').\n* 'Auto Indent on Paste' menu option ('Edit'-&gt;'Clipboard').\n* Base64 Encode/Decode commands ('Edit'-&gt;'Convert').\n* 'Insert spaces instead of tab' option allows different number of spaces.\n* Allows double click on Fonts dialog box.\n\n&lt;Bug fixes&gt;\n* Program could crash when loading file in right-to-left language.\n* 'An additional file name' option for Settings &amp; syntax didn't work.\n* URL highlighting couldn't handle multiple URLs in single line.\n* Print command showed tabs in wrong sizes.\n* Drag and drop cliptext item didn't work correctly.\n* Fixes screen update issue when changing font.\n* Join Line now doesn't add extra spaces at the end of line.\n* Custom icon for User Toolbar didn't show correctly in High DPI screens.\n* Prevents keyboard column selection being changed by moving mouse pointer.\n* Cliptext window couldn't load ctl files in Unix format.\n* Fixes document tab issue on Windows 10 preview","torrent":{"xt":"urn:btih:bc7e716beb75b65b325b370630cd297e7eb35ec6","amp;dn":"ES-Computing+EditPlus+v4.0.555+x86-x64","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc7e716beb75b65b325b370630cd297e7eb35ec6","infoHashBuffer":{"type":"Buffer","data":[188,126,113,107,235,117,182,91,50,91,55,6,48,205,41,126,126,179,94,198]},"announce":[],"urlList":[]}}