{"title":"[E-book-Ita-poliziesco]La gita a Tindari","uid":4571978,"size":355468,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bd679dcf5e1c1a4c799e2c7ff85fcf2d5ca286bf&amp;dn=%5BE-book-Ita-poliziesco%5DLa+gita+a+Tindari&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mitimex","files":1,"time":1229090178,"description":"Che collegamento puÃƒÂ² esserci tra un laido personaggio pornografo e &quot;femminaro&quot; che viene ucciso sul portone di un palazzo e la scomparsa, nello stesso condominio, di due inseparabili vecchietti, i signori Griffo che, abituati da sempre a starsene rinchiusi in casa, decidono invece di partecipare ad una di quelle gite &quot;tutto compreso&quot;, a poco prezzo dove durante il percorso si vendono meravigliose pentole? Che cosa puÃƒÂ² esserci a Tindari che li ha spinti ad andarci? E che fine hanno fatto?\nSarÃƒÂ  Beatrice, detta &quot;Beba&quot;, la bella giovane che diverrÃƒÂ  nel romanzo successivo L'odore della notte, la moglie dell'amico e vice commissario MimÃƒÂ¬ Augello, che darÃƒÂ  al comissario il primo indizio sul caso. L'accompagnatrice e venditrice gli racconta infatti che durante la gita venivano fatte dall'autista del pullman turistico delle foto ricordo che ingrandite faranno notare al commissario la presenza di un' auto che seguiva il pullman con i due vecchi coniugi seduti in disparte nell'ultima fila di posti.\nI due coniugi, si scoprirÃƒÂ  in seguito, sono stati uccisi, mano nella mano, in una lontana campagna secondo uno stile di esecuzione mafiosa. Ma che c'entra la mafia con i due vecchietti? \nAiutante di primo piano all'indagine, oltre ai soliti Fazio e MimÃƒÂ¬ , questa volta sarÃƒÂ  l'addetto al centralino telefonico del commissariato: l'ineffabile piantone Catarella, affezionatissimo e devoto ammiratore del suo dottori, che rivela doti inaspettate di esperto informatico.\nProprio quel Catarella che parla un tutto suo &quot;catarellesco&quot; linguaggio e che quando apre le porte le fa &quot;esplodere&quot; contro la parete provocando la caduta di calcinacci e il quasi infarto del &quot;dottori&quot; , messo da Montalbano al computer dell'ucciso NenÃƒÂ¨ Sanfilippo, dedicandosi, giorno e notte alla ricerca scoprirÃƒÂ  le password che lo proteggono. Analizzando il contenuto dell' hard disk, Catarella, arrossendo per l'imbarazzo, scoprirÃƒÂ  foto pornografiche delle avventure del Sanfilippo con Vania Titulesco, moglie rumena del famoso chirurgo Eugenio IsgrÃƒÂ², specialista in trapianti d'organo e la bozza di un romanzo di fantascienza che darÃƒÂ  al commissario la chiave per risolvere il caso a suo modo, con un colpo di tiatro...\n","torrent":{"xt":"urn:btih:bd679dcf5e1c1a4c799e2c7ff85fcf2d5ca286bf","amp;dn":"%5BE-book-Ita-poliziesco%5DLa+gita+a+Tindari","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd679dcf5e1c1a4c799e2c7ff85fcf2d5ca286bf","infoHashBuffer":{"type":"Buffer","data":[189,103,157,207,94,28,26,76,121,158,44,127,248,95,207,45,92,162,134,191]},"announce":[],"urlList":[]}}