{"title":"Wilbur Smith - The Egyptian Series by TyrAnt","uid":4174413,"size":1904606,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bd87f35550b2e1d38bd60866cc15b3d754b80f57&amp;dn=Wilbur+Smith+-+The+Egyptian+Series+by+TyrAnt&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"alfifre","files":-1,"time":1210040254,"description":"River God   book 1\n..................\n\nPart of the 'Egyptian' series\n\nAncient Egypt. Land of the Pharaohs. A kingdom built on gold. A legend shattered by greed... Now the Valley of the Kings lies ravaged by war, drained of its lifeblood, as weak men inherit the cherished crown.\n\nCity of Thebes. The Festival of Osiris. Loyal subjects of the Pharaoh gather to pay homage to their leader, but Taita ? a wise and formidably gifted eunuch slave ? sees him only as a symbol of a kingdom's fading glory. Beside Taita stand his protÃƒÂ©gÃƒÂ©s: Lostris, daughter of Lord Intef, beautiful beyond her fourteen years; and Tanus, proud young army officer, whose father was betrayed by Lord Intef, Chief Vizier of Egypt whose power is second in wealth only to the Pharaoh.\n\nTanus and Lostris are deeply in love, but unbeknown to them, their union is an impossibility. Taita is the slave of Lord Intef. It was Intef who had Taita gelded as a young boy after he found that he had slept with a young slave girl. Together Taita, Lostris and Tanus share a dream ? to restore the majesty of the Pharaoh of Pharaohs on the glittering banks of the Nile.\n\nThrough the voice of the incomparable Taita, Wilbur Smith draws the reader irresistibly into the daily lives of his characters: their hopes, their fears, their passions.\n\nA glorious civilisation. An epic journey. A heroic battle. An enduring love. Here is a magnificent, richly imagined saga that explodes with all the drama, mystery and rage of a bygone time.\n\n\n\n----------------------------------------------------------------------------------\n\n\nThe Seventh Scroll  book 2\n..........................\n\nPart of the 'Egyptian' series\n\nThe Seventh Scroll. Nearly four thousand years old. A fading legacy from beyond the grave. Within it lie the clues to a fabulous treasure from an almost forgotten time...\n\nDuraid Al Simmu and his beautiful half-English, half-Egyptian wife, Royan, were the first to discover the tomb of Queen Lostris. And with it the scrolls in which the wily Taita recorded the burial of Pharaoh Mamose with all his vast treasure.\n\nBut as their present-day search moves from the Nile to the uplands of Ethiopia, a savage battle begins, to unlock the Pharaoh's secrets. For others will stop at nothing to gain the prize as their own.\n\nWhen Duraid is brutally murdered and their research notes stolen, Royan is forced to seek refuge in England.\n\nWith eminent and aristocratic archaeologist Nicholas Quenton-Harper, she can pick up the pieces of her shattered life. With him she can find the courage to return to Ethiopia. For Duraid. For Taita. And for the dreams of an ancient Pharaoh...\n\nAfter the worldwide success of River God comes another thundering triumph from the master African storyteller. The Seventh Scroll is a magnificent adventure set in present-day Africa, yet indelibly linked to the world of River God nearly four thousand years ago.\n\n\n----------------------------------------------------------------------------------\n\n\nWarlock  book 3\n...............\n\nPart of the 'Egyptian' series\n\nSet in Ancient Egypt and following on from River God and The Seventh Scroll, Warlock marks the return of the world's finest adventure writer. After the death of his beloved Queen Lostris, Taita performs the rites of embalmment and burial for her. Then, stricken with grief, he retreats into the forbidding deserts of North Africa, where he becomes a hermit. Over the years that follow he devotes himself to the study of the mysteries of the occult until, armed with these extraordinary powers, he gradually transforms himself into the Warlock.\n\nNow Taita answers the summons from the beyond. He leaves the desert vastness and returns to the world of men, to find himself plunged into a terrible conflict against the forces of evil which threaten to overwhelm the throne and the realm of Egypt, and to destroy the young prince Nefer, who is the grandson of Queen Lostris.\n\nWith vivid depictions of battle and intrigue, of love and passion, with fascinating characters both good and evil, Wilbur Smith brings to life in colourful detail the world of ancient Egypt. This is a masterful feat of story-telling by one of the world's best-selling authors.\nReviews","torrent":{"xt":"urn:btih:bd87f35550b2e1d38bd60866cc15b3d754b80f57","amp;dn":"Wilbur+Smith+-+The+Egyptian+Series+by+TyrAnt","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd87f35550b2e1d38bd60866cc15b3d754b80f57","infoHashBuffer":{"type":"Buffer","data":[189,135,243,85,80,178,225,211,139,214,8,102,204,21,179,215,84,184,15,87]},"announce":[],"urlList":[]}}