{"title":"DeviceBondage---DB-26530 Nikki Darling MP4","uid":7946570,"size":2485591456,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:be1fa5060aaf95670cb1f1e5bb8efe582689817d&amp;dn=DeviceBondage---DB-26530+Nikki+Darling+MP4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"merzedes","files":-1,"time":1356145832,"description":"\nDefiled - Nikki Darling\n\nDec 21, 2012 - Performers: Nikki Darling \n\n\nWMV only. MP4 + Pics later.     \n        \n\nEbony stunner Nikki Darling is intense. She is an active and performing dancer and has the physique of a sleek panther in its prime. In scene one, she is given a perch. Sitting on an uncomfortable vintage metal tractor seat that is transformed into a mini throne, her whole body is zip tied together. Her elbows touch as vicious and inescapable hard plastic bites into her flesh all the way down to her feet... her lovely tender soles. Claire clips off the last zip tie, taking Nikki's shoes off and creates a uncomfortable predicament for Nikki that the cunt won't soon forget involving nipple clamps, wax, the cane, nipple weights, and twine from each of Nikki's big toes to her nipple clamps. In scene two, the panther is on the prowl. She is positioned in a low crouching doggy in metal and leather, and made to look like a panther ready to strike. The greedy whore cums from pain and Claire obliges her by using the single tail and a really stingy rubber flogger. With her amazing ass displayed in the air, a nice thick cock is rammed to the hilt into her more than willing ass hole. Orgasm after orgasms, she moans and writhes. Finally we test this bitch and push her to the max in endurance flexibility bondage. A cruel forward bend strappado suspension in leather. Claire goes after her feet with the cane, introduces harsh clamps to Nikki's labia and a nice anal hook to the booty. Orgasms are ripped from this helpless cunt's body. So hot. So helpless.\n\nScreens &lt;a href=&quot;\nhttp://www.devicebondage.com/site/shoot.jsp?shootId=26530&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.devicebondage.com/site/shoot.jsp?shootId=26530&lt;/a&gt;\n\n9000 uploads and counting, 10k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:be1fa5060aaf95670cb1f1e5bb8efe582689817d","amp;dn":"DeviceBondage---DB-26530+Nikki+Darling+MP4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be1fa5060aaf95670cb1f1e5bb8efe582689817d","infoHashBuffer":{"type":"Buffer","data":[190,31,165,6,10,175,149,103,12,177,241,229,187,142,254,88,38,137,129,125]},"announce":[],"urlList":[]}}