{"title":"Dark Shadows Original Series Ep 36-44.mp4","uid":9844810,"size":1943766442,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:be5496d796a50d64872a5e204904de74571b37d3&amp;dn=Dark+Shadows+Original+Series+Ep+36-44.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":null,"files":1,"time":1396054608,"description":"Dark Shadows is an American gothic soap opera that originally aired weekdays on the ABC television network, from June 27, 1966, to April 2, 1971. The series became hugely popular when vampire Barnabas Collins (Jonathan Frid) appeared a year into its run. Dark Shadows also featured werewolves, zombies, man-made monsters, witches, warlocks, time travel, and aparallel universe. A small company of actors each played many roles; indeed, as actors came and went, some characters were played by more than one actor. Major writers included Art Wallace, Malcolm Marmorstein, Sam Hall and Gordon Russell.\n\nDark Shadows was distinguished by its vividly melodramatic performances, atmospheric interiors, memorable storylines, numerous dramatic plot twists, unusually adventurous music score, and broad and epic cosmos of characters and heroic adventures. Now regarded as something of a classic, it continues to enjoy an intense cult following.\n\nAlthough the original series ran for only five years, its scheduling as a daily daytime drama allowed it to amass more single episodes during its run (1,225) than most other science-fiction/fantasy genre series produced for English-language television, including Doctor Who and the entire Star Trek television franchise.","torrent":{"xt":"urn:btih:be5496d796a50d64872a5e204904de74571b37d3","amp;dn":"Dark+Shadows+Original+Series+Ep+36-44.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be5496d796a50d64872a5e204904de74571b37d3","infoHashBuffer":{"type":"Buffer","data":[190,84,150,215,150,165,13,100,135,42,94,32,73,4,222,116,87,27,55,211]},"announce":[],"urlList":[]}}