{"title":"Google SketchUp Pro 2013 Build 4812 [TheFoundry]","uid":8860999,"size":76186783,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:bedf073dbe096b69e32273b53b5df403949d160b&amp;dn=Google+SketchUp+Pro+2013+Build+4812+%5BTheFoundry%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"onyxx1606","files":-1,"time":1377774311,"description":"There are few things that Google don't do well and this even extends to making 3D art accessible to the most inexperienced artist in the form of Google SketchUp.\n\nGoogle SketchUp bucks the trend of expensive 3D modeling software such as 3DSMax and Cinema4D and presents a free, easy to use alternative with which you can even post your creations onto Google Earth for the world to see. The latest version has been integrated with Google Maps too so that geo-tagging your creations is easier than ever.\n\nThere's a refreshing lack of technical jargon in Google SketchUp and unfamiliar terms to beginners such as the 'Extrude' tool have been renamed to the more obvious 'Push/Pull' for example. There are plenty of helpful hints and guides throughout too helping you get to grips with 'snapping' when you draw rectangles, circles and other shapes. Google Sketchup intelligently predicts where you want endpoints to meet and snaps them shut for you, saving lots of time messing around.\n\nSketchUp doesn't lack in functionality though despite its ease of use and includes all the usual collection of drawing and filling tools you'd expect, neatly accessible in the toolbar across the top of the screen. Instructor hints pop out on the right of the screen when it thinks you need them. Other options can be accessed via the menu system, or you can choose to place extra palettes on the workspace to save wading through menus. Of particular note is the 'Materials' palette, which contains over 100 different preset swatches, such as vegetation, metal and glass. The Shadow Settings palette is also worth keeping to hand, as it allows you to apply realistic shadows via simple sliders.\n\nThe real fun however is when you export your Google SketchUp drawings into Google Earth. You can send images of your 3D designs via email or upload them for free storage at Google's 3D Web Warehouse. Alternatively, you can geo-tag them in one-step using Google Maps which has now been integrated into Google Sketchup. You receive a snapshot when you add a geo-location to your model which now includes 3D terrain data plus color aerial imagery.\n\nThere are some problems with Google SketchUp however. Most annoying is when trying to create domed surfaces because of the cumbersome nature of the Extrude tool, although pushing and pulling straight lines is considerably easier. Being free, it also obviously lacks some of the advanced features of many of its heavyweight rivals.\n\nGoogle SketchUp provides a refreshingly simple approach to 3D graphic design and modeling and is ideal for non experts in CAD technology.\n\nRecent changes\nImproved support for large models\nPhoto Textures\nNearby models\n-------------------------------------------------------------------\n\nWARNING\nDownloading Torrents is illegal, if you enjoy Google/Trimble products please go and purchase them\n","torrent":{"xt":"urn:btih:bedf073dbe096b69e32273b53b5df403949d160b","amp;dn":"Google+SketchUp+Pro+2013+Build+4812+%5BTheFoundry%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bedf073dbe096b69e32273b53b5df403949d160b","infoHashBuffer":{"type":"Buffer","data":[190,223,7,61,190,9,107,105,227,34,115,181,59,93,244,3,148,157,22,11]},"announce":[],"urlList":[]}}