{"title":"What Every Engineer Should Know {BBS}","uid":7287118,"size":11125102,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bf37c9a6f2812a72880daa1357ab668d54ba10ea&amp;dn=What+Every+Engineer+Should+Know+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1337618399,"description":"You can find them in your wristwatch or MP3 player; they perform specific functions in washing machines, traffic lights, and even pacemakers. Embedded systems are pervasive, ubiquitous, and widespread throughout our daily lives. Developing these real-time embedded products requires an understanding of the interactions between different disciplines, such as circuit design, power, cooling, packaging, software, and human interface. This volume provides the knowledge and insight engineers need to make critical design decisions and offers a clear guide for preparing and developing projects in different markets.\n\nThe book begins by laying the basic groundwork for effective processes, covering smaller, self-contained devices and subsystems, ranging from handheld devices to appliances. Highly detailed case studies, which include designing instruments for space flight, implanted medical devices, and military support equipment, illustrate industry best practices and managerial issues. Each case study is detailed in terms of concept, market, standards, integration, manufacturing, and phases. With schedule and estimation templates, this highly functional text presents numerous examples of design tradeoffs critical to successful project development.\n\nOffering even coverage and clarification of the entire development process, What Every Engineer Should Know about Developing Real-Time Embedded Products provides engineers and industrial designers with practical tools to make important decisions, from deciding whether to buy or build subsystems to determining the appropriate kinds of field testing.\n\n\nPaperback: 496 pages\nPublisher: CRC Press (October 24, 2007)\nLanguage: English\nISBN-10: 0849379598\nISBN-13: 978-0849379598","torrent":{"xt":"urn:btih:bf37c9a6f2812a72880daa1357ab668d54ba10ea","amp;dn":"What+Every+Engineer+Should+Know+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf37c9a6f2812a72880daa1357ab668d54ba10ea","infoHashBuffer":{"type":"Buffer","data":[191,55,201,166,242,129,42,114,136,13,170,19,87,171,102,141,84,186,16,234]},"announce":[],"urlList":[]}}