{"title":"Lifeline 2 v1.0","uid":12786758,"size":46653412,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:c0499cc9653d408504e35a78585110ba6f411959&amp;dn=Lifeline+2+v1.0&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Androider","files":1,"time":1447873457,"description":"The Lifeline series continues to capture the imaginations of countless players worldwide with compelling real-time storytelling.\r\n\r\nLifeline 2 raises the bar with a new suspenseful story from Dave Justus almost twice as long as the original, with many more choices and paths to explore. Lifeline 2 features a 28-minute original soundtrack and is fully optimized for Android Wear, delivering the best Lifeline experience on Android Wear yet.\r\n\r\nThe second story in the Lifeline series connects you with Arika, a young woman on a deadly quest to avenge her parents and rescue her long-lost brother. Your choices will keep her alive and help her succeed as she faces mortal danger on her way to a final, fateful showdown against the forces that threaten all of humanity.\r\n\r\nLifeline stories play out in real time. As Arika travels to complete her quest, notifications deliver new messages throughout your day. Keep up as they come in, or catch up later when you’re free. You can even respond to Arika directly from your Android Wear or your Android lock screen, without launching into the app on your phone.\r\n\r\nAfter completing any story branch, you can rewind to earlier parts of the story, or speed through parts you’ve already read. See what happens when you make a different choice: will you guide Arika virtuously, or cut corners to gain an edge? Seemingly simple actions can deeply affect the outcome.\r\n\r\nArika’s story, and the fate of the world, depend on your judgment. You will face the consequences together, because Arika is relying on YOU.\r\n\r\nLifeline 2 features no in-app purchases and no ads. An Internet connection is not required.\r\n\r\nMore info:\r\n \nhttps://play.google.com/store/apps/details?id=com.threeminutegames.lifeline2.goog","torrent":{"xt":"urn:btih:c0499cc9653d408504e35a78585110ba6f411959","amp;dn":"Lifeline+2+v1.0","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0499cc9653d408504e35a78585110ba6f411959","infoHashBuffer":{"type":"Buffer","data":[192,73,156,201,101,61,64,133,4,227,90,120,88,81,16,186,111,65,25,89]},"announce":[],"urlList":[]}}