{"title":"Watching Movies - Rick Lyman","uid":11675977,"size":372966,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c0636ba0fc9c5b120095fe8ea6294e1bf7f2c8eb&amp;dn=Watching+Movies+-+Rick+Lyman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ZamKhan","files":1,"time":1422878129,"description":"Watching Movies: The Biggest Names in Cinema Talk about the Films that Matter Most - Rick Lyman\n\n\nAn inside look at how some of the hottest figures in the film industry view their craft\n\nIn this unique collection, New York Times film critic Rick Lyman sits down with notable directors, actors, screenwriters, cinematographers, and other film industry professionals to watch and discuss a movie that each person considers seminal or influential on his or her career. From Steven Soderbergh on how All the President's Men influenced Erin Brockovich and Traffic, to Woody Allen's, John Travolta's, Sissy Spacek's, and Kevin Smith's favorite movies, each interviewee's character is revealed in the resulting essays, which deepen our appreciation of landmark films, and give us extraordinary insight into the process of filmmaking.\n\nLyman enhances every essay with a brief biography, career history, and complete filmography of each of the subjects, which puts them in a historical and creative context.\n\nDrawn from the enormously popular series in The New York Times, Watching Movies will fascinate film students and curious moviegoers alike","torrent":{"xt":"urn:btih:c0636ba0fc9c5b120095fe8ea6294e1bf7f2c8eb","amp;dn":"Watching+Movies+-+Rick+Lyman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0636ba0fc9c5b120095fe8ea6294e1bf7f2c8eb","infoHashBuffer":{"type":"Buffer","data":[192,99,107,160,252,156,91,18,0,149,254,142,166,41,78,27,247,242,200,235]},"announce":[],"urlList":[]}}