{"title":"Nanomaterials Handbook - Yuri Gogotsi","uid":15534409,"size":17715815,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c10c3d0eeac0adb38ddb41232076ffd37f41563a&amp;dn=Nanomaterials+Handbook+-+Yuri+Gogotsi&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"clouderone","files":1,"time":1470866896,"description":"Nanomaterials Handbook - Yuri Gogotsi (CRC, 2006).pdf\r\n\r\nEven before it was identified as a science and given a name, nanotechnology was the province of the most innovative inventors. In medieval times, craftsmen, ingeniously employing nanometer-sized gold particles, created the enchanting red hues found in the gold ruby glass of cathedral windows. Today, nanomaterials are being just as creatively used to improve old products, as well as usher in new ones. From tires to CRTs to sunscreens, nanomaterials are becoming a part of every industry.\r\nThe Nanomaterials Handbook provides a comprehensive overview of the current state of nanomaterials. Employing terminology familiar to materials scientists and engineers, it provides an introduction that delves into the unique nature of nanomaterials. Looking at the quantum effects that come into play and other characteristics realized at the nano level, it explains how the properties displayed by nanomaterials can differ from those displayed by single crystals and conventional microstructured, monolithic, or composite materials.\r\n\r\nThe introduction is followed by an in-depth investigation of carbon-based nanomaterials, which are as important to nanotechnology as silicon is to electronics. However, it goes beyond the usual discussion of nanotubes and nanofibers to consider graphite whiskers, cones and polyhedral crystals, and nanocrystalline diamonds. It also provides significant new information with regard to nanostructured semiconductors, ceramics, metals, biomaterials, and polymers, as well as nanotechnology’s application in drug delivery systems, bioimplants, and field-emission displays.\r\n\r\nThe Nanomaterials Handbook is edited by world-renowned nanomaterials scientist Yury Gogotsi, who has recruited his fellow-pioneers from academia, national laboratories, and industry, to provide coverage of the latest material developments in America, Asia, Europe, and Australia","torrent":{"xt":"urn:btih:c10c3d0eeac0adb38ddb41232076ffd37f41563a","amp;dn":"Nanomaterials+Handbook+-+Yuri+Gogotsi","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c10c3d0eeac0adb38ddb41232076ffd37f41563a","infoHashBuffer":{"type":"Buffer","data":[193,12,61,14,234,192,173,179,141,219,65,35,32,118,255,211,127,65,86,58]},"announce":[],"urlList":[]}}