{"title":"Acunetix Website Scanner Enterprise 6.5 [2010] [GuruFuel]","uid":5699400,"size":19782619,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:c31af6d2eab6012a7c5587f139483c3ab4277a20&amp;dn=Acunetix+Website+Scanner+Enterprise+6.5+%5B2010%5D+%5BGuruFuel%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"RedHatcc","files":1,"time":1279437676,"description":"Acunetix Website Scanner Enterprise 6.5 [2010] [GuruFuel]\n &lt;a href=&quot;\nhttp://w&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://w&lt;/a&gt; w w.acunetix.c o m/\n\n\nInstallation file and crack included. \n\n\n\nAs many as 70% of web sites have vulnerabilities that could lead to the theft of sensitive corporate data such as credit card information and customer lists.\n\nHackers are concentrating their efforts on web-based applications - shopping carts, forms, login pages, dynamic content, etc. Accessible 24/7 from anywhere in the world, insecure web applications provide easy access to backend corporate databases.\n\nFirewalls, SSL and locked-down servers are futile against web application hacking!\n\nWeb application attacks, launched on port 80/443, go straight through the firewall, past operating system and network level security, and right in to the heart of your application and corporate data. Tailor-made web applications are often insufficiently tested, have undiscovered vulnerabilities and are therefore easy prey for hackers.\n\n\n\nAcunetix - a world-wide leader in web application security\n\nAcunetix has pioneered the web application security scanning technology: Its engineers have focused on web security as early as 1997 and developed an engineering lead in web site analysis and vulnerability detection.\n\nAcunetix Web Vulnerability Scanner includes many innovative features:\n\n    * AcuSensor Technology\n    * An automatic client script analyzer allowing for security testing of Ajax and Web 2.0 applications\n    * Industries' most advanced and in-depth SQL injection and Cross site scripting testing\n    * Advanced penetration testing tools, such as the HTTP Editor and the HTTP Fuzzer  \n    * Visual macro recorder makes testing web forms and password protected areas easy\n    * Support for pages with CAPTHCA, single sign-on and Two Factor authentication mechanisms\n    * Extensive reporting facilities including VISA PCI compliance reports\n    * Multi-threaded and lightning fast scanner crawls hundreds of thousands of pages with ease\n    * Intelligent crawler detects web server type and application language\n    * Acunetix crawls and analyzes websites including flash content, SOAP and AJAX\n    * Port scans a web server and runs security checks against network services running on the server  \n\n\n\n\n\n\n\n\n\n\n\n=================================================\n\nG U R U F U E L \n           .com\n\nHARDWARE, SOFTWARE, PROGRAMMING, HACKING, GAMING.","torrent":{"xt":"urn:btih:c31af6d2eab6012a7c5587f139483c3ab4277a20","amp;dn":"Acunetix+Website+Scanner+Enterprise+6.5+%5B2010%5D+%5BGuruFuel%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c31af6d2eab6012a7c5587f139483c3ab4277a20","infoHashBuffer":{"type":"Buffer","data":[195,26,246,210,234,182,1,42,124,85,135,241,57,72,60,58,180,39,122,32]},"announce":[],"urlList":[]}}