{"title":"Android 2.2 froyo for HTC HD2 (RAM instal)","uid":6063433,"size":104441815,"categoryP":"applications","categoryS":"handheld","magnet":"?xt=urn:btih:c327ce480b7bbcc27dcf181b6a59474360efad93&amp;dn=Android+2.2+froyo+for+HTC+HD2+%28RAM+instal%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"garaisezis","files":2,"time":1293220286,"description":"------------------------------------------------------------\nSuperRAM FroYo by darkstone1337\nVersion 1.5\nRelease: 18-December-2010\nThread: http://forum.xda-developers.com/showthread.php?t=870518\n------------------------------------------------------------\n\n------------------------------------------------------------\nIf you don't know anything, SEARCH GOOGLE FIRST.\n------------------------------------------------------------\n\n\nWhat is SuperRAM FroYo?\n- It is an AOSP rom with some modifications added, but kept as close to stock as possible. The only thing that is modified is the keyboard, some menu options and the launcher.\n\n\nWhat is special about this build?\n- What is special about this build is that the entire Android O/S filesystem is stored in RAM before it is booted.\n\n\nWhat does this mean? \n- Well, RAM is faster than NAND(ROM) and SD Card which in turn will make the build superfast too! Very fast. Very very fast!\n\n\nI don't understand what NAND(ROM) or RAM is!\n- NAND is a slower memory type (ROM) which is designed to hold data even after the phone is turned off. This is where your Windows Mobile operating system is stored.\n- RAM is a much faster memory type which is designed to hold information on a temporary basis. After your phone is turned off, the data in RAM is lost.\n- Running Android on your HD2 does not touch your ROM in any way! So when you turn off the phone and turn it back on, Windows Mobile will be loaded. No changes are made to ROM.\n\n\nDoes this mean I'm going to lose the stuff that I put in Android when my phone goes off or crashes?!\n- NO. Only the operating system files for this build will be stored in RAM. User data and downloads will be saved to your SD card in a special file called data.img\n- Remember if your phone crashes in Android, nothing will affect your Windows Mobile operating system since this build runs off RAM.\n\n\nWhat other advantages does this build have?\n- Unlike normal builds which are ran from the SD card, this build will not stress your SD card nearly as much. This will allow faster transfer speeds and less chance of data corruption.\n- Battery usage will be less than SD card based builds as the operating systems files will be accessed from RAM instead of the SD card.\n- Quick android boot!\n\n\nSomething isn't working properly!\n- First of all check the build thread by SEARCHING FIRST to see if there is a solution to your problem or if it is already listed as a known issue. If there is no solution and the problem has not been posted by someone else, ONLY THEN should you post here: http://forum.xda-developers.com/showthread.php?t=870518\n- Please include details about the issue, such as how to replicate the problem.\n\n\n\n\n\n\n------------------------------------------------------------\n\n\nInstallation and Setup:\n\nMake sure that you do not have another Android folder on your SD card. If you do, then either rename the folder or back it up to another location and delete the folder.\n\nCopy the folders named Android and media to the ROOT of your SD card. If you don't know what the root of the SD card is, look here: http://uk.answers.yahoo.com/question/index?qid=20080521052942AAMW3kA\n\nOn your HTC HD2, use file explorer to browse to the Android folder on your SD card. Run the program CLRCAD.EXE (nothing is supposed to show up when you run this program.). Then run haret.exe.\n\nYou will now see a green HTC logo on a black background for a couple of seconds, then you will see nothing but a blank screen for a couple of seconds.\n\nAfter this, you will see the android unlock screen. Unlock the lock screen and go through the setup wizard. After this is done, import your SIM contacts if you have any.\n\nTo do this, open the Phone app, press the Contacts tab, then press the Windows hardware button on your HD2 and select Import/Export. Select Import from SIM card. From here, press the Windows button again and select Import All. \n\n\n\n\nIf you do not see your SIM contacts then follow the instructions below:\n*****************************************************************************\nIf you are using an existing data.img then you will need to delete the one that you are currently using, and copy over a fresh data.img that is included with this build. If this is your first time booting this build, then this does not apply to you.\n\n- Open the phone app and dial this code in: *#*#4636#*#*\n- You should now see a list of menus, choose the one named Phone information.\n- Scroll down to the bottom of the page and press the 'Turn off radio' button. Wait for your signal to drop.\n- Now press the 'Turn on radio'. Wait for your signal to be restored.\n- Now change 'Set Preferred Network Type' to GSM/CDMA auto (PRL). \n\nAfter doing this, return to the home screen (press the Home hardware button on your HD2) then open the phone app again and follow the instructions on how to import your contacts as described earlier.\n\nYOU CAN ONLY DO THIS ON YOUR FIRST BOOT. YOU MUST KEEP THIS IN MIND.\n*****************************************************************************\n\n\n\n\n- After importing your contacts, you MUST reboot your phone. If you do not do this, then your data connection will not be enabled.\n- Hold down the end call hardware button and select Reboot.\n- You will now boot back into Windows Mobile. Run CLRCAD.EXE and haret.exe as described earlier to load Android.\n\nAfter this, the installation is fully complete and you can now start using Android.\n\n\n\n\n\n\n\n\n------------------------------------------------------------\n\n\n\n\n\n\n\n\n\n\n\n\n\nNotes:\n\n\n- I have included a 256MB data.img, however you can use any size that you wish if you have your own data.img.\n\n\n\n- After your first boot, make sure to delete the DATA folder on your SD card. It is stored under Android/root/data.\n- If you plan to reinstall the build again, make sure to copy back this folder from the ZIP file.\n\n\n- Robot voice issue may occur when in a call. If this happens, during the call press the LOUDSPEAKER button then END THE CALL. Do this exactly and every call after will no longer have this issue.\n\n\n- You are left with around 280MB+ free RAM after booting the build. This is enough memory for anything!\n\n\n- Build.prop is easy to modify, I have included a copy in /Android/root/system on the SD card. Modify this as you with and your changes will be copied over upon the boot of Android. If you mess something up, just delete the file and the changes won't be applied upon next boot. This goes for any file you put in the Android/root/ folder.\n\n\n- I'm not going to be like other chefs and say &quot;THE BATTERY LIFE IS EXCELLENT I PROMISE&quot; etc. Everyone's setup is different, just test the build for yourself!\n\n\n- Forget quadrant scores! If you're judging this build by quadrant scores then I pity you. This type of build is different from other builds, yes the quadrant scores may not be in the 2000+ range, but honestly, can you actually say to me that this build is slower than other builds that have a higher score? I sure hope not.\n\n\n- To delete LauncherPro just uninstall it from the Application Manager! Before you do this, make sure you install another launcher such and ADW Launcher or Gingerbread launcher which can be found from the Market free of charge.\n\n\n\n- The base rom is from AdamG's OxygeN Desire rom which has been modified by myself.\n- The initrd and CSSync updates is based on that from cedesmith. However, I've modified the initrd for my own build.\n- The PPP wrapper update is from LeTama's thread, version 0.7\n- The HaRet loader is custom made by NetRipper, thanks to him for helping me increase the initial ramdisk size limitation!\n\nFor developers only:\n- The kernel included is hastarin's r8.6 eb_oldcam kernel, this has been modified for my build!\n- Kernel source: http://www.gitorious.com/~hastarin/linux-on-wince-htc/hastarins-linux_on_wince_htc\n- Patch: http://pastebin.com/6qjkb4Hh\n\n\n\n\n\n------------------------------------------------------------\n\n\nBugs Fixed in version 1.5:\n- Data corruption fixed (framework force close)\n- App compatibility increased (skype, drocap2, other apps should now work)\n- SIM contacts fix (read above on how to get SIM contacts on your phone if you do not see your contacts)\n- Camera app force close on settings now fixed\n- Wifi tethering now working (use the Wireless Tether app included)\n- Unable to remove LauncherPro is now fixed, I've moved the launcher to /data (read above on how to change launcher)\n- UI sounds should now work for everyone\n\nBugs Remaining:\n- Notification LED's only blink once\n- SetCPU unable to change CPU speed (not that I think that theres much need to do this anyway)\n- Possible PPP data issues for some people\n\nNew Features:\n- Gingerbread keyboard now has a multi-language auto-complete dictionary (access this in keyboard settings and choose your language)\n- Added RTL support (thanks to Ambious for his modified framework file!)\n- Updated to Google Maps v5\n- Added Astro file manager\n\n\n------------------------------------------------------------\n\n\n\nThanks to everyone at #htc-linux, #htc-linux-chat and at xda-developers for your help, guidance and support!\nThanks to my beta testers! Thanks to Hastarin for pointing out the toolchain issue which cases high power usage in sleep!\n\nThe first boot will take under a minute, subsequent boots will take much less time.\n\nI am running HTC HD2 Stock rom 3.14.405.2.\nMy radio is 2.15.50.14, I have NO robot noise issue with the combination.\n\n\n","torrent":{"xt":"urn:btih:c327ce480b7bbcc27dcf181b6a59474360efad93","amp;dn":"Android+2.2+froyo+for+HTC+HD2+%28RAM+instal%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c327ce480b7bbcc27dcf181b6a59474360efad93","infoHashBuffer":{"type":"Buffer","data":[195,39,206,72,11,123,188,194,125,207,24,27,106,89,71,67,96,239,173,147]},"announce":[],"urlList":[]}}