{"title":"The Duel- Pakistan on the Flight Path of American Power by Tariq","uid":11374411,"size":3620933,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c3473a6509ef0de8454612c1c5980c4edcfdcba0&amp;dn=The+Duel-+Pakistan+on+the+Flight+Path+of+American+Power+by+Tariq&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gratefuldawg77","files":6,"time":1415130322,"description":"Pakistan is the sixth most populous country in the world. It is the only Islamic state to have nuclear weapons. Its border with Afghanistan extends over one thousand miles and is the likely hideout of Osama bin Laden. It has been under military dictatorship for thirty-three of its fiftyyear existence. Yet it is the linchpin in the United States' war on terror, receiving over $10 billion of American aid since 2001 and purchasing more than $5 billion of U.S. weaponry in 2006 alone.These days, relations between the two countries are never less than tense. Pakistani president Pervez Musharraf reported that U.S. deputy secretary of state Richard Armitage threatened to &quot;bomb Pakistan back to the Stone Age&quot; if it did not commit fully to the alliance in the wake of 9/11. Presidential hopeful Barack Obama said he would have no hesitation in bombing Al Qaeda inside the country, &quot;with or without&quot; approval of the Pakistani government. Recent surveys show that more than 70 percent of Pakistanis fear the United States as a military threat to their country.\n\nThe Bush administration spent much of 2007 promoting a &quot;dream ticket&quot; of Musharraf and Benazir Bhutto to run Pakistan together. That strategy, with Bhutto assassinated and the general's party winning less than 15 percent of the contested seats in the 2008 election, is now in tatters.\n\nWith increasingly bold attacks by Taliban supporters in the border regions threatening to split the Pakistan army, with the only political alternatives -- Nawaz Sharif and Benazir's widower Asif Ali Zardari -- being as corrupt as the regime they seek to replace, and with a newly radicalized movement of lawyers testing its strength as championsof the rule of law, the chances of sustained stability in Pakistan look slim.\n\nThe scion of a famous Punjabi political family, with extraordinary contacts inside the country and internationally, Tariq Ali has long been acknowledged as a leading commentator on Pakistan. In these pages he combines deep understanding of the country's history with extensive firsthand research and unsparing political judgment to weigh the prospects of those contending for power today. The labyrinthine path between a secure world and global conflagration runs right through Pakistan. No one is better placed to trace its contours","torrent":{"xt":"urn:btih:c3473a6509ef0de8454612c1c5980c4edcfdcba0","amp;dn":"The+Duel-+Pakistan+on+the+Flight+Path+of+American+Power+by+Tariq","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c3473a6509ef0de8454612c1c5980c4edcfdcba0","infoHashBuffer":{"type":"Buffer","data":[195,71,58,101,9,239,13,232,69,70,18,193,197,152,12,78,220,253,203,160]},"announce":[],"urlList":[]}}