{"title":"Burning the Reichstag (2013) Benjamin Carter Hett (multi)","uid":9421896,"size":14299719,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c41f7d53a552b07f29a1f31b0b2393ad10f1927e&amp;dn=Burning+the+Reichstag+%282013%29+Benjamin+Carter+Hett+%28multi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"7","files":-1,"time":1388605170,"description":"Burning the Reichstag: An Investigation into the Third Reich's Enduring Mystery (2013) Benjamin Carter Hett (multi)\n\nBurning the Reichstag: An Investigation into the Third Reich's Enduring Mystery by Benjamin Carter Hett\n\n\nFormat: mobi/epub/azw3\nLength: 429 pages\nGenre: History\nDate: 13 November 2013\n\nIn Burning the Reichstag, Benjamin Hett offers a gripping account of Hitler's rise to dictatorship - one that challenges orthodoxy and recovers the true significance of the part the fire played. At the scene the police arrested 23-year-old Marinus van der Lubbe, a Dutch Communist stonemason. Though he was initially dismissed abroad as a Nazi tool, post-war historians since the 1950s have largely judged him solely guilty - a lone arsonist exploited by Hitler.\n\nHett's book reopens the case, providing vivid portraits of key figures, including Rudolf Diels, Hermann Goering, Joseph Goebbels, and the historian Fritz Tobias, whose account of the fire has, until now, been the standard. Making use of a number of new sources and archives, Hett sets the Reichstag fire in a wider context, revealing how and why it has remained one of the last mysteries of the Nazi period, and one of the most controversial and contested events in the 20th century. Burning the Reichstag will stand as the landmark work on this subject.\n\nAuthor:\n\nBenjamin Carter Hett, a former trial lawyer and professor of history at Hunter College and the Graduate Center, City University of New York, is the author of Death in the Tiergarten and Crossing Hitler, winner of the Fraenkel Prize.\n","torrent":{"xt":"urn:btih:c41f7d53a552b07f29a1f31b0b2393ad10f1927e","amp;dn":"Burning+the+Reichstag+%282013%29+Benjamin+Carter+Hett+%28multi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c41f7d53a552b07f29a1f31b0b2393ad10f1927e","infoHashBuffer":{"type":"Buffer","data":[196,31,125,83,165,82,176,127,41,161,243,27,11,35,147,173,16,241,146,126]},"announce":[],"urlList":[]}}