{"title":"Graphics Converter PRO 2013 2.00 Build 130215 Incl Crack [TorDig","uid":8148806,"size":33232904,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c506d727889dc09ab2d70355865851204fdffb4e&amp;dn=Graphics+Converter+PRO+2013+2.00+Build+130215+Incl+Crack+%5BTorDig&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TorDigger","files":10,"time":1360990248,"description":"IconCool Software Graphics Converter PRO 2013\n\nGraphics Converter Pro is an easy-to-use and powerful batch graphics converter and image viewer, that can import more than 500 graphic formats and export more than 100 formats including BMP, GIF, JPG, PNG and many others. The program comes with 50 image filters and 12 image effects and more. Graphics Converter also supports EXE Builder. It will quickly convert a group of pictures and PDF to a stand-alone exe file, so let you easily create self-running slide show package (exe file), and make PDF readable on any computer without Adobe PDF software installed. You can customize properties, such as set password and picture quality, background music and page title etc. Graphics Converter Pro offers 12 image effects, including Flip, Wave, Noise, Arbitrary Rotation, and more. You can save your selected filters or effects as default set, and apply them in a batch processing. Support file association, slide show, live update and desktop capture.\n\nGraphics Converter Pro Features:\n\n- Supports more than 500 graphic formats;\n- Can import more than 500 graphic file formats and many sub types.\n- Can export 140 graphic file formats.\n- Supports 60 image filters, including Blurring, Sharpening, Embossing, Diffusing, Color Balance, and more;\n- Supports 13 image effects, including Flip, Wave, Noise, Arbitrary Rotation, and more.\n- Provides a smart image capturing tool to capture images of various sizes from a desktop or any other software.\n- Can convert a group of image files in 25 formats to BMP, GIF, JPG, PNG, WBMP, EMF, TGA, TIF and WMF files.\n- Can convert any part of an image to BMP, GIF, JPG, PNG, WBMP, EMF, TGA, TIF and WMF files.\n- as a powerful and easy-to-use slide-show tool.\n- Has a very simple, user-friendly interface. You can resize the main areas of the program simply by dragging your mouse\n\nSupported OS:\n\nWindows 8/7/vista/xp\n\nHomepage: http://www.iconcool.com/graphics-converter.htm\n\nInstallation Instructions:\n\n- Install program.\n- Copy content from crack folder and paste into default installation directory.\n- Done, Enjoy.\n\nHave A Nice Day\n\nNote: Uploader is only responsible if any problem in torrent, never responsible for software functionality problems.\n","torrent":{"xt":"urn:btih:c506d727889dc09ab2d70355865851204fdffb4e","amp;dn":"Graphics+Converter+PRO+2013+2.00+Build+130215+Incl+Crack+%5BTorDig","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c506d727889dc09ab2d70355865851204fdffb4e","infoHashBuffer":{"type":"Buffer","data":[197,6,215,39,136,157,192,154,178,215,3,85,134,88,81,32,79,223,251,78]},"announce":[],"urlList":[]}}