{"title":"[XLGirls] Bri Love (Young Bra-Buster's Secret Sex Fantasy Cums T","uid":9069130,"size":484923456,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:c5779d3e7521173cc5d3adbbb7f317c20d2910ce&amp;dn=%5BXLGirls%5D+Bri+Love+%28Young+Bra-Buster%27s+Secret+Sex+Fantasy+Cums+T&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"chkm8te","files":1,"time":1382161339,"description":"[XLGirls] Bri Love (Young Bra-Buster's Secret Sex Fantasy Cums True / 10.18.2013)\n\n&quot;I really don't have sex all that often, maybe once a month,&quot; young Bri Love said in her very bashful style. You have seen her original videos. What you see is what she is and that is a shy and innocent 19-year-old from Texas. &quot;My favorite positions are doggy, cowgirl and reverse cowgirl. I have a fantasy about having sex in public but I've never done it. I'd like to one day. I usually have sex just at home in my bedroom.&quot; Sex in a bedroom with a boyfriend on a quiet afternoon or evening is completely different from hot, wild, sport-sex on-camera for a video that's going to watched by countless people. It's a totally unrelated experience. Many girls who try their first hardcore scenes come on like bra-busters, assertive and bold. Many have hot sexual backgrounds and they know everything there is to know about sex. Huge-titted Bri is so incredibly shy, timid and reserved that it's actually amazing that she wanted to be an adult model in the first place. She's got the body, the huge, great boobs, and the attractive face. Her first videos and pictorials proved that she has the right assets for XLGirls. Now can Bri summon up the pluck to try her first on-camera sex scene? This is her secret sex fantasy and now it's a reality. To smoothly pop Bri's video virginity, an experienced seducer and pro-stud with finesse is needed. He'll carefully guide Bri along, step-by-step. Make her forget there is a man with a camera next to them and make his cock her world so he can rock hers. You could read a blow-by-blow here of what happens but Bri's seduction and the scorching sex that follows is something to see without advance information.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=43pe09wbbrjz0baljgj5.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=43pe09wbbrjz0baljgj5.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=8n8x3tv3hc8l6pb8jlgv.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=8n8x3tv3hc8l6pb8jlgv.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:c5779d3e7521173cc5d3adbbb7f317c20d2910ce","amp;dn":"%5BXLGirls%5D+Bri+Love+%28Young+Bra-Buster%27s+Secret+Sex+Fantasy+Cums+T","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5779d3e7521173cc5d3adbbb7f317c20d2910ce","infoHashBuffer":{"type":"Buffer","data":[197,119,157,62,117,33,23,60,197,211,173,187,183,243,23,194,13,41,16,206]},"announce":[],"urlList":[]}}