{"title":"Yootheme Square premium template (J2.5, J3.X)","uid":9211975,"size":18680749,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:c65b2ddf0e1c62d44ec47fd63f8979f4148fe4f5&amp;dn=Yootheme+Square+premium+template+%28J2.5%2C+J3.X%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":3,"time":1384803990,"description":"Get funky with Square, our November 2013 theme release. This fresh theme will shake up your company or business website with a powerful, clean design and vibrant colors. It comes with a variety of styles and backgrounds, making it a beautiful base for all kinds of web creations.\n\nSquare comes with tons of nifty little features. Check out the background scroll effect, which gradually changes your site's background color when scrolling down. Also a number of slick scale, fade and slide animations hit in when you scroll the page, adding a dynamic feel to it. Use panels to create a nice pricing table and present product features with beautiful UIkit icons. As a little goodie all images, like those in the slideshow, can be downloaded and used with the theme.\n\nBuilt on Warp7 and UIkit Square provides full support for LESS. You can easily create your own style with just a few clicks in the Customizer and change colors, spacing and fonts without having to write a single line of code. To get you started, Square already provides 8 different style variations to choose from.","torrent":{"xt":"urn:btih:c65b2ddf0e1c62d44ec47fd63f8979f4148fe4f5","amp;dn":"Yootheme+Square+premium+template+%28J2.5%2C+J3.X%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c65b2ddf0e1c62d44ec47fd63f8979f4148fe4f5","infoHashBuffer":{"type":"Buffer","data":[198,91,45,223,14,28,98,212,78,196,127,214,63,137,121,244,20,143,228,245]},"announce":[],"urlList":[]}}