{"title":"Rock And Roll Hall Of Fame Live (Box Set) 2010 DVD5","uid":10202445,"size":40832874496,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:c6813d9b112e24598d088b192752a95e78ec6d5b&amp;dn=Rock+And+Roll+Hall+Of+Fame+Live+%28Box+Set%29+2010+DVD5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"duncan5656","files":121,"time":1400796535,"description":"Rock And Roll Hall Of Fame Live (Box Set) 2010\n\nFor nearly a quarter century, the Rock and Roll Hall of Fame has honored music's most influential figures at prestigious black-tie events where performers and audience alike let down their hair. Rock &amp; Roll Hall Of Fame Live 9 DVD set captures all the excitement of those ceremonies, from the wise and witty speeches, to the most incredible combinations of talent ever assembled on a single stage. \n\n Rock &amp; Roll Hall Of Fame Live 9 DVD set from Time Life Music features rare, one-of-a-kind performances from the Rock and Roll Hall of Fame induction ceremonies, filmed over the past 24 years. The biggest names in rock 'n' roll perform in intimate settings, jamming in combinations not seen anywhere else. Plus, each DVD features exclusive, anything-goes induction speeches by rock royalty, along with rare behind-the-scenes footage. \n\n Some highlights include: \n\n Bruce Springsteen and Bono share a microphone on U2's &quot;I Still Haven't Found What I'm Looking For.&quot; \n\n The original three members of Cream take the stage for the first time in 25 years to play a three song set of the group's biggest hits. \n\n Mick Jagger and Tina Turner perform a sultry duet of the Stones' &quot;Honky Tonk Woman.&quot; \n\n Rock &amp; Roll Hall Of Fame Live 9 DVD set is brand new; it is unopened, unplayed and still in its original factory shrink-wrap. Witness rock history on 24 hours of pure magic.  \n\n","torrent":{"xt":"urn:btih:c6813d9b112e24598d088b192752a95e78ec6d5b","amp;dn":"Rock+And+Roll+Hall+Of+Fame+Live+%28Box+Set%29+2010+DVD5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6813d9b112e24598d088b192752a95e78ec6d5b","infoHashBuffer":{"type":"Buffer","data":[198,129,61,155,17,46,36,89,141,8,139,25,39,82,169,94,120,236,109,91]},"announce":[],"urlList":[]}}