{"title":"Aztec Ace (Eclipse)","uid":8830022,"size":214039296,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:c74e5cdb5c9c2a700514ae18617b075cfa116890&amp;dn=Aztec+Ace+%28Eclipse%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Ichthypod_Crane","files":15,"time":1376945207,"description":"Next up for the Eclipse Comics Upload Project (ECUP) is Aztec Ace. Wikipedia informs us:\n\nAztec Ace was a comic originally written by Doug Moench and pencilled by Dan Day. 15 issues appeared from 1984 to 1985. (The characters reappeared in the 1988 Total Eclipse comic series.) Other contributors to Aztec Ace were inker Nestor Redondo, inker Ron Harris, artist Mike Gustovich, artist Tom Yeates, colorist Philip DeWalt, colorist Steve Oliff, colorist Sam Parsons, letterer Carrie Spiegle, and Eclipse editor cat yronwode. The Aztec Ace logo was created by Denis McFarling.\n\nThe story revolved around a time traveller named Ace (real name: Caza), whose goal was to save the timestream from unraveling through various intricate adventures. Ace is from the 23rd Century, with his base in pre-contact Aztec Mexico; he often visited ancient Egypt. His main enemy is Nine-Crocodile, who creates time paradoxes in an attempt to save his own dimension at the expense of other realities, especially the modern world as we know it.\n\nCharacteristics of the series were time travel, the use of cultural icons such as political figures, historical situations, songs, and cult movies in unexpected situations, and philosophical musing. Historical renderings of ancient cultures were detailed and imaginative. Careful reading, broad knowledge, and patience were required of the reader, as well as some understanding of the ongoing storyline, all of which possibly prevented it from gathering a large following.\n\nThis torrent contains all 15 issues of the Eclipse series. Get it, seed it! Many thanks to the creators and scanners!\n","torrent":{"xt":"urn:btih:c74e5cdb5c9c2a700514ae18617b075cfa116890","amp;dn":"Aztec+Ace+%28Eclipse%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c74e5cdb5c9c2a700514ae18617b075cfa116890","infoHashBuffer":{"type":"Buffer","data":[199,78,92,219,92,156,42,112,5,20,174,24,97,123,7,92,250,17,104,144]},"announce":[],"urlList":[]}}