{"title":"Aaron Klein - The Manchurian President","uid":11788613,"size":309110274,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:c8bcc3ae3656ee88bde218fe485892d4dd02573c&amp;dn=Aaron+Klein+-+The+Manchurian+President&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":4,"uploader":null,"files":9,"time":1427845165,"description":"The book uncovers a far-leftist, anti-American nexus that has been instrumental in not only helping build Obama's political career but in securing his presidency. Klein details with shocking precision how this nexus continues to influence Obama and the White House and is involved in drafting policy aimed at reshaping our country.  \n\nAaron Klein has unmasked the most radical -- and therefore dangerous -- president by far this country has ever seen. The radical forces that shaped Obama, as revealed in this telling investigation, were not the best of the radical sixties, but the very worst -- the anti-American, communist-supporting, terrorist fringe. --David Horowitz, bestselling author\n\nAaron Klein apparently never received the J school memo to acquiesce to political power and to the utopian dream. The Manchurian President is a frightening yet vital primer for those now willing to look behind the curtain to see who is the leader of the free world. --Andrew Breitbart, bestselling author and Internet news entrepreneur","torrent":{"xt":"urn:btih:c8bcc3ae3656ee88bde218fe485892d4dd02573c","amp;dn":"Aaron+Klein+-+The+Manchurian+President","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8bcc3ae3656ee88bde218fe485892d4dd02573c","infoHashBuffer":{"type":"Buffer","data":[200,188,195,174,54,86,238,136,189,226,24,254,72,88,146,212,221,2,87,60]},"announce":[],"urlList":[]}}