{"title":"Reasonable.NoClone.2007.Enterprise.Edition.v4.1.17.0.rar","uid":4215372,"size":1787552,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c958b8d9254d62d47e8adcaa14ec8d067a41e72f&amp;dn=Reasonable.NoClone.2007.Enterprise.Edition.v4.1.17.0.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"luv2rip4","files":1,"time":1212312583,"description":"Find and Remove TRUE Duplicate files: You may not realize how many duplicate files you have after downloaded many files from the Internet or duplicate files scattered over your home or corporate network. Duplicate files are usually redundant and unnecessary, so keeping them is merely a waste of valuable hard disk space. Your hard drives may be full of documents, mp3, photos and video and many of them are redundant. NoClone finds and removes duplicate files regardless of file name. Time-saving Smart marker filters duplicates for removal or archival. ZDNet recommended her - Stop repeating yourself: Duplicate file finders. Customers include Boeing, California State Government, University of Memphis, WWF UK, and Disneyland Resort etc.\n\nFeatures:\n\n* True Byte-by-byte comparison , not by CRC / MD5, totally accurate. Why most accurate?\n* Search duplicate files contents and similar files regardless of file name\n* Search duplicate pictures (jpg, gif), video (avi, mpg), songs(mp3) , DLLs, Office documents(xls, doc, ppt, pub), pdf and any file types\n* Search duplicate Outlook emails (new 2007, v4.1)\n* Search files with same contents, same name.\n* Powerful fuzzy match to uncover similar files (new 2007, v4.1)\n* Smart marker of duplicate files by date, version, size, folder and file name pattern\n* Replace by NTFS hard link / shortcut (new v4.0)\n* Preview files, show file versions and properties\n* Save search session / Export result to CSV, XLS, XML format\n* Search local hard drives and over network - edition comparison\n\nBenefits:\n\n* Clean up hard disks, identify and recover wasted disk space\n* Reduce backup time and media used for backups,\n* Reduce file searching time, minimize time used to unneeded virus scanning\n* Obtain more free space on &quot;limited&quot; resources, like notebooks\n* Remove duplicate files to eliminate synchronization problem\n* Organize files neat and manage files better\n* Cheaper than buying a new hard drive, so don&amp;#039;t buy new hard drive, buy NoClone.\n\nSample applications: file management, storage management, document management, digital forensics and plagiary detection.","torrent":{"xt":"urn:btih:c958b8d9254d62d47e8adcaa14ec8d067a41e72f","amp;dn":"Reasonable.NoClone.2007.Enterprise.Edition.v4.1.17.0.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c958b8d9254d62d47e8adcaa14ec8d067a41e72f","infoHashBuffer":{"type":"Buffer","data":[201,88,184,217,37,77,98,212,126,138,220,170,20,236,141,6,122,65,231,47]},"announce":[],"urlList":[]}}