{"title":"AC/DC - We Made You: The Definitive Maximum Overdrive Soundtrack","uid":5769807,"size":392686171,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c9cc05ebad85960ff6a24fc3f7974157d38bf377&amp;dn=AC%2FDC+-+We+Made+You%3A+The+Definitive+Maximum+Overdrive+Soundtrack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rocknroll81","files":36,"time":1282055361,"description":"**Brand New August 2010**\n\nPiranha Studios Presents\n\nAC/DC\n\nWe Made You: The Definitive Maximum Overdrive Soundtrack\n\n\n01 Intro\n02 Who Made Who\n03 Chomp Chomp\n04 Star Castle\n05 Counter Attack\n06 Death City\n07 Chase The Ace\n08 The Comet\n09 D.T.\n10 King Of The Road\n11 Rock'n'Roll With Me\n12 Chomp Chomp\n13 Counter Attack\n14 Chase The Ace\n15 The Comet\n16 Ride Of The Valkyries\n17 D.T.\n18 The Comet\n19 Sink The Pink\n20 Ride On\n21 For Those About To Rock\n22 Help Me\n23 We Made You\n24 Counter Attack\n25 Hell's Bells\n26 The Comet\n27 Shake Your Foundations\n28 Counter Attack\n29 King Of The Road\n30 Bad Boy\n31 Chomp Chomp\n32 Who Made Who\n33 You Shook Me All Night Long\n34 Trailer\n\nTotal Time: 65:17\n\n\nSource 1: \nWho Made Who (Remastered Version) CD &gt; \nWAV &gt; CoolEdit Pro v2.0 (edits, crossfade splicing, etc.) &gt;\nNero Wav Editor v3.5.6.0 (fades, tracksplits, manual volume normalization, etc.) &gt;\nWAV &gt; FLAC Frontend v1.7.1 (level 8)\n\nSource 2: \nMaximum Overdrive DVD (AC3 2.0) &gt; Xilsoft DVD Ripper Ultimate v5.0.50 &gt;\nWAV &gt; CoolEdit Pro v2.0 (edits, crossfade splicing, etc.) &gt;\nNero Wav Editor v3.5.6.0 (fades, tracksplits, manual volume normalization, etc.) &gt;\nWAV &gt; FLAC Frontend v1.7.1 (level 8)\n\n\nEditor's Notes:\n  \n\tThis was a dream project.  Something that's been waiting in the wings for years.  It was a true labor of love.  The result is an absolute must have for any AC/DC fan.  \n\tThe movie Maximum Overdrive came out in 1986, when I was five years old.  I had a VHS copy that I watched almost every single day for a period that spanned a few years.  I believe that's the reason why as I grew into adulthood I became a huge fan of Stephen King, and a huge fan of AC/DC.  I am now an avid guitar player, and when I was 13 years old and I first picked up the instrument, one of the first things I played was Counter Attack.  Although I hadn't seen the movie since probably a couple years before that when I still had the VHS, it was just ingrained in my memory.  It's clear to me now that this music made an enormous impression on me at a young age, and it still influences me today.\n\tWhen I picked up the guitar and played that song, I did not know what it was called.  And I'm still not 100% sure.  I got the name &quot;Counter Attack&quot; from the &quot;Ultra Rare Trax&quot; bootleg.  They actually called it &quot;Contre Attack&quot;. That bootleg has four snippets of music lifted from this movie.  But, what you'll find here has all of that music in better quality, fully extended, plus a lot more.  I did, however, lift the four song titles they had, for the simple reason that I could not find these tunes labelled anywhere else whatsoever, and it might at least help collector's keep their songs straight.  I could not find any official record or notes about the titles of these individual pieces of the score.  So aside from the four titles I took from that bootleg, the rest of the untitled pieces of score I felt obligated name myself.  The names I used were all as functional and relative to the music and dialogue as possible.  For example, &quot;The Comet&quot; was a slow blues rock thing that was played whenever Billy and Brett had a romantic scene.  I almost just called it &quot;Billy and Brett's Love Theme&quot;, but then I realized that every time this music played, they weren't just sweet talking each other, they were looking at the comet.  And in most cases they were talking about it too, so it was just as much the comet's theme as it was theirs.  I do have a lot of experience naming tracks that are recorded spontaneously at my studio or come through my studio labelled &quot;untitled&quot;.  So I hope I did a good job here.  If anyone does have any evidence of any alternate versions of anything played on this movie score that I've looked over and includes an official name, please let me know so I can revise those titles.\n\tYou will notice there are a lot of tracks on this disc, and several songs are repeated, sometimes three or four times.  That is because I wanted this disc to flow the way the movie does, so I left everything in pretty much chronological order, and I think it sounds best that way.  Although one song will be repeated a few times throughout this disc, no two tracks are the same.  I tried to include as little amount of dialogue as possible, but with the movie being the only source for some of this music, there is some dialogue that had to be left in.  Overall, when it's all said and done, leaving the tracks in this order, with the dialougue on certain parts, not only does the music have a great natural flow to it, but the dialogue that is here flows chronologically as well, and it should really give you a sense of how the scenes in the movie flow.  Many of the tracks on this disc are purposefully and thoughtfully spliced back and forth between the unique way they sound on the film, and the way they sound on the original soundtrack album.  That soundtrack album, &quot;Who Made Who&quot;, unfortuantely did not include any of the amazing little pieces of original score the band added to the film.  It was always lacking to me; I always wished that these amazing pieces of instrumental score by AC/DC had been on the album.  I was very dissapointed when I first bought and listened to it.  I knew right away that this project needed to be done, and that's why I did it. \n\tPlease don't get me started on MP3s.  MP3s are destroying music and dis-evolving the human ear.  Rare music, especially should never be compressed lossy.  That should be a crime.  But besides all that, there's another very important reason this specific disc should not be converted to MP3 or anything else lossy.  That reason is, parts of this project were taken from the DVD, which besides the old VHS tapes was the only possible source.  And this audio which was only avaiable on the DVD was in AC3 format, which is slightly lossy to begin with.  And if you take a lossy source, and convert it to another lossy source, that's what we call transcoding, and that's very bad.  The end result is a fraction of a fraction of it's original quality.  So please, just don't do it.  I worked long and hard on this and I don't want anyone shitting on it.     \n\tSo enough with delving into the creative process, here it is, at long last: The Maximum Overdrive soundtrack album the way it was meant to be.  Download and Enjoy. Your feedback is appreciated.\nThank You\n-rocknroll piranha\n\n\nPlease buy a copy of this movie on DVD if you don't have it.  It is the greatest film ever made.\nAlso, if you haven't done so already, you should really go out and buy AC/DC's albums.\nMP3s are nowhere near the same quality as the real thing.\n\nIf you have any type of audio or video project you need help with,\nif you'd like to make a small paypal donation, \nor if you have any questions whatsoever\nthe email here is &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;463532342f28212b27212f252f2728063f272e29296825292b&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script data-cfhash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;data-cfhash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}t.parentNode.removeChild(t);}}catch(u){}}()/* ]]&gt; */&lt;/script&gt; .  Thank You.\n\nMusic by AC/DC.  Film by Stephen King.\nThis soundtrack edited and produced by Pat Brown (rocknroll) at Piranha Studios.\n\t \n\n####################### PLEASE DO NOT CONVERT TO MP3 #######################\n######################## OR ANY OTHER LOSSY FORMAT  ########################\n########################### DO NOT SELL THIS CD ############################\n\n\nFFP:\n01 Intro.flac:e5a338a27dd1d2940220eeebe0968d5a\n02 Who Made Who.flac:887f017d7cd638885f751e5488947fbd\n03 Chomp Chomp.flac:6ba9aa04d8886c05feb7e9cbb786a142\n04 Star Castle.flac:d06a3c8465161317f2e0b85df6789e59\n05 Counter Attack.flac:daec73749da7d5ae36de535830442ac4\n06 Death City.flac:f5c3f5ae0921df205037429dc39e42fe\n07 Chase The Ace.flac:8119d13ead290b74d6088b3e6534d1c0\n08 The Comet.flac:74f6cc5fa125d1a321548a4f6c2d3414\n09 D.T..flac:1b79e25b44cc25c9a518eda6796feadd\n10 King Of The Road.flac:c7e86f26f79c6c53efe87ca53ed8fa9e\n11 Rock'n'Roll With Me.flac:80b708d39945646a3faa0bbc85815552\n12 Chomp Chomp.flac:897f23a298e21b9e3a6e1e8d6f649c9e\n13 Counter Attack.flac:366f3bb61e0f944d2e1a1c98e6ada477\n14 Chase The Ace.flac:7f6762a87ea825ef609aafe13ed3b51b\n15 The Comet.flac:d506aca46edf3598603616ba0ba90a5b\n16 Ride Of The Valkyries.flac:a7a4175bc2459536534b2321e33efbb8\n17 D.T..flac:56d1049b173fc3a614dd2b1b14691346\n18 The Comet.flac:cce1a73850f1ed9fa715571153c5d6a8\n19 Sink The Pink.flac:4942213c0042bb87f54b70706be4791b\n20 Ride On.flac:a8c78d1e72fc420bed8d4c4cd5756b87\n21 For Those About To Rock.flac:e90b75906bd9a56c305a4950088962bc\n22 Help Me.flac:37d73a06f3554cb9b6129a8e92fabe5f\n23 We Made You.flac:bfd720b37957f75b2b22e1382c8b7dad\n24 Counter Attack.flac:e3a5fbd14667c7ab7cb38701ac551c64\n25 Hell's Bells.flac:d7f76e963f0dd50c5aa9cbdaaea66476\n26 The Comet.flac:a88c1fecd548184c6f604868266fc73b\n27 Shake Your Foundations.flac:d12efa6ca0dd0d1dd254ce7ce1c4a676\n28 Counter Attack.flac:48f04f7178ae457701eab09d49cb5c79\n29 King Of The Road.flac:e1ac59bad2c6fd2cd11f3cfd0bacbfde\n30 Bad Boy.flac:26cfd2386e2e0ffd021de8462ce617f1\n31 Chomp Chomp.flac:8f808310c8ac56a6d798473c149e97a8\n32 Who Made Who.flac:03036df300012d82e5f45550b53de6bb\n33 You Shook Me All Night Long.flac:0968417c0f7085e6bf4a2ce597aafaad\n34 Trailer.flac:0a8b75953a9b94ff50d34d36b8267b08\n\n","torrent":{"xt":"urn:btih:c9cc05ebad85960ff6a24fc3f7974157d38bf377","amp;dn":"AC%2FDC+-+We+Made+You%3A+The+Definitive+Maximum+Overdrive+Soundtrack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9cc05ebad85960ff6a24fc3f7974157d38bf377","infoHashBuffer":{"type":"Buffer","data":[201,204,5,235,173,133,150,15,246,162,79,195,247,151,65,87,211,139,243,119]},"announce":[],"urlList":[]}}