{"title":"ShareX v11.1.0","uid":15331402,"size":8696339,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ca0aae3e304a5486c2f19a00d9648e7dd8aef42a&amp;dn=ShareX+v11.1.0&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ZarkBit","files":2,"time":1468725965,"description":"ShareX v11.1.0\r\n\r\nChangelog - 2016-07-14\r\n\r\nRegion capture related changes:\r\nTab key or Mouse 4 button will swap between last region tool and last annotation tool\r\nRedesigned Task settings -&gt; Region capture tab to be more user friendly\r\nAll mouse actions (except left click) will be configurable from Task settings -&gt; Region capture that way you can get same behavior as old region capture; for example, right click to cancel capture\r\nRemoved AnnotationEnabled setting because you can now have full control on each mouse actions\r\nRegion capture will remember last used region tool and open with it selected\r\nLast used annotation tool will be also remembered so that way when you swap tools it will select last used annotation tool\r\nWhen drawing tool is selected cursor will show border color and size, this is also useful to know is current tool is region rectangle or drawing rectangle\r\nAllow drawing info text near cursor when magnifier is not enabled\r\nWhen creating region you can hold Ctrl key to change position of region\r\nWhen region is selected Ctrl key will move region instead of Shift for consistency with region create moving\r\nHolding Shift will increase region resize or move speed by 10px\r\nHolding Alt will allow to resize region from bottom right instead of top left\r\nMenu key will open options menu\r\nDouble clicking when multi region mode enabled won't close it when there is no region to be captured\r\nWhen creating region holding Alt key will more accurately and with better performance calculate close regions to snap\r\nAdded previous Region capture (Annotation) back as hotkey only which will be called as Region capture (Simple annotate) in hotkey settings\r\nAdded puush file uploader\r\nAdded Google Drive direct link option (by @mihe)\r\nAdded option to remember last drawing mode in Greenshot image editor settings window (by @campbeb)\r\nScale Greenshot image editor window size when icons are larger than default (by @campbeb)\r\nAdded option to maximize the Greenshot image editor window when it is larger than working area (by @campbeb)\r\nIn SFTP upload if file with same name is exist, truncate file before uploading\r\nAfter capture tasks -&gt; Show file in explorer and in other places where folder need to be opened with file, it will use already open Windows Explorer window instead of re opening new one (by @dannoe)\r\nHotkey settings and quick task menu reset to default buttons will ask for confirmation (by @dannoe)\r\nImplemented Dropbox API v2\r\nOption to use file extension for Hastebin syntax highlighting\r\n\r\nShareX - the Swiss Knife of the screenshot tools.\r\nVersion 11 has great changes, check the changelog link at the end of the description\r\n\r\n\r\nTake a screenshot or a screencast, have it uploaded and get the URL copied to your clipboard with a single hotkey.\r\n\r\nFree, open source, lightweight and free from advertisements!\r\n\r\nAdvanced screenshot capture, screen recorder, file sharing and productivity tool.\r\n\r\nVarious methods of capturing screenshots including full screen, window, monitor, region, freehand, scrolling, and more.\r\n\r\nCustomizable after capture tasks such as annotating, adding effects, watermarking, uploading, printing and other actions.\r\n\r\nUpload any files using configurable hotkeys, clipboard upload, drag &amp; drop or from the Windows Explorer context menu.\r\n\r\nSupports over 50 different image, text, and file hosting services such as Imgur, FTP, Dropbox, Pastebin etc. Also supports many URL shortening and sharing services.\r\n\r\nContains tools like a screen color picker, an image editor, a ruler, a DNS changer, a QR code generator, a directory indexer and more.\r\n\r\nUnlimited customizable workflows with hotkey specific settings.\r\n\r\nProgram that you can trust with over 8 years of active development.\r\n  \nhttps://getsharex.com/  \nhttps://github.com/ShareX/ShareX/wiki/Changelog","torrent":{"xt":"urn:btih:ca0aae3e304a5486c2f19a00d9648e7dd8aef42a","amp;dn":"ShareX+v11.1.0","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca0aae3e304a5486c2f19a00d9648e7dd8aef42a","infoHashBuffer":{"type":"Buffer","data":[202,10,174,62,48,74,84,134,194,241,154,0,217,100,142,125,216,174,244,42]},"announce":[],"urlList":[]}}