{"title":"Sniper Ghost Warrior 2 Update v1.03-P2P","uid":8253772,"size":34953341,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:cb5b1dc6c5e0bdd57674a83b109ba6c29b88e8ea&amp;dn=Sniper+Ghost+Warrior+2+Update+v1.03-P2P&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Gh0stNet","files":5,"time":1363211898,"description":"   Sniper Ghost Warrior 2 (c) City Interactive\n   Release Date 12-03-2013           \n   Game Type    Action                Image Format ISO                  \n   DISCS 1 DVD                        Protection Steam \n\n ******************************\n**     **RELEASE NOTES**       **\n ****************************** \n\nSniper Ghost Warrior 2 is the only multi-platform,  first-person,  modern\nshooter exclusively designed around the sniper experience.  It  takes  the\nbulls-eye precision of  its  predecessor  to  new  and  exciting  heights,\noffering more diverse sniper challenges;  a  rebuilt  AI  system  and  the\nthrilling &quot;one shot, one kill&quot; precision that made  the  original  a  huge\nhit, selling 3 million copies worldwide. Taking advantage of the  advanced\ncapabilities of the CryENGINE3, Sniper  Ghost  Warrior  2  also  delivers\nstriking graphic environments.\n\n\nFeatures\n\n* Motion Sense Trigger System an innovative first in which the way the\n  player touches the controller influences the on-screen shot. Like in\n  real-world sniping, in-game shooting requires a steady squeeze of the\n  pad's trigger so that when the round is fired, the rifle is more\n  accurate. Jerk the trigger and the round is thrown off, thus missing the\n  target and alerting a highly motivated enemy to your presence.\n* Realistic Ballistics the hallmark of the Sniper franchise is the\n  realism of its shooting dynamics. Wind speed, distance, gravity and\n  bullet-drop all play critical roles in the performance of your shot.\n* Refined Shooting Mechanics a proper breathing technique to steady your\n  heart rate is as important as calculating the time on target of your\n  round, and the best snipers control both their heart and their head.\n  From acquisition of target until the slow steady trigger pull, a sniper\n  must pull together everything to achieve the ideal &quot;one shot; one kill.&quot;\n* Improved Enemy AI the Artificial Intelligence (AI) system was\n  completely re-tooled and designed from scratch. Much of the improvements\n  were made possible from the switch to the CryEngine 3. Expect everything\n  from flanking movements to frontal assaults as the enemy tries to engage\n  you in close quarters where your rifle is less effective.\n* New Target-Rich Environments Sniper Ghost Warrior 2 adds new urban\n  environments like Sarajevo and treacherous mountain terrain to go along\n  with jungles that are as lush and deadly as ever.\n* Various Difficulty Levels To diversify gameplay and make it accessible\n  to the widest group of gamers, CI Games is introducing three difficulty\n  levels that totally change the nature of the game. You decide how to\n  play - either relax and be the ultimate predator or test your skill and\n  experience the game on Expert Mode.\n* Bullet-Cam everyone's favorite feature returns to reward expert shots\n  and show the battlefield from a totally new viewpoint. See what the\n  transfer of kinetic energy - a bullet's true stopping power - can do to\n  the enemy from 1000 meters or more!\n* Bullet Penetration concealment doesn't necessarily mean cover. In\n  Sniper Ghost Warrior 2, bullets behave as they would in real life and\n  are able to dispatch enemies hiding behind various types of covers. You\n  can also try to line up your enemies and let a single round take out an\n  entire squad. Wait 'til you see that on Bullet Cam!\n* Expanded List of Sniper Rifles Try out the world's most advanced sniper\n  rifles, each of them meticulously recreated so that they accurately\n  simulate the modern weaponry found on today's battlefields.\n* New Gear own the night with the introduction of thermal and night\n  vision optics, plus a pair of powerful binoculars critical for locating\n  the enemy before they spot you.\n\n\nChangeLog:-\n----------\n\nNo idea !\n\n ***************************** \n**   **Install Notes:**      **\n ***************************** \n-Copy all the files to the game dir,\n-Play and Enjoy\n\n ******************************** \n**   **Additional Notes:**      **\n ******************************** \n \nPatch is provided by sam2k8 (cs.rin.ru)\t","torrent":{"xt":"urn:btih:cb5b1dc6c5e0bdd57674a83b109ba6c29b88e8ea","amp;dn":"Sniper+Ghost+Warrior+2+Update+v1.03-P2P","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb5b1dc6c5e0bdd57674a83b109ba6c29b88e8ea","infoHashBuffer":{"type":"Buffer","data":[203,91,29,198,197,224,189,213,118,116,168,59,16,155,166,194,155,136,232,234]},"announce":[],"urlList":[]}}