{"title":"Dulce Pontes &amp; Ennio Morricone - Focus [EAC-FLAC]","uid":4186439,"size":358303496,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:cb6989d9755b3ec3a4949efca1806058fdceb131&amp;dn=Dulce+Pontes+%26+Ennio+Morricone+-+Focus+%5BEAC-FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"repopo","files":18,"time":1210701990,"description":"Let others speak... here you have Amazon UK reviews...\n\n\n\n5.0 out of 5 stars  Dont know enough words in English to describe it, 23 Oct 2003\nBy \tGoncalo (Estoril, Portugal)\n\nIn Japan they said Dulce Pontes ?sounds smoothly as a waterfall?. I was already very excited when I first saw this album, I simply could not believe I would listen the ingenious music of Ennio Morricone sang by Dulce Pontes beautiful voice. Then I played the cd and I was speechless. She scores sky high when singing the music from the movies ?The Mission? and ?Once upon a time in the west?. I didnt know that music I already loved could be made even better than in its original version. Extraordinary from the beginning to the end. I just love it.\n\n\n\n5.0 out of 5 stars  A voice that is poetry and a music that it&amp;#039;s its heart., 24 Oct 2003\nBy \tDUARTE (Portugal)\nDulce Pontes and Ennio Morricone offer us an extraordinary and unforgetable masterpiece.\nThis album holds the mistery of things that have never been said out loud. It urges us to share them with the ones we love, but also with the rest of the silent and intense universe that surround us.\nThe beauty of the voice of Dulce Pontes and the talent of Ennio Morricone are an echo that you can feel inside your heart.\nThis is real poetry and music about love and it is a fantastic experience for everyone - you will keep it inside yourself forever.\n\n\n5.0 out of 5 stars  A voice like no other!, 11 Nov 2003\nBy \tMusic Lover (United Kingdom)\nThis is the Portuguese &amp;#039;Queen of Fado&amp;#039; who set the Royal Albert Hall alight, billed simply as &amp;#039;Voice&amp;#039; in the programme that accompanied the sublime Maestro Morricone&amp;#039;s 75th Birthday Bash on 10 November 2003. And what a voice it is, with a range that startles and soothes in balanced measure.\n\nElements of that evening&amp;#039;s programme are represented on this disc, in an extension of Signor Morricone&amp;#039;s work that makes this an essential purchase for his legion of admirers around the world.\n\n\n5.0 out of 5 stars  Match Made In Heaven, 3 Feb 2004\nBy \tJ. N. Valente &quot;jnscav&quot; (Evora, Portugal) - (TOP 500 REVIEWER)      \nA perfect combination of Morricone&amp;#039;s epic compositions and Dulce Pontes&amp;#039; magnificent voice. A labour of love, a return to the purest forms of Morricone&amp;#039;s tracks supported by the poerful, almost indescribable voice of Dulce Pontes.\nA masterpiece in English, Portuguese, Italian and Castillian - 4 years in the making. Sublime!\n\n\n\nTracklist:\n\n1.\tCinema Paradiso\n2.\tRose Among Thorns\n3.\tRenascer\n4.\tNo Ano que Vem\n5.\tYour Love\n6.\tAmalia Por Amar\n7.\tNosso Mar\n8.\tAntica Palavra\n9.\tLuz Prodigiosa\n10.\tBallad of Sacco E Vanzetti\n11.\tSomeone You Once Knew\n12.\tVoo\n13.\tI Girasoli\n14.\tHouse of No Regrets\n15.\tBarco Abandonado","torrent":{"xt":"urn:btih:cb6989d9755b3ec3a4949efca1806058fdceb131","amp;dn":"Dulce+Pontes+%26+Ennio+Morricone+-+Focus+%5BEAC-FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb6989d9755b3ec3a4949efca1806058fdceb131","infoHashBuffer":{"type":"Buffer","data":[203,105,137,217,117,91,62,195,164,148,158,252,161,128,96,88,253,206,177,49]},"announce":[],"urlList":[]}}