{"title":"Learning JavaScript","uid":4736072,"size":10180030,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cba7f53778a8074a8f2766359596b5def723eb92&amp;dn=Learning+JavaScript&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"VasiaZozulia","files":-1,"time":1235294852,"description":"If you're new to JavaScript, or an experienced web developer looking to improve your skills, Learning JavaScript provides you with complete, no-nonsense coverage of this quirky yet essential language for web development. You'll learn everything from primitive data types to complex features, including JavaScript elements involved with Ajax and dynamic page effects. By the end of the book, you'll be able to work with even the most sophisticated libraries and web applications. \n\nComplete with best practices and examples of JavaScript use, this new edition shows you how to integrate the language with the browser environment, and how to practice proper coding techniques for standards-compliant websites. This book will help you: \n\nLearn the JavaScript application structure, including basic statements and control structures \nIdentify JavaScript objects -- String, Number, Boolean, Function, and more \nUse browser debugging tools and troubleshooting techniques \nUnderstand event handling, form events, and JavaScript applications with forms \nDevelop with the Browser Object Model, the Document Object Model, and custom objects you create \nLearn about browser cookies and more modern client-side storage techniques \nGet details for using XML or JSON with Ajax applications \nLearning JavaScript follows proven learning principles to help you absorb the concepts at an easy pace, so you'll learn how to create powerful and responsive applications in any browser.","torrent":{"xt":"urn:btih:cba7f53778a8074a8f2766359596b5def723eb92","amp;dn":"Learning+JavaScript","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cba7f53778a8074a8f2766359596b5def723eb92","infoHashBuffer":{"type":"Buffer","data":[203,167,245,55,120,168,7,74,143,39,102,53,149,150,181,222,247,35,235,146]},"announce":[],"urlList":[]}}