{"title":"Starcraft and Brood War Expansion (FULL GAME) (Highly Compressed","uid":5841486,"size":114055080,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:cbe49d25d734d334ea57ef851eb9af1578e61de8&amp;dn=Starcraft+and+Brood+War+Expansion+%28FULL+GAME%29+%28Highly+Compressed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"FuCtUpPuNk","files":5,"time":1284980106,"description":"StarCraft focuses around three distinct interstellar species: the psionic Protoss, the adaptable Terrans, and the insectoid Zerg. The game revolves around players collecting resources to construct a base, upgrade their militaries, and ultimately conquer opponents. Brood War\\'s gameplay remains fundamentally unchanged from that of StarCraft, although it introduces fine-tuning to unit costs and some abilities for strategic and balance purposes. These changes make rushing tactics a factor that gained some criticism in the original StarCraft less practical. The single-player campaign has an increased difficulty; missions are no longer entirely linear, and a greater focus on strategy is needed to complete missions. In addition, the game\\'s artificial intelligence (AI) has been augmented so that AI-controlled players are more intelligent and tends to use tactics more effectively.\n\nBrood War introduces seven new units. Each race is given access to a unique ground unit: the Zerg can create a defensive unit that can attack from the concealment of its burrow, while the Terrans can train combat medics. The Protoss are able to produce dark templar units, a powerful cloaked melee unit only given to the player in special missions of StarCraft. Protoss players can merge two of these units to create a special spellcaster unit. Each race is also given access to a dedicated air to air attack unit.\n\nINSTALLATION:\nExtract\nrun \\&quot;Install.exe\\&quot;\ngo to installed directory\nrun \\&quot;brood-c.exe\\&quot;\nthen run \\&quot;Brood.exe\\&quot; or \\&quot;StarCraft.exe\\&quot; depending on the game you want\nplay the game\n\nENJOY AND SEED!!!!\n\n\n\n\n-----------------------------------------------------------------------------------\nDon\\'t forget to snag a copy of my Land of the Dead torrent (you can play it online).\n\nDOWNLOAD ALL MY TORRENTS HERE:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/FuCtUpPuNk&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/FuCtUpPuNk&lt;/a&gt;","torrent":{"xt":"urn:btih:cbe49d25d734d334ea57ef851eb9af1578e61de8","amp;dn":"Starcraft+and+Brood+War+Expansion+%28FULL+GAME%29+%28Highly+Compressed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cbe49d25d734d334ea57ef851eb9af1578e61de8","infoHashBuffer":{"type":"Buffer","data":[203,228,157,37,215,52,211,52,234,87,239,133,30,185,175,21,120,230,29,232]},"announce":[],"urlList":[]}}