{"title":"Wanderlust - A Modern Yogi's Guide to Discovering Your Best Self","uid":14438988,"size":45711026,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cf1e673118c3d37945eb45cf55240ab782645818&amp;dn=Wanderlust+-+A+Modern+Yogi%27s+Guide+to+Discovering+Your+Best+Self&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gnv65","files":5,"time":1461663515,"description":"Wanderlust - A Modern Yogi's Guide to Discovering Your Best Self\r\nBy Jeff Krasno and Sarah Herrington\r\nRodale Books | May 2015 | eISBN 978-1-62336-351-2 | ePUB | 43.2 mb\r\n\r\nLike the wildly popular festivals that have taken the yoga world by storm, Wanderlust is a road map for the millions of people engaged in cultivating their best selves. For the 20 million people who grab their yoga mats in the United States every week, this book gives a completely unique way to understand &quot;yoga&quot;?not just as something to do in practice, but as a broader principle for living. Wanderlust helps readers navigate their personal path and find their own true north, curating principles that embody the brand and lifestyle?authentic yoga practices, provocative thinking, music, art, good food, eco-friendly activities, and more.\r\nEach chapter includes expert yoga instruction by renowned teachers; inspiring music playlists to motivate readers to practice; thought-provoking art; awesome recipes for delicious, healthy foods to sustain a yoga regimen; and fun, unexpected detours. This wide array of ideas and beautiful visuals is designed to be hyper-stimulating?whether a reader follows the arc of the book from beginning to end or dips into chapters at random, she is sure to find something pleasing to the eye, to feel motivated to practice, and to want to reach for her deepest desires and dreams. This book brings the Wanderlust festival experience into any reader's home.\r\n\r\nAbout the Author\r\nJeff Krasno is the cofounder of Wanderlust, a series of large-scale festivals combining yoga and wellness with the arts. The events span the globe from British Columbia to Australia, from California to Chile. Jeff serves as co-CEO, overseeing festival programming, business development, and Wanderlust¹s retail and media businesses. He is married to yoga teacher Schuyler Grant and is the proud father of three daughters. He lives in Williamsburg, Brooklyn.\r\n\r\nCONTENTS\r\nIntroduction\r\nCHAPTER 1 find your practice\r\nCHAPTER 2 find your direction\r\nCHAPTER 3 find your core\r\nCHAPTER 4 find your heart\r\nCHAPTER 5 find your community\r\nCHAPTER 6 find your creative spark\r\nCHAPTER 7 find your center\r\nCHAPTER 8 find your true north\r\nAcknowledgments\r\nGlossary\r\nContributors\r\nPhoto Credits\r\n \nhttps://s31.postimg.org/im679tu8b/Wanderlust_A_Modern_Yogi_s_Guide_to_Discoverin.jpg","torrent":{"xt":"urn:btih:cf1e673118c3d37945eb45cf55240ab782645818","amp;dn":"Wanderlust+-+A+Modern+Yogi%27s+Guide+to+Discovering+Your+Best+Self","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf1e673118c3d37945eb45cf55240ab782645818","infoHashBuffer":{"type":"Buffer","data":[207,30,103,49,24,195,211,121,69,235,69,207,85,36,10,183,130,100,88,24]},"announce":[],"urlList":[]}}