{"title":"Why Humans Like to Cry [Non-Fiction] PDF_(K-Slender)","uid":8979019,"size":1786178,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cf2a03e8575c0105f03c2d318f68017b2ba9499e&amp;dn=Why+Humans+Like+to+Cry+%5BNon-Fiction%5D+PDF_%28K-Slender%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"K-Slender","files":3,"time":1380512343,"description":"Publication Date: December 12, 2012 | ISBN-10: 0199693188 | ISBN-13: 978-0199693184 | Edition: 1\n\nHuman beings are the only species who cry for emotional reasons. We weep at tragedies both in our own lives and in the lives of others--remarkably, we even cry over fictional characters in film, opera, novels, and theatre. But why is weeping unique to humanity? What is different about the structure of our brains that sets us apart from all other animals? When on our evolutionary journey did we first recognize the tragedy of life? When did our early ancestors first cry?;In this fascinating volume, neurologist Michael Trimble offers a wide-ranging discussion of emotional crying, looking at its physiology as well as its evolutionary past. To shed light on why crying is uniquely human, Trimble offers an insightful account of the neuroanatomy of the human brain, highlighting differences from those of other primates, especially with regards to the representation of emotion and the circuitry related to the release of tears. He also looks at the epidemiology of crying (who cries, where, and when) and he discusses why people often feel good after crying and why we have developed art forms--most powerfully, music--that move us to tears. Throughout, Trimble weaves a discussion of Nietzsche's Birth of Tragedy exploring the origin of Tragedy as an art form, and using the images of Apollo and Dionysus as representative of biological and cognitive forces which are integral to the behavior and thinking of mankind. Finally, Trimble reveals that our emotional responses to tragedy--and crying for emotional reasons--have evolved over several millions of years. The insights found here shed much light on an enigmatic part of our humanity. The book offers a profound glimpse into the human heart as well as deep insight into the role of art in our emotional lives ","torrent":{"xt":"urn:btih:cf2a03e8575c0105f03c2d318f68017b2ba9499e","amp;dn":"Why+Humans+Like+to+Cry+%5BNon-Fiction%5D+PDF_%28K-Slender%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf2a03e8575c0105f03c2d318f68017b2ba9499e","infoHashBuffer":{"type":"Buffer","data":[207,42,3,232,87,92,1,5,240,60,45,49,143,104,1,123,43,169,73,158]},"announce":[],"urlList":[]}}