{"title":"The White Stripes - Fell in Love with a Girl [promo].VOB","uid":6027082,"size":92856320,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:cf59d5575137329d2bd0db1c2f86343403fd9375&amp;dn=The+White+Stripes+-+Fell+in+Love+with+a+Girl+%5Bpromo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1291961108,"description":"The White Stripes - Fell in Love with a Girl [promo].VOB\n\n\n\nHQ rare promo music video. &quot;Fell in Love with a Girl&quot; is a song by the American garage rock band The White Stripes, written and produced by Jack White for the band's third studio album, White Blood Cells (2001). Released as the album's second single in 2002, it reached number twenty-one on both the U.S. Bubbling Under Hot 100 Singles and the UK Singles Chart. \n\nThe April issue of Rolling Stone magazine listed the song as one of the forty songs that changed rock history.\n\nThis music video is a LEGO animation directed by Michel Gondry. Gondry's son was featured at the beginning of the video, building LEGO blocks. It was shot frame by frame with each frame having the LEGO bricks rebuilt, sometimes in a complex manner to seem as if it were an actual shot, and then formed together to give the illusion of motion. The video mostly consists of red, white, and black color. The White Stripes couldn't strike a deal with Lego, so they had to buy a large amount of LEGO boxes for the video.\n\nIn an interview for The Work of Director Michel Gondry DVD, Jack stated that the White Stripes' long-time collaboration with Michel Gondry started by accident; for &quot;Fell in Love with a Girl&quot;, Jack stated that he wanted to work with the director who did Beck's video for &quot;Devils Haircut&quot;, referring to Mark Romanek. Their record company mistakenly hired Gondry, thinking he was the director of &quot;Devils Haircut&quot;. Jack didn't mind, as he did the video for Beck's &quot;Deadweight&quot;, which Jack also liked.\n\nAlso revealed in The Work of Director Michel Gondry interview, The White Stripes contacted LEGO Group in hopes of having a small LEGO set packaged with each single of the record, with which one could build a LEGO version of Jack and Meg White. LEGO Group refused, saying: &quot;We don't market our product to people over the age of twelve.&quot; Once the video became a hit, however, LEGO contacted The White Stripes again and asked if they could reconstruct the deal to have LEGO packaged with the single. This time, however, Jack White refused, out of anger.\n\nThe &quot;The Work of Director Michel Gondry&quot; DVD also reveals that one section, lasting only a few seconds, used computer animation to simulate the LEGO bricks.\n\nThe video won three MTV Video Music Awards in 2002: Breakthrough Video, Best Special Effects, and Best Editing. It also received a nomination for Video of the Year, but lost out to Eminem's &quot;Without Me&quot;.\n\nPitchfork Media deemed it the best video of the decade. Entertainment Weekly included it on its end-of-the-decade, &quot;best-of&quot; list, saying, &quot;An idea so simple it's a wonder no one thought of it before 2002: rock &amp; roll Legos!&quot;\n(video does not have any logos) \n\n\n   &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Fell_in_Love_with_a_Girl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Fell_in_Love_with_a_Girl&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/gAbknaadE&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/gAbknaadE&lt;/a&gt; \n\n\n\nFile properties info using Media Player Classic:     \n   Video: MPEG2 Video 720x480 (4:3) 29.97fps 7800kbps\n   Audio: PCM 48000Hz stereo 1536kbps [DVD LPCM, 16 bit]\n   Duration: 00:01:55\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Just updated September 7, 2010!\n\n*Media Player Classic Home Cinema*      &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\nSgtRlee (Sgt.R.Lee) \n\n","torrent":{"xt":"urn:btih:cf59d5575137329d2bd0db1c2f86343403fd9375","amp;dn":"The+White+Stripes+-+Fell+in+Love+with+a+Girl+%5Bpromo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf59d5575137329d2bd0db1c2f86343403fd9375","infoHashBuffer":{"type":"Buffer","data":[207,89,213,87,81,55,50,157,43,208,219,28,47,134,52,52,3,253,147,117]},"announce":[],"urlList":[]}}