{"title":"Warlock.2.The.Exiled.Update.v2.1.143-RELOADED","uid":10161994,"size":1355277194,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:cfd98c2f44faf01efd6ca89b7cbac97e2c2dec15&amp;dn=Warlock.2.The.Exiled.Update.v2.1.143-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mr.Stifmeister","files":6,"time":1400308610,"description":" Warlock 2: The Exiled Update v2.1.143 (c) Paradox Interactive\n\n05/2014 : Release Date\nProtection : Steam\n- : Disc(s)\nGame Type : Strategy\n\nNote:\nNo other updates are required for this Release. Recent changelog here:\n\nv2.1.143:\nFixes:\n The quests &amp; triggers now work as they should (problem introduces\nin 2.1.142)\n Deleating a save game from the list no longer temporary deleates the game\nafter it in the list as well. The second save was never really lost, it\njust vanished from the list for a while.\nv2.1.142:\nFixes:\nFixed an issue where simultaneous quests sometimes got mixed up. This is\nfixed for new games but could persist in old saves.\nFixed an issue when a player could get &quot;stuck&quot; in &quot;Connecting to Lobby&quot;\nscreen in Multi player after entering email and password. The loading\ntime for the first connection to lobby is still long, but that is a one\ntime thing that is being looked at.\nFixed an issue where some troubled saved games could note be loaded.\nFixed an issue where the difficulty settings caused strange damage\nmodifications when fighting other players in multi player.\nFixed an issue where players could accidentaly enable the Fog of War\nwhile in editor, that would persist in his normal game mode afterwards.\nFixed so that the achievement &quot;Unity&quot; is enabled.\nFixed an issue where melee units could not attack cities with flying\nunits in them.\nv2.1.141:\nModding additions:\nGreat Mage perks are now moddable !\nFaction perks are now moddable !\n\nFixes:\nIn modding it is now possible to save units with settler action !\nLocalisation fixed in the quest &quot;Three questions&quot;\nSome fixes in the English localisation.\n\nThe worlds have been shattered, and you have been exiled to one of these\nshards. The time has come to return to Ardania and seek vengeance on those\nwho cast you out. Battle through the fractured realms inhabited by other\nexiles, hostile Mages and terrifying creatures. Once back in Ardania you will\nface your greatest threat: The United One and his four Vicars. Conquer all\nwho oppose you, reclaim your home and take your revenge.\nWarlock 2 is a turn-based strategy game of fantasy warfare. Rival against\nGreat Mages, lead mighty armies into fierce battles, wield ancient magic and\nfaith as your weapons.\nExperience the challenge in single or multiplayer. Play the new &quot;The Exiled&quot;\nmode or enjoy the game in the Sandbox mode.\n\nFeatures\n\nA fantasy wargame like no other A diplomatic victory is not an option, you\ncannot relax until your enemies lie crushed under the might of your strategic\nbrilliance! The turn-based hex maps gives you time to ponder your next move\nand your weapons are the vast armies that relentlessly march to conquer all\nthat oppose you.\nYou are the Great mage Select who you are from a roster of over a dozen\nGreat Mages, all with different abilities and spells, and choose which people\nyou command on your path to victory. If no Great Mage suits your taste you\ncan even custom build your own from scratch.\nProudly wield your magical power Not only a superb battlefield commander,\nyour immense magical powers will also aid you in your conquest. Carefully\nresearch over 170 spells and choose what to specialize in, from direct attack\nspells to terraforming, or maybe align yourself to one of the Gods to harness\ntheir powerful blessings. With time, you are even capable of customizing each\nspell using powerful glyphs.\nDiverse worlds requires different approaches The several different and\nrandomly generated maps all have their unique challenges and opposition to\ndefeat. Use the terrain to your advantage!\nDifferent campaigns Choose from either engaging your foes on a grand map\nin the sandbox game mode or the path of the Exiled, a revenge tale full of\ntwists and turns, where you strike back at those who banished you from the\nworld of Ardania.\nRaise armies The people you lead and conquer all bring their unique units\nto your command. Choose if you want to field a stalwart Human army, command\nthe Undead hordes, use the mysterious Planestriders, or mix and match them\nall plus others to your delight. There are a total of six different races to\npick from, each with their own strengths and weaknesses.\nHire heroes When your reputation grows, random heroes will be attracted to\nyour cause, bringing with them their own special flavor to add to battles.\nEquip them with legendary artifacts, found or crafted, and make them your\nbattlefield commanders.\n\n1. Unrar.\n2. Install the update to where you installed the game.\n3. Read .nfo","torrent":{"xt":"urn:btih:cfd98c2f44faf01efd6ca89b7cbac97e2c2dec15","amp;dn":"Warlock.2.The.Exiled.Update.v2.1.143-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cfd98c2f44faf01efd6ca89b7cbac97e2c2dec15","infoHashBuffer":{"type":"Buffer","data":[207,217,140,47,68,250,240,30,253,108,168,155,124,186,201,126,44,45,236,21]},"announce":[],"urlList":[]}}