{"title":"The Walking Dead 2x05 HDTV Spanish by tony","uid":6820939,"size":606326984,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d0d993b35aa3c977e93ef43b6c8689739d74dffb&amp;dn=The+Walking+Dead+2x05+HDTV+Spanish+by+tony&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"carambolas","files":3,"time":1321384788,"description":"Si quieres mas series, peliculas, juegos, etc... tanto por descarga directa como por torrent. visitanos:\n\n\nLa segunda temporada de The Walking Dead contarÃƒÂ¡ con un total de 13 episodios, cuyo rodaje se encuentra en marcha en Atlanta (Estados Unidos).\n\nBasada en el cÃƒÂ³mic homÃƒÂ³nimo creado por Robert Kirkman, The Walking Dead retomarÃƒÂ¡ esta temporada los personajes claves de esta historia de supervivencia, que ha logrado conquistar por igual a la crÃƒÂ­tica como a las audiencias de todo el mundo, un ÃƒÂ©xito que ha sentado precedente y que ha concentrado una enorme expectaciÃƒÂ³n alrededor del rodaje de los nuevos episodios.\n\nEntre las novedades ya anunciadas por el propio Robert Kirkman, en una entrevista exclusiva concedida al inicio del rodaje, la segunda temporada se alejarÃƒÂ¡ de los entornos urbanos para adentrarse mÃƒÂ¡s en el bosque, con mÃƒÂ¡s secuencias filmadas en carreteras comarcales y en campo abierto que mostrarÃƒÂ¡n lo dura que puede ser la situaciÃƒÂ³n de los protagonistas si estÃƒÂ¡n lejos de un centro urbano.\n\nOtro de los cambios respecto a la primera temporada es el nÃƒÂºmero de episodios. Si en la primera entrega tuvo sÃƒÂ³lo seis, en esta ocasiÃƒÂ³n la serie se extenderÃƒÂ¡ a 13 capÃƒÂ­tulos.\n\nAdemÃƒÂ¡s de Robert Kirkman como guionista, los nuevos episodios de The Walking Dead repiten el equipo creativo de su primera entrega: el realizador Frank Darabont (tres veces nominado al Oscar y autor, entre otras, de las pelÃƒÂ­culas Cadena perpetua y La Milla Verde) al frente del equipo creativo y responsable del guiÃƒÂ³n de la mayor parte de los nuevos episodios, y la veterana productora Gale Anne Hurd, una de las primeras mujeres al frente de pelÃƒÂ­culas de gran presupuesto en Hollywood como Terminator, Alien, Armageddon, El IncreÃƒÂ­ble Hulk.\n\nPor lo que respecta a los personajes, la segunda entrega de The Walking Dead nos reencontrarÃƒÂ¡ de nuevo con todos sus protagonistas, encabezados por Andrew Lincoln, de nuevo en la piel del sherifff Rick Grimes. AdemÃƒÂ¡s, Sarah Wayne Callies da vida a su mujer, Lori Grimes; Jon Bernthal encarna a Shane Walsh, policÃƒÂ­a y antiguo compaÃƒÂ±ero de patrulla de Grimes, que ademÃƒÂ¡s ha tenido una aventura con Lori cuando pensaban que Rick estaba muerto; Laurie Holden interpreta a Andrea, que ahora tiene que sobrevivir tras la pÃƒÂ©rdida de su hermana y, entre otros, Jeffrey DeMunn, un habitual de todas las pelÃƒÂ­culas de Frank Darabont, da vida a Dave Holberth, el mÃƒÂ¡s senior del grupo de supervivientes","torrent":{"xt":"urn:btih:d0d993b35aa3c977e93ef43b6c8689739d74dffb","amp;dn":"The+Walking+Dead+2x05+HDTV+Spanish+by+tony","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0d993b35aa3c977e93ef43b6c8689739d74dffb","infoHashBuffer":{"type":"Buffer","data":[208,217,147,179,90,163,201,119,233,62,244,59,108,134,137,115,157,116,223,251]},"announce":[],"urlList":[]}}