{"title":"Kiran Desai - Hullabaloo in the Guava Orchard (pdf)","uid":8693070,"size":1361918,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d19d0ced734ca2aa3dd6f48d4f6b35570adabd61&amp;dn=Kiran+Desai+-+Hullabaloo+in+the+Guava+Orchard+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pharmakate","files":-1,"time":1373916578,"description":"**by request**\n\n\n\nKiran Desai - Hullabaloo in the Guava Orchard (Atlantic Monthly Press, 1998). 209 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\n\nThe first novel by the author of The Inheritance of Loss, which won the Man Booker Prize in 2006.\n\ndescription:\n\nThis is the story of Sampath Chawla, born in a time of drought into a family not quite like other families, in a town not quite like other towns. After years of failure at school, failure at work, of spending his days dreaming in the tea stalls and singing to himself in the public gardens, it does not seem as if Sampath is going to amount to much. &quot;But the world is round&quot;, says his grandmother. &quot;Wait and see! Even if it appears he is going downhill, he will come out on the other side. Yes, on top of the world. He is just taking the longer route&quot;. No one believes her, until one day Sampath climbs a guava tree in search of peaceful contemplation and becomes unexpectedly famous as a holy man. In Hullabaloo in the Guava Orchard, Kiran Desai tells a wryly hilarious and poignant story of life, love, and family relationships, simultaneously capturing the vivid culture of the Indian subcontinent and the universal intricacies of human experience.\n\nReview\n\nPity the poor Chawla family of Shahkot, India--their son, Sampath causes all kinds of trouble for his family, culminating in a Hullabaloo in the Guava Orchard, but in a village like Shakhot, hullabaloo is a way of life. Indian writer Kiran Desai begins her first novel with Sampath's birth at the tail-end of a terrible drought. His mother, Kulfi, half-maddened by heat and hunger, can think of nothing but food: &quot;Her stomach grew larger. Her dreams of eating more extravagant. The house seemed to shrink. All about her the summer stretched white-hot into an infinite distance. Finally, in desperation for another landscape, she found a box of old crayons in the back of a cupboard and ... began to draw.... As her husband and mother-in-law retreated in horror, not daring to upset her or the baby still inside her, she drew a parade of cooks beheading goats.&quot; Sampath's father, Mr. Chawla is a man for whom &quot;oddness, like aches and pains, fits of tears and lethargy&quot; is a source of discomfort; he fears &quot;these uncontrollable, messy puddles of life, the sticky humanness of things.&quot; This distaste for sticky humanness will prove problematic for Mr. Chawla later in life when his son grows up to become a young man possessed of a great deal of feeling and very little common sense or ambition.\n\nMr. Chawla's frustration comes to a head when Sampath loses his menial job at the post office after performing an impromptu cross-dressing strip-tease at his boss's daughter's wedding. Confined to the house in disgrace, Sampath runs away from home and takes refuge in the branches of a guava tree in an abandoned orchard outside of town. At first family and townsfolk think he's mad, but in an inspired moment of self-preservation Sampath, who had spent his time in the post office reading other people's mail, reveals some choice secrets about his persecutors and convinces them that he is, in fact, clairvoyant. It isn't long before Mr. Chawla sees the commercial possibilities of having a holy man in the family, and pretty soon the guava orchard has become the latest stop along the spiritual tourism trail.\n\nTake one holy man in a guava tree, add a venal father, a food-obsessed mother and a younger sister in love with the Hungry Hop Kwality Ice Cream boy and you've got a recipe for delicious comedy. Mix in a rioting band of alcoholic monkeys, a journalist determined to expose Sampath as a fraud, an unholy trio of hypochondriac district medical officer, army general and university professor, all determined to solve the monkey problem, and you've got a real hullabaloo. Kiran Desai's delirious tale of love, faith, and family relationships is funny, smartly written, and reminiscent of other works by Indian authors writing in English such as Salman Rushdie's The Moor's Last Sigh, Banerjee Divakaruni's The Mistress of Spices and Shashi Tharoor's Show Business.\n","torrent":{"xt":"urn:btih:d19d0ced734ca2aa3dd6f48d4f6b35570adabd61","amp;dn":"Kiran+Desai+-+Hullabaloo+in+the+Guava+Orchard+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d19d0ced734ca2aa3dd6f48d4f6b35570adabd61","infoHashBuffer":{"type":"Buffer","data":[209,157,12,237,115,76,162,170,61,214,244,141,79,107,53,87,10,218,189,97]},"announce":[],"urlList":[]}}