{"title":"EnigmaT Set Rips { Cuts } - July 18th, 2013","uid":8705613,"size":1252282872,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d1c8c828f063fbc6d473fa8434cc1935e5ca7dc6&amp;dn=EnigmaT+Set+Rips+%7B+Cuts+%7D+-+July+18th%2C+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EnigmaT","files":149,"time":1374144877,"description":"Adam Seller - Strike Out (Setrise Remix) (Set Rip)-enTc.mp3\nAdam Szabo &amp; Willem De Roo -w- Johan Vilborg - Royal Blue (Set Rip)-enTc.mp3\nAicos - Follow The Light (Farzam's Uplifting Remix) (Cut From Angel Ace Set)-enTc.mp3\nAkira Kayosa &amp; Hugh Tolland - Kaipara (Cut From A&amp;F Set)-enTc.mp3\nAku &amp; Ghazaly - Together (Original Mix) (Cut From Sunny Lax Set)-enTc.mp3\nAlex M.O.R.P.H. - Bay of Bengal (Corti Organ Remix) (Cut From Pledger Set)-enTc.mp3\nAllen &amp; Envy - Always (Maria Healy Remix) (Set Rip)-enTc.mp3\nAltuna - Little Lonsdale (Cut From Altuna Set)-enTc.mp3\nAly &amp; Fila Vs Fady &amp; Mina - The Journey {FSOE 300 Anthem} (Cut From A&amp;F Set)-enTc.mp3\nAndres W - Icarus (Ewan Rill Remix) (Cut From Solid Stone Set)-enTc.mp3\nAndrew StetS - The Prayer (Cut From W&amp;W Set)-enTc.mp3\nAndy Duguid feat. Audrey Gallagher - In This Moment (Karanda Remix) (Set Rip)-enTc.mp3\nAndy Moor &amp; Ashley Wallbridge - World To Turn (The Madison Remix) (Set Rip)-enTc.mp3\nAneym &amp; Ferrin &amp; Morris - Right Through Me (Original Album Mix) (Cut From Karybde Set)-enTc.mp3\nAnton Flipp - Impulse (Original Mix) (Cut From Pobsky Set)-enTc.mp3\nAqua &amp; Arctic - Summer Spot (Cut From W&amp;W Set)-enTc.mp3\nARS - Upstairs (Original Mix) (Cut From Tommy Johnson Set)-enTc.mp3\nARS - Upstairs (Paul Miller Remix) (Cut From Angel Ace Set)-enTc.mp3\nAvicii vs. Nicky Romero - I Could Be The One (John Christian Remix) (Cut From Zygar Set)-enTc.mp3\nBastian Basic - Paradise (DJ Dean Remix) (Cut From Photographer Set)-enTc.mp3\nBastian Basic feat. Nijana - Castles In The Sky (Photographer Remix) (Cut From OzzyXPM Set)-enTc.mp3\nBedrock - Heaven Scent (Matt Lange Secret Booty) (ABGT 036 Rip)-enTc.mp3\nBisbetic &amp; Nathanael K - F22 Raptor (Cut From O'Neil Set)-enTc.mp3\nBlugazer feat. Catherine - Purpetual Quietus (Dub Mix) (Cut From Ronde Set)-enTc.mp3\nBrave feat. Reo Rae - Animal Instinct (Cut From Ronde Set)-enTc.mp3\nBT &amp; Aqualung - Surrounded (Original Mix) (Cut From W&amp;W Set)-enTc.mp3\nC-Systems &amp; Jaco feat. Hanna Finsen - Come Home (Cut From OzzyXPM Set)-enTc.mp3\nC-Systems feat. Hanna Finsen - Leading Destiny (Original Dub) (Cut From Santos Set)-enTc.mp3\nC-Systems feat. Hanna Finsen - Save The Moment (Part 2) (Original Mix) (Cut From GO Set)-enTc.mp3\nChaxxx - The Silence (Original Mix) (Cut From First Effect Set)-enTc.mp3\nChristian Drost - Space In Time (Original Mix) (Cut From Solarstone Set)-enTc.mp3\nClaus Backslash - Nassau (Cut From GO Set)-enTc.mp3\nCult 45 - Under The Sun (Carl Hanaghan Remix) (Cut From Juventa Set)-enTc.mp3\nDani L. Mebius &amp; Saint Liz - Manta (Cut From Vegas Set)-enTc.mp3\nDani L. Mebius &amp; Saint Liz - Manta (Cut From W&amp;W Set)-enTc.mp3\nDanny Avilla - Tronco (Cut From W&amp;W Set)-enTc.mp3\nDash Berlin &amp; Alexander Popov feat. Jonathan Mendelsohn - Steal You Away (Club Mix) (Cut From GO Set)-enTc.mp3\nDavid Surok - Ocean Trance (Original Mix) (Cut From Sty Set)-enTc.mp3\nDigital Horizon - Too Much (Cut From Pledger Set)-enTc.mp3\nDigital Horizon - Too Much (Original Mix) (Cut From Anderson Set)-enTc.mp3\nDigital Horizon- Too Much (Sean Mathews Remix) (Set Rip)-enTc.mp3\nDimitri Vegas &amp; Like Mike &amp; Coone feat. Lil Jon - Madness (Yves V Remix) (Cut From Vegas Set)-enTc.mp3\nDJ Sashay - Not Afraid (Original Mix) (Cut From Above Clouds Set)-enTc.mp3\nDJ Tangle &amp; DJ Mateusz - Omega (Set Rip)-enTc.mp3\nDreamy - Sapphire (Cut From A&amp;F Set)-enTc.mp3\nDreamy - Vangelis (Original Mix) (Cut From Above Clouds Set)-enTc.mp3\nDualitik - Alkalina (Slackers Project Remix) (Cut From Poshout Set)-enTc.mp3\nDuKa - Epic Injection (Cut From MORPH Set)-enTc.mp3\nDuncan MacPherson - Soul Destroyer (Time Axis Remix) (Cut From Saux Set)-enTc.mp3\nE-Bump - Much Your Face (Cut From Altuna Set)-enTc.mp3\nE.T Project - Endless Dreams (Haig &amp; Raffi Remix) (Cut From Angel Ace Set)-enTc.mp3\nEddie Lung - Coming Home (Original Mix) (Cut From tranzLift Set)-enTc.mp3\nEddie Lung - Road To You (Function C Remix) (Cut From Summerville Set)-enTc.mp3\nEhsun - Moonrise (Taylor Remix) (Cut From Tommy Johnson Set)-enTc.mp3\nEmilio Fernandez with DJ Feel - Diggin' This Feeling (Timothy Allan &amp; Mark Loverush Remix) (Cut From Sunny Lax Set)-enTc.mp3\nEmilio Fernandez with DJ Feel - Diggin' This Feeling (Timothy Allan &amp; Mark Loverush Remix) (Set Rip)-enTc.mp3\nEstiva &amp; Johan Vilborg - Mondays (Set Rip)-enTc.mp3\nFabio XB - UNTITLED (Mateusz Remix) (Set Rip)-enTc.mp3\nFlorence And The Machine - Cosmic Love (Seven Lions Remix) (Cut From Zygar Set)-enTc.mp3\nFon Leman - One Day (Prognai Remix) (Cut From Weikum Set)-enTc.mp3\nFunction C &amp; Luke Terry - Stratosphere (Original Mix) (Cut From Riel Set)-enTc.mp3\nGregori Klosman &amp; Bassjackers - Flag (Cut From W&amp;W Set)-enTc.mp3\nHoyaa - Fragile (Ahmed Romel Remix) (Cut From Angel Ace Set)-enTc.mp3\nIdo Liran - The New Day (Cut From O'Neil Set)-enTc.mp3\nIvan Gough &amp; Jebu - Kukatu (Cut From Vegas Set)-enTc.mp3\nIversoon &amp; Alex Daf - Dark Skies (Original Mix) (Cut From Pobsky Set)-enTc.mp3\nJacob van Hage - Hybrid (Cut From Ferry Set)-enTc.mp3\nJacob van Hage - Hybrid (Cut From Pledger Set)-enTc.mp3\nJayB - Pegasus (Daniel Kandi Remix) (Cut From Holland Set)-enTc.mp3\nJuventa - Move Into The Light (Cut From Tritonal Set)-enTc.mp3","torrent":{"xt":"urn:btih:d1c8c828f063fbc6d473fa8434cc1935e5ca7dc6","amp;dn":"EnigmaT+Set+Rips+%7B+Cuts+%7D+-+July+18th%2C+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1c8c828f063fbc6d473fa8434cc1935e5ca7dc6","infoHashBuffer":{"type":"Buffer","data":[209,200,200,40,240,99,251,198,212,115,250,132,52,204,25,53,229,202,125,198]},"announce":[],"urlList":[]}}