{"title":"World Snooker Championship 2005 [English][2CD]","uid":3316813,"size":1005833781,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d2410fff689dc7ffb6a9527df1ba9520f42f7a76&amp;dn=World+Snooker+Championship+2005+%5BEnglish%5D%5B2CD%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pctorrent","files":8,"time":1113504068,"description":"World Snooker Championship 2005Â® offers gamers the ultimate simulation of the beloved game. As you might expect, this game has all the big names, but this time there's simply a lot more than any snooker game gone before. More features, options, game modes and faces to make this the ultimate must have snooker title for any serious fan.\n\nGroundbreaking opponent AI and brand-new motion capture animations provided by Steve Davis offer a realistic look and feel to the proceedings. With over 100 professional Snooker players making it into World Snooker Championship 2005Â®, the game is brimming with snooker stars.\n\nMode wise players will enjoy a range of new options; additional competitions within the game include a &amp;quot;League of Champions&amp;quot; event that allows winners of the World Championship to pit their skills against former World Champions. Plus there are additional modes such as Bar Billiards and Snooker Plus.\n\n    * Includes top professionals from the current world of snooker, plus up and coming players,\n    * All real locations from the 2004 / 2005 tour have been accurately modelled, including the Preston Guild Hall, Wembley * Conference Centre and the legendary Crucible Theatre, home of the World Championships.\n    * Tournament structures are now modelled exactly on their real-life equivalents. Players can play in every event on the 2004 / 2005 tour - including the British Open, UK Championship, The Masters and the World Championship.\n    * Brand new &amp;quot;League of Champions&amp;quot; un-lockable mode that allows players (upon winning the world championship) to battle every major world champion since the tournament commenced in 1927.","torrent":{"xt":"urn:btih:d2410fff689dc7ffb6a9527df1ba9520f42f7a76","amp;dn":"World+Snooker+Championship+2005+%5BEnglish%5D%5B2CD%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d2410fff689dc7ffb6a9527df1ba9520f42f7a76","infoHashBuffer":{"type":"Buffer","data":[210,65,15,255,104,157,199,255,182,169,82,125,241,186,149,32,244,47,122,118]},"announce":[],"urlList":[]}}