{"title":"Terraria 1.2.3.1","uid":9662792,"size":49797278,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d25ed4ced5d4bc858201f0c0930a0b616e143dc1&amp;dn=Terraria+1.2.3.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"Hazzack","files":1,"time":1393319421,"description":"Version 1.2.3.1\n\nBalance Changes:\n\n\tSpectre Hood doesn't increase mana usage anymore.\n\tMade it slightly easier to advance in frostmoon waves.\n\tMade several frostmoon monsters shoot slower and do less damage.\n\n\nBug Fixes:\n\t\n\tFixed bug with a naked arm drawing over some vanity shirts.\n\tFixed bug where Autopause played bad with Chest renaming (and sign editing a bit).\n\tFixed bug where Brick Layer and Cement Mixer were not reducing stack quantities when placing items.\n\tFixed bug where prefixes were not getting set properly on a world load.\n\tFixed bug where coins would disappear during Quick Stack.\n\tFixed an exploit where you could duplicate coins with Quick Stack.\n\tFixed crashes when starting the dedicated server in a language other than English.\n\tFixed an issue where Team Dyes were causing crashes when used with Capes.\n\tFixed a bug where the map was drawing Fireblossom wrong.\t\n\tFixed a bug where the map was showing Water Candle as Band of Regeneration.\n\tFixed bug that was causing maps from older versions to erase.\n\tFixed a bug where Chests could not be placed on 2x1 tiles. There had to be a solid tile to the right of the chest to place it.\n\tFixed several typos.\n\tFixed bug where in-game options Map Control section wasn't blocking input like the regular controls.\n\tFixed bug where Hardcore characters couldn't open the menu after death.\n\tFixed bug where opening a chest with a sign open would lock the inventory.\n\tFixed bug where stylist had a hole in her selling list if you didn't meet a requirement.\n\tFixed bug where Magnet Sphere applied venom and Venom Staff did not.\n\tFixed the problem with the familiar wig and missing hair.\n\tAdded Butterfly Bottle recipes.\n\tFixed non-animating critter cages.\n\tDue to layering issues, you can no longer show a shield and a cloak at the same time.\n\tGemspark blocks now properly glow when dropped as items in the world.\n\tFixed bug where hidden accessories still applied their dye color (wings still apply it if hidden but in the air).\n\tYou can only equip one pair of wings at a time.\n\tFace accessories that shouldn't show hair no longer show hair.\n\tFixed the Cthulhu typos in game.\n\tMech bosses no longer spawn randomly if another boss is alive. You can still summon multiple bosses manually.\n\tHardmode bosses will no longer spawn if no player is above ground.\n\tFixed an issue where placing a bucket on a mannequin would eat it whole\n\tFixed workaround delay for placing things on mannequin starts using your items.\n\tThe travelling merchant can no longer spawn in lava.\n\tFixed problems with rescued NPCs not having any names.\n\tFixed the recipe for Super Mana Potions. They now correctly create 15 Super Mana Potions.\n\tFixed the Stylist name &quot;Esmeralda&quot; to not have a space at the end.\n\tPlatinum coins now stack to 999.\n\tFixed an issue where tiles might not update properly in multiplayer.\n\tFixed torches being able to be placed on wrong sides of slopes (that leaves them in air).\n\tFixed the problem with altars/pots/chests spawning in bugged conditions.\n\tFixed a bug with ice bricks not blending with snow blocks.\n\tFixed the Fairy Bell buff from breaking quick buff.\n\tChests should no longer lose their names in multiplayer.\n\tFixed bug where players would fall into tiles when walking into a ceiling with a mount.\n\tFixed bug where Cogs could be overwritten by another item in the Steampunker's shop.\n\tFixed bug where prefixes would be lost when you buy an item from the shop with right click.\n\tFixed bug where long hairs would draw the front part in the player's feet when in reverse gravity.\n\tFixed bug where palladium pickaxe and drill would say they can mine adamantium and titanium when that's no longer the case.\n\tArcane Rune Walls now count for housing.\n\tFixed bug that allowed mana hair to go pink when you armor that gives max mana.\n\tFixed bug where capes did not show properly when mounted.\n\tFixed issue where maps were not saving on some worlds.\n\tFixed bug where Blue Moon and Harpoon had invisible hit boxes near the player.\n\tFixed bug where frostburn wasn't applied in pvp when using flower of frost.\n\tFixed bug that allowed levers to be placed and immediately broken.\n\tFixed bug where queen/king statues didn't teleport stylist and travelling merchant respectively.\n\tFixed bug where painted tiles did not draw on the map properly.\n\tFixed bug where steampunk workbench was not craftable.\n\tFixed bug where you could have Fairy Bell and other light pets up simultaneously.\n\tFixed a few language issues pointed out on the forums.\n\tFixed a bug where Extendo Grip let you open chests that would instantly close again.\n","torrent":{"xt":"urn:btih:d25ed4ced5d4bc858201f0c0930a0b616e143dc1","amp;dn":"Terraria+1.2.3.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d25ed4ced5d4bc858201f0c0930a0b616e143dc1","infoHashBuffer":{"type":"Buffer","data":[210,94,212,206,213,212,188,133,130,1,240,192,147,10,11,97,110,20,61,193]},"announce":[],"urlList":[]}}