{"title":"BBEdit 11.5 [MAC OS X]","uid":13461321,"size":19736387,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:d304d6bbdc9481d43e349e116f67bdfa663459f9&amp;dn=BBEdit+11.5+%5BMAC+OS+X%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"iAlexander","files":1,"time":1454888443,"description":"MADE IN UKRAINE\r\n\r\nBBEdit 11.5 – Powerful text and HTML editor.\r\n\r\nBBEdit is the leading professional HTML and text editor for the Mac. Specifically crafted in response to the needs of Web authors and software developers, this award-winning product provides a plethora of features for editing, searching, and manipulation of text. BBEdit transforms text with high performance.\r\n\r\nWhat's new in version 11.5:\r\n- BBEdit now supports the use of iCloud Drive for sharing application support and setup items. This works similarly to the existing Dropbox support: in your &quot;iCloud Drive&quot; folder, create a folder named &quot;Application Support&quot;, and then within that create a folder named &quot;BBEdit&quot;. You can populate that folder with the contents of your /Users/USERNAME/Library/Application Support/BBEdit/ folder.\r\n- BBEdit now supports the use of iCloud Drive for a shared backup folder: in your &quot;iCloud Drive&quot; folder, create a folder named &quot;BBEdit Backups&quot;, and if you have turned on Use Historical Backups, BBEdit will use this folder.\r\n- There's a new settings group in the Appearance preferences: &quot;Sidebar&quot;. The controls here determine the default behavior of the files sidebar in editing, project, and Differences windows.There is a new folder-comparison option in the Find Differences dialog box: &quot;Only compare items in common&quot;. When you turn it on, BBEdit will only list items in the results that exist in both of the folders being compared. This option is also available to the scripting interface.\r\n- There is a new setting in the Text Colors preferences: &quot;Differences&quot;. This color setting determines how differences are highlighted in editing views when you select them in a Differences window. (The color for differences within a line is derived from this, by darkening or lightening as needed.) If a custom color scheme does not include a Differences color, BBEdit will use a dark gray or light gray (depending on the scheme's background color) instead.\r\n- Synchro Scrolling is now enabled (and on by default) for Differences windows: when turned on, scrolling either text view in the window will scroll the other one. Synchro Scrolling can be turned off for Differences windows; and if you would like it to be off for all new Differences windows, turn it off and then choose &quot;Save Default Differences Window&quot; from the Window menu.\r\n- Things that are highlighted in the text at various times (matches for selected text, Live Search results, spelling errors, and diffs) are now marked in the view's vertical scroll bar. The tick marks indicating matches for selected text may be turned off in the Editing preferences, if desired.\r\n- The GUI setting for extra space in text views, which was removed in 10.0, has been restored to the Editing preferences.\r\n- Did you know that you could set BBEdit up to use the Escape key to trigger completions? That's OK, nobody else did either. There's now a setting in the Keyboard preferences to enable this. Note that it works at cross purposes with both Emacs emulation and using the Escape key to exit full screen mode; that is, if you turn on Escape-key completion triggering, the Escape key will only work to trigger a completion, and will not function as either the Emacs meta key nor will it exit full-screen mode.\r\n- There is a new preference in the Keyboard preferences, subordinate to Emacs emulation: &quot;Enable meta sequences&quot;. This is off by default, so that the Escape key is not intercepted and can be used to exit full screen mode when running on OS X 10.10 or later. To restore the previous Emacs emulation behavior (in which command sequences beginning with a press of Escape can be used), turn this preference on, at the cost of not being able to use the Escape key to exit full screen mode.\r\n- Added control to the Editing preferences so that instances of the selected text may be highlighted if desired, rather than underlined.\r\n- The FTP/SFTP connection panel now has a Path field, so you can see the directory that will be set once the connection is completed.\r\n- The FTP/SFTP connection sheet now has an explicit field for specifying the port to use, if you want to connect to an alternate server port.\r\n- The &quot;Insert Folder Listing&quot; command now provides options to control whether the generated listing is hierarchical (the original style), or flat (which lists the full path of every item). The &quot;Include hidden items&quot; option is back after a long absence, as well. These settings are saved, and will apply when dragging a folder in to an editing view as well.\r\n- When piping data into the bbedit tool, you can now add a line number specifier, and the and the insertion point will be placed at the start of the indicated line in the resulting document.\r\n- Added a new command to the Edit menu: Start Speaking. This command will speak the selected text in the document; if there is no selection range it will speak the entire document. If the document is empty, this command is disabled. When speaking is in progress, this command reads &quot;Stop Speaking&quot; and will stop the in-progress speech.\r\n- Added new command to the Edit menu: &quot;Paste &amp; Match Indentation&quot;. When pasting text, this command will attempt to indent it to the same point as the line on which you're pasting (or if that line is empty, the most recent non-empty line). The factory default for this command is Cmd-Opt-Shift-V. You can change the keyboard equivalent using the Menus &amp; Shortcuts preferences.\r\n- Enabled {Copy, Save} as Styled {Text, HTML} for the edit fields in the Find and Multi-File Search windows, because why not.\r\n\r\nMADE IN UKRAINE","torrent":{"xt":"urn:btih:d304d6bbdc9481d43e349e116f67bdfa663459f9","amp;dn":"BBEdit+11.5+%5BMAC+OS+X%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d304d6bbdc9481d43e349e116f67bdfa663459f9","infoHashBuffer":{"type":"Buffer","data":[211,4,214,187,220,148,129,212,62,52,158,17,111,103,189,250,102,52,89,249]},"announce":[],"urlList":[]}}