{"title":"Enemy at the Gates","uid":4193096,"size":716306768,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d31ebaef7b1c197f4a28f8bc7817e4af7b7342c1&amp;dn=Enemy+at+the+Gates&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"JohnRGillespie","files":48,"time":1211066378,"description":"This video is dedicated to the people of Russia of whom I?ve had the pleasure of meeting a few in Europe. Thank you, and your parents for turning the war in Europe.\nThis movie is based on the book ?Enemy At The Gates? written by an axis solider who was present at the battle of Stalingrad, taken captive, and manage to survive the war. \n The Russian Sharpshooters rifle is on display at the Volgograd war museum today. Volgograd is also the home of the worlds largest war memorial. End of history lesson.  \n In the winter of 1942, the German and Russian Armies meet in the greatest battle of the 2nd  world war. The battle of Stalingrad, The most vicious engagements of the Second World War. Enter into this horror a young Russian soldier, formerly a peasant boy with an extraordinary ability to sharpshoot a rifle from a far distance. The Russian sniper soon gains fame after killing a record number of German officers causing the Germans to bring in their own expert sniper a war weathered Major who always accomplishes his mission no matter what the cost. With the Battle of Stalingrad raging around them, these two men now fight each other. This was the battle of Russia, not clean and in the air as the battle of Britten, but in the mud and blood that was Stalingrad. \n\n\nTitle: Enemy at the Gates\nRelease Date: 2001\nGenre: History, War, Drama, Romance\nRun Time:131 minutes\nLanguage: English\nRating: R\nIMDb: http://www.imdb.com/title/tt0215750/\nQuality: DVDRip\nSize: 696 MB\n","torrent":{"xt":"urn:btih:d31ebaef7b1c197f4a28f8bc7817e4af7b7342c1","amp;dn":"Enemy+at+the+Gates","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d31ebaef7b1c197f4a28f8bc7817e4af7b7342c1","infoHashBuffer":{"type":"Buffer","data":[211,30,186,239,123,28,25,127,74,40,248,188,120,23,228,175,123,115,66,193]},"announce":[],"urlList":[]}}