{"title":"Blacksea Odyssey","uid":14787149,"size":182953694,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d3460946ac5df66307777a143c69a5c33d791f62&amp;dn=Blacksea+Odyssey&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dauphong","files":1,"time":1465027583,"description":"Enter a vast chasm between space and time brimming with colossal creatures and runic technologies.\r\n\r\nOnce a decade, the greatest huntsmen in the universe gather to compete in a legendary tournament known as the Blacksea Odyssey. Steeped in blood, ancient treasures, and a madness that wills them to delve deeper into the black abyss, these huntsman compete for a chance to claim the ultimate glory of facing a creature of such insatiable ferocity and magnanimous size that its wingspan has been said to stretch across galaxies while it’s breath consumes black holes. A creature rumored to exist only in legend, the Titan of the Stars!\r\nFeatures\r\n\r\n    Rip Apart Enemies Piece by Piece: Eviscerate enemy creatures by ripping them apart with your harpoon.\r\n    Fully Destructible Everything: Blast through fully destructible environments with your spear or harpoon.\r\n    Twitch based Action-Packed Combat: Reminiscent of classic top-down shooters mixed with modern RPG and rogue-like mechanics.\r\n    Hardcore Rogue-like Elements: Featuring permadeath, procedural levels, and incredible replayability.\r\n    Massive Bosses: Battle against colossally scaled bosses dwarfing several screen sizes.\r\n    Expansive Customization System: Forge millions of runic modifications for your spear and space-board","torrent":{"xt":"urn:btih:d3460946ac5df66307777a143c69a5c33d791f62","amp;dn":"Blacksea+Odyssey","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d3460946ac5df66307777a143c69a5c33d791f62","infoHashBuffer":{"type":"Buffer","data":[211,70,9,70,172,93,246,99,7,119,122,20,60,105,165,195,61,121,31,98]},"announce":[],"urlList":[]}}