{"title":"Sue Brown - Various titles MM Romance","uid":11455821,"size":1694242560,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:d3925d22016fba2f91c5323f62ba71139b5169fe&amp;dn=Sue+Brown+-+Various+titles+MM+Romance&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"katelynor","files":11,"time":1415932364,"description":"Morning Report Series\n\n1 - Morning Report\nA decade on from their first kiss, Luke Murray is more in love with Simon every day. Running the Lost Cow ranch for Luke's parents, they keep their heads down and get along with the locals, even if Luke is known for being a hothead. Then one day they discover the local store owners refuse to serve them.\n\nThey're bewildered until Luke's mom tells them the new pastor has targeted the couple in his sermons. Suddenly Luke and Simon find themselves alienated from people they called friends, and their ranch comes under a series of attacks. As the town's hatred and homophobia turns on them, Luke and Simon will face a critical choice: give in to the town's demands and disappear, or stand and fight for themselves and their love.\n\n2 - Complete Faith\n3 - Papa's Boy\n4 - Luke's Present\n\nIsle of ...\n\nIsle of ... Where?\nWhen Liam Marshall's best friend, Alex, loses his fight with colon cancer, he leaves Liam one final request: buy a ticket to Ryde, on the Isle of Wight, and scatter Alex's ashes off the pier. Liam is tired, worn out, and in desperate need of a vacation, but instead of sun, sea, sand, and hot cabana boys, he gets a rickety old train, revolting kids, and no Ewan MacGregor.\n\nLiam would have done anything for his friend, but fulfilling Alex's final wish means letting go off the only family Liam had left. Lost, he freezes on the pier...until Sam Owens comes to his rescue.\n\nSam's family has vacationed on the Isle of Wight every year for as long as he can remember, but he's never met anyone like Liam. Determined to make Liam's vacation one to remember, Sam looks after him-in and out of the bedroom. He even introduces Liam to his entire family. But as Sam helps Liam let go, he's forced to admit that he wants Liam to hang on - not to his old life, but to Sam and what they have together.\n\n02 Isle of Wishes\n03 Isle of Waves\n\nStand Alones\n\nFrankie &amp; Al\nNothing Ever Happens\nFinal Admission\n\nI really enjoyed the Morning Report Series - some *hot* scenes in them. Some of the others I am less fond of, but over all I like her stuff.\n\nPlease seed and enjoy!","torrent":{"xt":"urn:btih:d3925d22016fba2f91c5323f62ba71139b5169fe","amp;dn":"Sue+Brown+-+Various+titles+MM+Romance","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d3925d22016fba2f91c5323f62ba71139b5169fe","infoHashBuffer":{"type":"Buffer","data":[211,146,93,34,1,111,186,47,145,197,50,63,98,186,113,19,155,81,105,254]},"announce":[],"urlList":[]}}