{"title":"Visual Thinking in Mathematics {BBS}","uid":6963530,"size":3201284,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d4043a165eebe16f7e5b123aeed5d43ed9056eee&amp;dn=Visual+Thinking+in+Mathematics+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1326841137,"description":"___________________________________________________________________________\n    ____                   ____                            __              \n    /   )    ,             /   )    /                    /    )            \n---/__ /---------__-------/__ /----/-----------__--------\\--------__----__-\n  /    )   /   /   )     /    )   /   /   /  /___)        \\     /___) /   )\n_/____/___/___(___/_____/____/___/___(___(__(___ _____(____/___(___ _(___(_\n                 /                                                         \n             (_ /                                                          \n\n****************************************************************************\n\nVisual thinking - visual imagination or perception of diagrams and symbol arrays, and mental operations on them - is omnipresent in mathematics. Is this visual thinking merely a psychological aid, facilitating grasp of what is gathered by other means? Or does it also have epistemological functions, as a means of discovery, understanding, and even proof? By examining the many kinds of visual representation in mathematics and the diverse ways in which they are used, Marcus Giaquinto argues that visual thinking in mathematics is rarely just a superfluous aid; it usually has epistemological value, often as a means of discovery. Drawing from philosophical work on the nature of concepts and from empirical studies of visual perception, mental imagery, and numerical cognition, Giaquinto explores a major source of our grasp of mathematics, using examples from basic geometry, arithmetic, algebra, and real analysis. He shows how we can discern abstract general truths by means of specific images, how synthetic a priori knowledge is possible, and how visual means can help us grasp abstract structures.\n\nVisual Thinking in Mathematics reopens the investigation of earlier thinkers from Plato to Kant into the nature and epistemology of an individual's basic mathematical beliefs and abilities, in the new light shed by the maturing cognitive sciences. Clear and concise throughout, it will appeal to scholars and students of philosophy, mathematics, and psychology, as well as anyone with an interest in mathematical thinking.\n\n\n# Paperback: 304 pages\n# Publisher: Oxford University Press, USA; Reprint edition (November 14, 2011)\n# Language: English\n# ISBN-10: 0199575533\n# ISBN-13: 978-0199575534","torrent":{"xt":"urn:btih:d4043a165eebe16f7e5b123aeed5d43ed9056eee","amp;dn":"Visual+Thinking+in+Mathematics+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d4043a165eebe16f7e5b123aeed5d43ed9056eee","infoHashBuffer":{"type":"Buffer","data":[212,4,58,22,94,235,225,111,126,91,18,58,238,213,212,62,217,5,110,238]},"announce":[],"urlList":[]}}