{"title":"Final Fantasy [Saga Completa] [PC] [Spanish] ","uid":4048457,"size":4593474026,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d436556e2d6e79fe135e3ff57bd1f8ae2ea4f836&amp;dn=Final+Fantasy+%5BSaga+Completa%5D+%5BPC%5D+%5BSpanish%5D+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"spatorrent","files":4,"time":1204043186,"description":"Este es un DVD que contiene casi la saga completa de los juegos de Final Fantasy\n\nRequerimientos Minimos:\nPentium II en Adelante\n64 MB RAM\nDirectX 6 o Superior\nWindows 98, Me, 2000, Xp\n\nDescripciÃƒÂ³n:\nFinal Fantasy:\nLa Tierra se esta muriendo y la gente espera el cumplimiento de una profecÃƒ*a, cuatro guerreros llegaran para renovar el mundo, estos son los Caballeros de la Luz. Cuatro Bestias, cada una encarnando la forma de los elementos, estÃƒÂ¡n detrÃƒÂ¡s del decaimiento de la Tierra. Y detrÃƒÂ¡s de estos Cuatro Bestias esta el Caos.\n\nFinal Fantasy II:\nEl Imperio Barmekia mata a las familias de cuatro jÃƒÂ³venes. Estos, espoleados por el terrible suceso, deciden unirse a la resistencia de Queen Hilda (el ÃƒÂºnico obstÃƒÂ¡culo para que Barmekia controle el mundo) para ayudar en todo lo posible a que los malvados propositos del imperio no se cumplan. Conforme avanza el juego van adquiriendo mas poder y son capaces de enfrentarse al mal que acecha al mundo. El enemigo final no es el Imperio, sino algo que hay detrÃƒÂ¡s de todo ello, El Dark Cloud.\n\nFinal Fantasy III:\nCuatro jÃƒÂ³venes de la villa de Uru descubren un Cristal en una cueva a las afueras de su pueblo que les dice que ellos han sido los elegidos para ser los Cuatro Guerreros de la Luz con el fin de restaurar el equilibrio en la Oscuridad y la Luz ya que el mundo se enfrenta a la destrucciÃƒÂ³n total. Tras dejar atrÃƒÂ¡s su continente flotante descubren que la mayor parte del mundo esta cubierta de agua y con la ayuda de Elia y algunos mas consiguen que el agua retroceda. Al parecer todos los males del mundo provienen de la &quot;Crystal Tower&quot;, donde se encuentra un poderoso mago, Zande, poseÃƒ*do por la oscuridad. DespuÃƒÂ©s de vencer a Zande los guerreros se topan con una gran Darkness Cloud y llegan al mundo oscuro donde se batirÃƒÂ¡n contra sus sombras, los Dark Warriors y la Darkness Cloud para restaurar la paz y el equilibrio en el mundo.\n\nFinal Fantasy IV:\nCecil, capitÃƒÂ¡n de la ÃƒÂ©lite Redwings, dimite de su posiciÃƒÂ³n por remordimientos de conciencia. Sus viajes le traerÃƒÂ¡n muchos amigos... y aÃƒÂºn mÃƒÂ¡s enemigos. Pronto, cruza los caminos con Golbez, el lÃƒ*der de los esfuerzos del Imperio para recolectar los cristales. Cecil descubre su luz interior y se convierte en paladin.\n\nFinal Fantasy V:\nEl planeta recibe el impacto de meteoritos y ademÃƒÂ¡s esta teniendo problemas en su interior. Un aventurero, una princesa, una mujer pirata y un anciano investigan la rotura de los cristales elementales. DespuÃƒÂ©s de varias pistas falsas, descubren que los meteoritos estÃƒÂ¡n llegando desde otro mundo. Finalmente, consiguen llegar al otro mundo donde encuentran a X-Death y a su secuaz Gilgamesh. El grupo se reÃƒÂºne con los Four Braves of the Dawn, quienes treinta aÃƒÂ±os antes habÃƒ*an encerrado a X-Death en un ÃƒÂ¡rbol con un hechizo, pero habÃƒ*a sido insuficiente para mantenerle alli.\n\nFinal Fantasy VI:\nMiles de aÃƒÂ±os atrÃƒÂ¡s, convivÃƒ*an en un mismo mundo dos razas: los humanos y los Espers, seres dotados de grandes poderes mÃƒÂ¡gicos, pues su propia esencia tenÃƒ*a origen en la magia. Pero la ambiciÃƒÂ³n de los humanos, que codiciaban los poderes de los Espers, llevÃƒÂ³ a ambas razas a enfrentarse en una sangrienta e infructuosa guerra, conocida en la actualidad como La guerra Magi, en la que no hubo vencedores ni vencidos, sino simplemente inmensas pÃƒÂ©rdidas en ambos bandos. Los Espers, que anhelaban la paz, se recluyeron en una dimensiÃƒÂ³n distinta y sellaron la entrada.\n\nFinal Fantasy VII:\nLa corporaciÃƒÂ³n Shinra esta agotando los recursos vitales de nuestro planeta, la energÃƒ*a Mako. Nadie parece poder pararles ya que el gobierno es una simple marioneta en manos de Shinra (incluso tienen un grupo militar llamado SOLDADO) y los ciudadanos de a pie estÃƒÂ¡n convencidos que usar la energÃƒ*a Mako es lo mejor para ellos sin darse cuenta de las repercusiones negativas que esto causa al plante ya que estan agotando los recursos vitales con ese despilfarro de energia.\n\nCloud, un mercenario despiadado y cruel sin pasado, ex-miembro de Soldado, acepta unirse al grupo de ecoguerreros (Avalancha) que estÃƒÂ¡n intentado evitar este robo energÃƒÂ©tico al planeta. En Midgar conocen a Aerith, una florista que cambiara la vida del grupo y que parece tener alguna conexiÃƒÂ³n con los Cetra (para mas informaciÃƒÂ³n sobre los Cetra, ver secciÃƒÂ³n de Shephirot). Tras escapar de Midgar (medio Shinra esta detrÃƒÂ¡s de ellos despuÃƒÂ©s de haber hecho explotar un reactor en la ciudad y otras cosas similares), Avalancha descubre que hay problemas mas grandes para el mundo que los planes de la monopolizadora compaÃƒÂ±Ãƒ*a; el ciclo de la vida puede ser interrumpido debido a la extracciÃƒÂ³n de energÃƒ*a Mako.\n\nPor si fuera poco, Sephiroth, antiguo miembro de Soldado, ha sido visto cuando todo el mundo creÃƒ*a que habÃƒ*a muerto en Nibleheim cinco aÃƒÂ±os atrÃƒÂ¡s. Que esta pasando?? Donde ha estado Sephiroth todo este tiempo?? No habÃƒ*a muerto?? En la persecuciÃƒÂ³n de Shinra y Avalancha tras Sephiroth, suceden muchas cosas (algunas muy tristes, Aeris) hasta que finalmente le encuentran tras invocar al meteorito que amenaza con la destrucciÃƒÂ³n de la tierra, la cual viendo el peligro despliega unas &quot;Armas&quot; gigantescas para protegerse.\n\nFinal Fantasy VIII:\nGalbadia, Balamb y los demÃƒÂ¡s paÃƒ*ses han vivido en paz durante cerca de dos dÃƒÂ©cadas. En este tiempo, los tres Jardines del planeta (una especie de academias militares) han entrenado con ÃƒÂ©xito a varias generaciones de mercenarios de elite llamados SeeDs que son contratados en diferentes regiones para proteger a las comunidades mas dÃƒÂ©biles.\n\nSquall Leonhart, estudiante del JardÃƒ*n de Balamb, esta ante su ultimo examen en el que se convertirÃƒÂ¡ en SeeD de pleno derecho cuando se declara la guerra. Galbadia, dirigida por una bruja malvada llamada Edea y que esta controlando al presidente del paÃƒ*s, esta invadiendo poblaciones vecinas y amenazando a sus habitantes con extender su rÃƒÂ©gimen a todo el mundo.\n\nTras intentar asesinar a la bruja sin mucho ÃƒÂ©xito, se va descubriendo una amenaza mucho mayor: Edea no deja de ser un tÃƒ*tere a la que Ultimecia/Artemisa (otra bruja) esta controlando desde el futuro para traer el caos al mundo y asÃƒ* poder alcanzar sus planes mas fÃƒÂ¡cilmente... La compresiÃƒÂ³n del tiempo nos acecha.\n\nFinal Fantasy IX:\nNos encontramos en Gaia, un mundo donde cuatro naciones distintas gobiernan diferentes zonas del Continente de la Niebla. El reino de Alexandria, que obecede las ordenes de la maquiavÃƒÂ©lica reina Brahne, ha comenzado a realizar distintos movimientos para lograr un objetivo: hacerse con el poder absoluto. Pero una compaÃƒÂ±Ãƒ*a de actores de Lindblum llamada Tantalus, decide secuestrar a Garnet von Alexandros, la hija de su majestad Brahne, como rehÃƒÂ©n para que asÃƒ* la reina se detenga. Pero la princesa desde el momento en que conoce a Zidane y sus compaÃƒÂ±eros no opone resistencia alguna al secuestro, incluso colabora con ellos. Un poco confundidos por el comportamiento de la preciosa joven, ponen en marcha un descabellado plan para huir de Brahne y llegar cuanto antes a Lindblum, donde les espera el regente de aquel reino para prestarles ayuda: Cid.\n\nDurante el viaje, Zidane y los demÃƒÂ¡s descubren que las amenazas de la reina no son mÃƒÂ¡s que una mera tapadera para incubrir un complot aÃƒÂºn mÃƒÂ¡s siniestro y diÃƒÂ¡bolico. Por el bien de la humanidad, nuestro grupo de hÃƒÂ©roes deberÃƒÂ¡ enfrentarse a todos aquellos peligros que se interpongan en su camino derrotando a todas las fuerzas del mal para que el equilibrio en Gaia pueda restablecerse.\n\nFinal Fantasy Tactics:\nRamza es el personaje principal del Final Fantasy Tactics. Es, ademÃƒÂ¡s el heroe de la Guerra de los cincuenta aÃƒÂ±os. Es el menor de cinco hermanos, Balbanes Beoulve, Dycedarg Beoulve, Zalbag Beoulve, y Alma Beoulve.\n\nA raiz del secuestro de su hermana, Ramza decidiÃƒÂ³ buscarla e intentar poner todo su empeÃƒÂ±o para terminar con la guerra que asolaba el pais, la Lion War.\n\nFinal Fantasy Adventure:\nEl ÃƒÂ¡rbol de Mana que esta en la cima de las nubes en el monte Illusia. Se preve que este ÃƒÂ¡rbol da energÃƒ*a inmensa a cualquier persona que la toque. Una vez que, Vandole intentara utilizar esta energÃƒ*a para el mal. Aunque llego a tocar con sus manos el ÃƒÂ¡rbol, los caballeros del brote podÃƒ*an suprimirlas. Los caballeros del brote son los protectores del ÃƒÂ¡rbol de Mana y la familia de Mana asÃƒ* como para el mundo entero. Ahora, un imperio nuevo lo fija meta en conseguir la energÃƒ*a del ÃƒÂ¡rbol de Mana. Una vez mÃƒÂ¡s ser utilizado para los propÃƒÂ³sitos malvados. EstÃƒÂ¡ hasta nuestro hÃƒÂ©roe a luchar para proteger el ÃƒÂ¡rbol de Mana y el mundo.\n\nFinal Fantasy Legend 2:\nEn este juego, el jugador visita doce mundos distintos, ademÃƒÂ¡s del mundo celestial y de la capilla en su centro. La meta del juego es recoger a los pedazos variados de UNOS DE LOS REYES MAGOS dispersados alrededor de los diversos mundos que son fragmentos de una estatua del IS-IS de la diosa. Estos pedazos de UNOS DE LOS REYES MAGOS se pueden tambiÃƒÂ©n equipar por tus caracteres para aumentar el stats o para conceder capacidades especiales.\n\nFinal Fantasy Mystic Quest:\nUn muchacho joven es atacado por los monstruos, pero un hombre flotante misterioso te ayuda a defenderse. Este muchacho joven, Benjamin, entonces sale en una bÃƒÂºsqueda para recuperar los cristales que fueron robados por criaturas malvadas esto te traerÃƒÂ¡ amigos cercanos y enemigos mortales. Ãƒ?l harÃƒÂ¡ frente a desafÃƒ*o tras desafÃƒ*o antes de venir cara a cara con el ÃƒÂºltimo mal.\n\nFinal Fantasy Tactics Advance:\nLa historia empieza cuando Marche y sus amigos, Mewt y Ritz, abren un misterioso libro y su mundo se transforma en el reino fantastico de Ivalice. Para que todo vuelva a la normalidad, Marche debe unirse a un clan y enfundarse la espada, aprender magia y salir victorioso de un monton de batallas tacticas. Y, por ultimo, desentrancar el misterio de los cristales, esas piedras magicas que son la clave para restaurar la paz. Dirige a una tropa de guerreros, magos y monstruos y crea un plan de ataque capaz de vencer al enemigo. Con un sistema de lucha inventado por el primer Final Fantasy, tendras que derrotarlos usando armas, objetos magicos y llamando a tus monstruos aliados.","torrent":{"xt":"urn:btih:d436556e2d6e79fe135e3ff57bd1f8ae2ea4f836","amp;dn":"Final+Fantasy+%5BSaga+Completa%5D+%5BPC%5D+%5BSpanish%5D+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d436556e2d6e79fe135e3ff57bd1f8ae2ea4f836","infoHashBuffer":{"type":"Buffer","data":[212,54,85,110,45,110,121,254,19,94,63,245,123,209,248,174,46,164,248,54]},"announce":[],"urlList":[]}}