{"title":"Cannabis Collection - Hashish","uid":7370057,"size":3319054336,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:d43ba9f537c2e4ee5265471b0771f019479327a4&amp;dn=Cannabis+Collection+-+Hashish&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GRNS3","files":-1,"time":1340209263,"description":"\nThe Cannabis Collection - a series of educative and entertaining info dvd's\n\nPlease enjoy, share with friends and seed :)\n\n\nHashish\n\nA small village high up in the mountains of Ketama, North Morocco. Since centuries the life of the people that live here is intricately tied in with the drug hashish. Hashish as daily labour, hashish as a bartering good, hashish as business, hashish as the basis and philosophy of a social system, hashish as the medium of dreams and hashish as the reason for stagnation.French, Arabic, English languages with English subtitles;\nResidents of the small Moroccan village of Ketama rely on a yearly trade dealing in hashish for their primary source of income. This fascinating documentary takes a look at the business, and the widespread lifestyle implications it has on the local populace. The business has boomed for Centuries, and shows no signs of letting up. Not only is it used to make money, hashish is also utilized as a bartering tool, and held up as a way to make villagers potentially rich beyond their wildest dreams. Naturally this doesn't hold true for everyone, leading to shattered illusions and a life spent just scraping by. HASHISH presents the full spectrum of disparate experiences that the citizens of Ketama endure on a daily basis. \n\n\nCheck this account for updates regularly :)\n","torrent":{"xt":"urn:btih:d43ba9f537c2e4ee5265471b0771f019479327a4","amp;dn":"Cannabis+Collection+-+Hashish","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d43ba9f537c2e4ee5265471b0771f019479327a4","infoHashBuffer":{"type":"Buffer","data":[212,59,169,245,55,194,228,238,82,101,71,27,7,113,240,25,71,147,39,164]},"announce":[],"urlList":[]}}