{"title":"RiffTrax - Buffalo Rider (mpg)","uid":8779341,"size":4349825028,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d4d4e989e93e3d7c7cefb2f7aeae0424d20336d5&amp;dn=RiffTrax+-+Buffalo+Rider+%28mpg%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"saybis","files":1,"time":1375641280,"description":"DO YOU LIKE THE ROOM, BIRDEMIC AND SANTA &amp; THE ICE CREAM BUNNY? IF SO, STOP READING AND BUY THIS RIGHT NOW\n\nWhen you really stop and think about it, there are two kinds of movies: movies where rugged men punch mountain lions, and movies where this sadly does not happen.\n\nFortunately, Buffalo Rider is the inaugural member of this first group, and while it waits for another movie to join it, (we're looking squarely at you The Help 2), it is content to quietly kick some ass all by its lonesome.\n\nBuffalo Rider tells the story of Jake &quot;Buffalo&quot; Jones, a legend of the Old West who tamed and rode a two-ton buffalo named Samson and, in the process, proved that there really must not have been much to do in the Old West. And while the sight of a man who resembles a Doobie Brothers roadie riding a gigantic buffalo is spectacular in itself, the producers decide to spice up the action a bit by keeping crates of vicious wild animals just off-screen and occasionally releasing them to attack Jake and the buffalo. Bears, wolves and cougars all show up to take on Jake, who appears to have been informed of these animals' presence seconds before they were released.\n\nYou may have seen the clips of the &quot;Guy on a Buffalo&quot; song. Please, let us reassure you that you have NOT experienced the entire Buffalo Rider universe until you've seen the whole movie. This is a film that devotes nearly 1/10th of its screen time to tell the tale of a very, very unfortunate raccoon named Bandit. It has its own majestic theme song that you will be singing for days afterwards.  Imagine if all you saw of Birdemic were the coat-hanger scenes.  You'd be forgiven for assuming that was all the movie had to offer, but then you'd miss out on solrpnls, hanging out with your family and the spruce bark beetles. Please do not miss out on Buffalo Rider. Although the cougar punching is still pretty damn sweet...","torrent":{"xt":"urn:btih:d4d4e989e93e3d7c7cefb2f7aeae0424d20336d5","amp;dn":"RiffTrax+-+Buffalo+Rider+%28mpg%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d4d4e989e93e3d7c7cefb2f7aeae0424d20336d5","infoHashBuffer":{"type":"Buffer","data":[212,212,233,137,233,62,61,124,124,239,178,247,174,174,4,36,210,3,54,213]},"announce":[],"urlList":[]}}