{"title":"Kafka and Photography {BBS}","uid":7351113,"size":2288632,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d5534f95814ab6cc44da2e9f068904d961376fa7&amp;dn=Kafka+and+Photography+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1339604033,"description":"Throughout his life, Franz Kafka was fascinated by photography, a medium which for him came to encapsulate both the attractions and the pitfalls of modern life. Kafka's personal engagement with the medium - as a keen viewer and collector of photographs as well as an amateur photographer - is reflected in his writings, which explore photography from a variety of different perspectives By far the most frequently and extensively discussed visual medium in Kafka's texts, photography is paradigmatic of his relationship to visuality more generally. This study not only explores photography's recurrence as a theme within his texts but it is also the first to take systematic account of Kafka's use of photographs as literary source material.\nKafka and Photography presents one of the most important modern writers from an entirely new perspective; it sheds new light on familiar works and uncovers unexplored aspects of Kafka's engagement with his time and context. Providing a chronological account of key prose works, as well as the personal writings, this study is accessible to students and lay readers. It will be of interest not only to literary scholars but also to those working in photography, media, and cultural studies. Its detailed textual analyses are set against a richly documented historical context which illustrates Kafka's interest in contemporary culture through a range of visual material taken from public as well as private sources - some of which has only recently become available. As this book demonstrates, photography had a profound impact on Kafka's literary imagination and as such helps to explain the mesmerizing intensity of enigmatic visual detail which is a hallmark of his narratives.\n\n\nHardcover: 288 pages\nPublisher: Oxford University Press, USA (February 3, 2008)\nLanguage: English\nISBN-10: 0199219451\nISBN-13: 978-0199219452","torrent":{"xt":"urn:btih:d5534f95814ab6cc44da2e9f068904d961376fa7","amp;dn":"Kafka+and+Photography+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d5534f95814ab6cc44da2e9f068904d961376fa7","infoHashBuffer":{"type":"Buffer","data":[213,83,79,149,129,74,182,204,68,218,46,159,6,137,4,217,97,55,111,167]},"announce":[],"urlList":[]}}