{"title":"Expert Guide To Anal Sex XXX [blogsexcetera][Anal]","uid":4190023,"size":734941184,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:d5847fcb8e0949ef62f9e82aee9048b08fafe748&amp;dn=Expert+Guide+To+Anal+Sex+XXX+%5Bblogsexcetera%5D%5BAnal%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"behen","files":1,"time":1210893722,"description":"Village Voice columnist and anal sex expert Tristan Taormino leads a group of couples in a class about anal pleasure. She covers anatomy, lube, tips, techniques, and toys. She welcomes her co- hosts, Lorelei and Ariel, who share their thoughts on the subject as well as some advice. Then they demonstrate various techniques for the crowd as Tristan narrates what they are doing. The workshop participants watch and ask questions about the G-spot, lubrication, and pain. Then, Tristan and Lorelei surprise Ariel with a very special anal toy.\nAfter the workshop, we meet Ricki and Marcos who talk about their experiences with anal sex and share their favorite positions, toys, and tricks. Ricki tries anal beads for the first time, and the twosome have a bet about how many she&amp;#039;ll take. Next, we meet Adrianna and Manuel, an experienced young couple with a vast range of anal know how who are also eager to demonstrate their anal style. They play with butt plugs, dildos, and vibrators and try out many different positions. Their session culminates in an intense, extended orgasm that leaves Adrianna exhausted and very satisfied.\n\nWith this debut volume of the Vivid-Ed &quot;Expert Guide&quot; series, we&amp;#039;ve developed an innovative new format: you can watch the sex scenes with or without instruction (it&amp;#039;s like getting two movies on one disc!). There are also two mini-features: an anal enema how-to and a safer sex demonstration. Plus, in a bonus sex scene, see what happens when Lorelei and Ariel finish what they started in the workshop. All in all, it&amp;#039;s an educational introduction to the most intimate of erotic acts packed with information as well as heat and sensuality. Learn, experience, and enjoy anal pleasure by the experts!\n\nStarring: \nLorelei Lee\nAriel X\nRicki White\nMarcos Leon\nAdrianna Nicole\nManuel Ferrara\nTristan Taormino","torrent":{"xt":"urn:btih:d5847fcb8e0949ef62f9e82aee9048b08fafe748","amp;dn":"Expert+Guide+To+Anal+Sex+XXX+%5Bblogsexcetera%5D%5BAnal%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d5847fcb8e0949ef62f9e82aee9048b08fafe748","infoHashBuffer":{"type":"Buffer","data":[213,132,127,203,142,9,73,239,98,249,232,42,238,144,72,176,143,175,231,72]},"announce":[],"urlList":[]}}