{"title":"Textile Fibre Composites in Civil Engineering","uid":15287621,"size":51985109,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d66578db9d041609fbe483fc0a70624939310670&amp;dn=Textile+Fibre+Composites+in+Civil+Engineering&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"clouderone","files":1,"time":1468381983,"description":"Textile Fibre Composites in Civil Engineering - Thanasis Triantafillou (WP, 2016).pdf\r\n\r\nISBN 978-1-78242-446-8\r\n\r\nTextile Fibre Composites in Civil Engineering provides a state-of-the-art review from leading experts on recent developments, the use of textile fiber composites in civil engineering, and a focus on both new and existing structures. Textile-based composites are new materials for civil engineers. Recent developments have demonstrated their potential in the prefabrication of concrete structures and as a tool for both strengthening and seismic retrofitting of existing concrete and masonry structures, including those of a historical value.\r\n\r\nThe book reviews materials, production technologies, fundamental properties, testing, design aspects, applications, and directions for future research and developments. Following the opening introductory chapter, Part One covers materials, production technologies, and the manufacturing of textile fiber composites for structural and civil engineering. Part Two moves on to review testing, mechanical behavior, and durability aspects of textile fiber composites used in structural and civil engineering. Chapters here cover topics such as the durability of structural elements and bond aspects in textile fiber composites.\r\n\r\nPart Three analyzes the structural behavior and design of textile reinforced concrete. This section includes a number of case studies providing thorough coverage of the topic. The final section of the volume details the strengthening and seismic retrofitting of existing structures. Chapters investigate concrete and masonry structures, in addition to providing information and insights on future directions in the field. The book is a key volume for researchers, academics, practitioners, and students working in civil and structural engineering and those working with advanced construction materials","torrent":{"xt":"urn:btih:d66578db9d041609fbe483fc0a70624939310670","amp;dn":"Textile+Fibre+Composites+in+Civil+Engineering","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d66578db9d041609fbe483fc0a70624939310670","infoHashBuffer":{"type":"Buffer","data":[214,101,120,219,157,4,22,9,251,228,131,252,10,112,98,73,57,49,6,112]},"announce":[],"urlList":[]}}