{"title":"Jewish Woman Fakes Anti-semitic Hate Crime - avi","uid":4735817,"size":11089202,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:d7e45f6bd487ab9347f21432955df42c020d7d80&amp;dn=Jewish+Woman+Fakes+Anti-semitic+Hate+Crime+-+avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"CuriousGeorge","files":1,"time":1235274324,"description":"Video\n\nPolice: Jewish GW Student Admits Putting Swastikas On Her Door\n\nWASHINGTON -- George Washington University officials said a Jewish student who complained about swastikas showing up on her door put them there herself.\n\nThe student lives in Mitchell Hall, where half a dozen swastikas had shown up on her dorm room door in the past several weeks.\n\nUniversity police set up a hidden camera. They said the girl admitted responsibility Monday.\n\nNews 4 interviewed More.. the student last week after the fifth swastika was discovered. She did not want to be identified.\n\n&quot;It's a big story,&quot; said Jake Sherman, GW Hatchet editor. &quot;Thirty percent of GW students are Jewish&quot;\n\nReporters at the GW Hatchet newspaper have been following the story since it began. They said they learned on Monday morning that the alleged victim would likely be implicated.\n\nThey said they spoke to her twice by phone.\n\nAccording to reporters at the newspaper, the student said, &quot;I wasn't looking to create this sort of insanity. I wasn't looking to become a media darling. I was just looking for acknowledgment from the university that someone drew a swastika on the door.&quot;\n\nThe student now faces disciplinary action from the school and could face criminal charges.\n----------------------------------------------------------------------------------\n\nHow to spot an antisemitic hate crime hoax &lt;a href=&quot;\nhttp://www.aztlan.net/spot_hate_crime_hoaxes.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.aztlan.net/spot_hate_crime_hoaxes.htm&lt;/a&gt;\n\nCalif. Professor Charged with Hate Crime Hoax &lt;a href=&quot;\nhttp://www.thetruthseeker.co.uk/article.asp?ID=1748&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.thetruthseeker.co.uk/article.asp?ID=1748&lt;/a&gt;\n\n\nWhy do Jews, homosexuals, lesbians and others stage phoney hate crime hoaxes?\nThe first has to do with the personal payoff for victimization, i.e., attention, sympathy, a sense of importance, feeding persecution fantasies, and material payoffs. The second has to do with advancing a political or social agenda, as in the case of hoaxes intending to create support for regulations or legislation, or to help create a climate sympathetic to specific interest groups. The third has to do with insurance fraud, with the racial or anti-Semitic element almost an afterthought. Most hoaxes are combinations of the first two types.\n\nCarefully done, the risk of discover of a hoax is minimal. Most hoaxes simply remain &quot;unsolved&quot; hate crimes. Those that are discovered may not result in criminal action against the hoaxers. When criminal charges are filed they can have wide ranging consequences, from long prison terms in some cases to a slap on the wrist on others, with most cases tending toward the latter.\n\nWhat can be done about hoaxes? Probably very little as long as victimization claims are so uncritically accepted, and the payoff for alleged victimization is sufficiently tempting and rewarding. &quot;Hate crime&quot; legislation, although well-intentioned, has created a powerful market for the side benefits of alleged hate crimes. When these crimes are not naturally occurring, or are not occurring in sufficient numbers, a motive to commit hoaxes is created. Provisions in hate crime legislation for civil damages also creates a powerful motive to commit hoaxes.\n\nVigilance in discovering hoaxes and appropriate publicity may discourage some potential hoaxers. Punishment for hoaxes equal bona fide hate crimes, including sentence enhancement, would probably have a greater deterrent effect, but would also perpetuate the injustices inherent in the hate crime concept itself.\n\nProbably the most effective thing would be for universities, police agencies and the media to entertain a healthy skepticism about hate crime claims, and to establish a category of &quot;not proven&quot; in cases where no perpetrator is identified and charged. Any unsolved case may be a hoax, include those intuitively thought to be bona fide. \n----------------------------------------------------------------------------------\n\nMy public URL:\t &lt;a href=&quot;\nhttp://thepiratebay.se/user/TalmudTimmy&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/TalmudTimmy&lt;/a&gt;\n\nMy RSS feed:\t &lt;a href=&quot;\nhttp://rss.thepiratebay.se/user/97bdef327d0ba834f331abb3d0fe47a2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://rss.thepiratebay.se/user/97bdef327d0ba834f331abb3d0fe47a2&lt;/a&gt;","torrent":{"xt":"urn:btih:d7e45f6bd487ab9347f21432955df42c020d7d80","amp;dn":"Jewish+Woman+Fakes+Anti-semitic+Hate+Crime+-+avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d7e45f6bd487ab9347f21432955df42c020d7d80","infoHashBuffer":{"type":"Buffer","data":[215,228,95,107,212,135,171,147,71,242,20,50,149,93,244,44,2,13,125,128]},"announce":[],"urlList":[]}}