{"title":"TSSeduction---TS-27099 Fernanda Zocal and Max Scar MP4 720p","uid":8029518,"size":1210322399,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:d80e010adbc81648f7331f6a2ecae35c209aa58b&amp;dn=TSSeduction---TS-27099+Fernanda+Zocal+and+Max+Scar+MP4+720p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"merzedes","files":-1,"time":1358377982,"description":"The League of Extraordinary Transsexuals: The Final Punishment\n\nJan 16, 2013 - Performers: Fernanda Zocal and Max Scar \n\n\nMP4 + Pics.\n\nWMV can be found here: &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/8029384/TSSeduction---TS-27099_Fernanda_Zocal_and_Max_Scar_WMV_720p&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/8029384/TSSeduction---TS-27099_Fernanda_Zocal_and_Max_Scar_WMV_720p&lt;/a&gt;              \n\nTsSeduction.com presents &quot;The League of Extraordinary Transsexuals&quot; featuring three of the sexiest, most feminine cock divas you will ever see punishing men in a remote villa in Northern Italy. \n\n&quot;The League&quot; has its own rules and those who break them pay not a prison sentence but instead learn the hard way to behave. \n\nIn Part 1 and 2 of this series, Graziella Toledo and Nauana Lima used their absolutely vexing beauty and ruthless sexual dominance to break two of the three men who wronged The League. In this finale chapter, we have saved the sexiest Femme Fatale for last.\n\nFernanda Zocal lets her man wait in the freezing cellar - naked, shivering, scared. His balls are blue from the cold and the extreme sexual denial he has been made to endure while his two accomplices served out their punishment as ass slaves to women of the house. \n\nMax has no idea what has happened to his friends but when he is finally is pulled out of the cellars by his tied up, aching balls, he wishes he was just left to freeze. He resist Fernanda's cock as she presses it against his mouth. She fucks him without stopping in an incredible show of stamina and endurance. He nearly cries when he cums and is so ashamed that this beautiful woman's penis made him cum while she fucked his ass. He hates the fucking and the sucking all the way through, but what he hates most of all, is when he finally starts to like it and can not stop himself from cumming. Fernanda is beyond pleased with herself and to add to Max's humiliation, she drops a thick load all over his limp, post-orgasm cock. \nIf you missed Part 1 and 2 of &quot;The League of Extraordinary Transsexuals&quot;, click on the features section of this site to find those episodes. \n\nScreens   &lt;a href=&quot;\nhttp://www.tsseduction.com/site/shoot.jsp?shootId=27099&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tsseduction.com/site/shoot.jsp?shootId=27099&lt;/a&gt;\n\n9000 uploads and counting, 10k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n ","torrent":{"xt":"urn:btih:d80e010adbc81648f7331f6a2ecae35c209aa58b","amp;dn":"TSSeduction---TS-27099+Fernanda+Zocal+and+Max+Scar+MP4+720p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d80e010adbc81648f7331f6a2ecae35c209aa58b","infoHashBuffer":{"type":"Buffer","data":[216,14,1,10,219,200,22,72,247,51,31,106,46,202,227,92,32,154,165,139]},"announce":[],"urlList":[]}}