{"title":"Sadistic Intent - Resurrection Of The Ancient Black Earth mp3- 2","uid":11543883,"size":100179470,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d9d68a08f764b1d4a95a8f1b56a808589d2630e6&amp;dn=Sadistic+Intent+-+Resurrection+Of+The+Ancient+Black+Earth+mp3-+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"analogkid6103","files":11,"time":1416700399,"description":"Sadistic Intent is a Death Metal horde hailing from Los Angeles, CA which was formed in the Fall of 1987. Taking influence by the original Death/Black Metal groups such as Slayer, Possessed, Dark Angel, Destruction, Venom, Sodom, Celtic Frost and so forth. The Cortez brother's went through a few line-ups in order to form the metaphorical puzzle which would articulate their vision into a reality.\n\nSetting out to be an onslaught of extreme and obscure Metal, the musical journey began by exploring the newfound boundaries of speed as well as heaviness creating and molding the realm of Sadistic Intent. At a time when Death/Black Metal was no longer popular as it was in the mid 80s due to the pioneering groups break ups, line-up changes or plain different directions to name a few reasons, Sadistic Intent were one of the handful of groups in the United States raising the flag of Death Metal! After a couple of rehearsal tapes and demos the band earned a name for itself in the international underground scene and decided to sign with a rising label at the time called Wild Rags Records. In 1990 the 'Impending Doom' EP was released and a few tours followed in Mexico as well as the States! After bitter disputes with the label they moved on and the following year self released a limited edition (1,000 copies) 7 EP titled A Calm Before The Storm. Shortly after this release the band came across line-up problems and would be until late 1993 when Sadistic Intent would Return!\n\nIn 1994 Sadistic Intent came back from the dead with the properly titled 'Resurrection' MCD. This was the first recording in which Bassist Bay Cortez would now also handle the vocal duties marking the beginning of a new era for the band. The sonic conjuration continued to build on it self with an array of Thrashing Death, blasting speeds and atmospheric soundscapes of doom diving even deeper into the darkside! The band kept busy on the live West Coast circuit especially in Los Angeles now being recognized as a headlining act upon the local scene. After sorting out a line-up problem in 1995 the next production would be a promotional demo titled 'Ancient Black Earth'. In1996 the band decided to release this recording for the diehards as a limited edition (500 hand numbered copies) MCD through Dark Realm Records and it quickly sold out!\n\nThat year Sadistic Intent was also featured on Dwell Records successful tribute to Celtic Frost! During this period of time the group would make a few appearances at the Milwaukee Metal Fest and a couple more small tours across Mexico and the United States. Not to mention, throughout the years they had already appeared with virtually every international Death/Black Metal act that has toured through the Los Angeles area! In 1998 the next recording would be a split 7 EP with a German Black Metal group called Ungod through Merciless Records (Ger.). In 1999 Sadistic Intent would then record a song for a tribute to California's legendary Possessed. What made this session extraordinarily special is due to fact that original Possessed front man Jeff Becerra is actually featured on vocals! That same year the band recorded for yet another Dwell Records tribute, this time for L.A.'s own Slayer which literally introduced Sadistic Intent to thousands of slaytanic fans!\n\nLurking in the depths of the underground for well over a decade, the group has ignored the trends and has made its own way without any submission! In the new millennium, rather than compromise, Sadistic Intent was put on hold as the band encountered dilemmas with the recording and line-up changes. After a couple years of silence from any live presentations, Sadistic Intent re-emerged on stage in 2004! The band did a few shows, the first one being a co-headlining festival appearance in Los Angeles to a crowd of 1,000 Metal maniacs! At this event, Sadistic Intent joined forces with Jeff Becerra doing a live version of the classic Possessed song 'The Exorcist', thus chronicling a night of Metal history The next release will be the long awaited full-length album 'The Second Coming Of Darkness!' This musical conjuration will be a dark continuation of the entity known as Sadistic Intent, establishing yet another level of execution, opening a ritualistic vortex of Extreme &amp; Obscure Death!!!\n\nBay Cortez - Bass, Vocals (Possessed)\nRick Cortez - Guitar (Possessed)\nErnesto Bueno - Guitar (Possessed)\nEmilio Marquez - Drums (Possessed, Asesino, Engrave (US), Brainstorm (US), Nokturnal Fear, Coffin Texts, Brujeria)\nQuote:\nStepping forward substantially in musicianship and thought process through which they refine the microsymphonies of despair and vengeance of their first album, Sadistic Intent shape their unruly yet promising fury of power chord phrases into a tightly controlled fluid transfer of momentum between internal forms which like shadows in a cave are perverse representations of ideals in conflict behind the visible interaction of patterning representing the symbolism of basic existential desires and ideals. Precision drumming and clattering attack with roaring power chord exhalations in locked cadence synchronize an egress of sense for a series of subtle yet biologically structural forks acting upon the proliferation of divisiveness in transition balanced by opportunity unveiled within. The energetic forward sense of advance in which dense and morbid convergences utter deeply sacred combat for liturgical values plays out a scenario of violence orchestrated by the searing voice that has become trademark for this band, as rumbling drums and low-end chord rumbling penetrate silence with structure and chaos. An advancement on the previous work in overall cohesion and the smallest measurements of technique, this three-song offering leaves great hopes for the next concoction from this feral California band.\n\n1. Resurrection  \n2. Asphyxiation\n3. Conflict Within\n4. Dark Predictions  \n5. Condemned in Misery\n6. A Mass for Tortured Souls  \n7. Untimely End  \n8. Ancient Black Earth\n9. Funerals Obscure  \n10. Morbid Faith  \n11. The Exorcist  \nGenre:\tBlack\nSubgenre:\tBlackened Death / Thrash\nBitrate:\tVbr\nSize:\t95.54 MB\nShow/Hide Files: \t\n11 files","torrent":{"xt":"urn:btih:d9d68a08f764b1d4a95a8f1b56a808589d2630e6","amp;dn":"Sadistic+Intent+-+Resurrection+Of+The+Ancient+Black+Earth+mp3-+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9d68a08f764b1d4a95a8f1b56a808589d2630e6","infoHashBuffer":{"type":"Buffer","data":[217,214,138,8,247,100,177,212,169,90,143,27,86,168,8,88,157,38,48,230]},"announce":[],"urlList":[]}}