{"title":"Seven Chances (1925)","uid":4848459,"size":733919324,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:dac4cc3aac880507098907ae0b69e1599eaee21a&amp;dn=Seven+Chances+%281925%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Willams","files":5,"time":1239781437,"description":"Seven Chances (1925) \n\n\nSeven Chances (1925) is an American comedy silent film directed by and starring Buster Keaton, based on a play written by David Belasco. Additional casts members include T. Roy Barnes, Snitz Edwards, Ruth Dwyer, and others. The film also stars Jean Arthur, a future 1930s screwball actor, in an uncredited supporting role as a telephone operator.\n\nThe story tells of Jimmy Shannon (Buster Keaton ), a financial broker who's nearly bankrupt when an attorney presents his grandfather's will that left him seven million dollars.\n\nIn order to inherit the money, Jimmie must marry before 7 pm on his 27th birthday, which is the day he reads the will.\n\nWhen released, Mordaunt Hall, the film critic for The New York Times, gave the film a mixed review, and wrote, &quot;After viewing Buster Keaton's latest comedy, Seven Chances, one is justified in assuming; that there is a slump in the fun market...it took the combined efforts of three experienced gag men to turn the stage effort into screen material. The result inclines one's belief in the old adage concerning too many cooks, as although there are quite a number of good twists some of them have been produced in haste. The ideas did not have time to ripen and are therefore put before the audience in a rather sour state.&quot;\n\nFilm critic Dennis Schwartz liked the film and wrote, &quot;A less ambitious but, nevertheless, hilarious Buster Keaton comedy. It's taken from the play by David Belasco and scripted by a team of writers. This minor film is based on a one-joke premise, but it has one of the greatest ever chase scenes. Keaton proves he's a master at building the comedy until it reaches its absolute breaking point.&quot;\n\nTime Out London gave the film a positive review and wrote, &quot;Less ambitious and less concerned with plastic values than the best of Keaton, this is nevertheless a dazzlingly balletic comedy in which Buster has a matter of hours to acquire the wife on which a seven million dollar inheritance depends...From this leisurely start, the film takes off into a fantastically elaborate, gloriously inventive chase sequence, in which Buster escapes the mob of pursuing harridans only to find an escalating avalanche of rocks taking over at his heels as he hurtles downhill. Added only after an initial preview, the rocks make for one of the great Keaton action gags.&quot;\n\nThe review aggregator Rotten Tomatoes reported that 100% of critics gave the film a positive review, based on 11 reviews, marking the film as &quot;Fresh.&quot;\n\nIMDB: 8.0/10\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0016332/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0016332/&lt;/a&gt;\n\n\n*****************************FREAKYFLICKS*****************************\n\nFreakyFlicks is a free and open community dedicated to preserving and\nsharing cinematic art in the digital era. Our goal is to disseminate\nsuch works of art to the widest audience possible through the channels\nprovided by P2P technology.\n\nThe FreakyFlicks collection is limited to those films that have played\nan exceptional role in the history of cinema and its progression in\nbecoming a great art. Films that are usually described as classic,\ncult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them\nand participate in our community. All you need do is include this tag\nin your upload and join us at the forum to announce your release.\n       \n \n            &lt;a href=&quot; http://freakyflicks.proboards54.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://freakyflicks.proboards54.com&lt;/a&gt;\t\n\t\n\n*****************************FREAKYFLICKS*****************************\t","torrent":{"xt":"urn:btih:dac4cc3aac880507098907ae0b69e1599eaee21a","amp;dn":"Seven+Chances+%281925%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dac4cc3aac880507098907ae0b69e1599eaee21a","infoHashBuffer":{"type":"Buffer","data":[218,196,204,58,172,136,5,7,9,137,7,174,11,105,225,89,158,174,226,26]},"announce":[],"urlList":[]}}