{"title":"[PDF] [2010] The Rage Against God","uid":6464582,"size":501156,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dbd6f57b4c7dbf033e9b3f9c3af82397350b9c10&amp;dn=%5BPDF%5D+%5B2010%5D+The+Rage+Against+God&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"lyndavilla","files":2,"time":1307916587,"description":"DOWNLOAD MORE EBOOKS, MAGAZINES, &amp; PDFS:\n   &lt;a href=&quot;\nhttp://buyabook.ws/download-ebooks-magazines-pdfs-more/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://buyabook.ws/download-ebooks-magazines-pdfs-more/&lt;/a&gt;\n\nBOOK INFO:\n\n`The difficulties of the anti-theists begin when they try to engage with anyone who does not agree with them, when their reaction is often a frustrated rage that the rest of us are so stupid. But what if that is not the problem? Their refusal to accept that others might be as intelligent as they, yet disagree, leads them into many snares.\\'Peter Hitchens lost faith as a teenager. But eventually finding atheism barren, he came by a logical process to his current affiliation to an unmodernised belief in Christianity.Hitchens describes his return from the far political left. Familiar with British left-wing politics, it was travelling in the Communist bloc that first undermined and replaced his leftism, a process virtually completed when he became a newspaper\\'s resident Moscow correspondent in 1990, just before the collapse of the Communist Party.He became convinced of certain propositions. That modern western social democratic politics is a form of false religion in which people try to substitute a social conscience for an individual one. That utopianism is actively dangerous. That liberty and law are attainable human objectives which are also the good by-products of Christian faith. Faith is the best antidote to utopianism, dismissing the dangerous idea of earthly perfection, discouraging people from acting as if they were God, encouraging people to act in the belief that there is a God and an ordered, purposeful universe, governed by an unalterable law.","torrent":{"xt":"urn:btih:dbd6f57b4c7dbf033e9b3f9c3af82397350b9c10","amp;dn":"%5BPDF%5D+%5B2010%5D+The+Rage+Against+God","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dbd6f57b4c7dbf033e9b3f9c3af82397350b9c10","infoHashBuffer":{"type":"Buffer","data":[219,214,245,123,76,125,191,3,62,155,63,156,58,248,35,151,53,11,156,16]},"announce":[],"urlList":[]}}