{"title":"4 Rare 80s Albums [Part 3]","uid":4080968,"size":309780426,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:dc2b57f45143a3a11b616151749b64de48b5a770&amp;dn=4+Rare+80s+Albums+%5BPart+3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"80zforever","files":41,"time":1205569049,"description":"As I promised, thrid part of four rare 80s LPs for you to have and to hold! These four are on my all time favorite list! Check then out for yourself.\n \n\nBritish Electric Foundation - Music of Quality and Distinction Volume One [1982]\n\n\nB.E.F. (British Electric Foundation) are a band/ production company formed by former Human League members Martyn Ware and Ian Craig Marsh who later became Heaven 17, with lead singer Glenn Gregory.\n\nIn 1982, with Heaven 17 already established with Glenn Gregory as the lead vocalist, B.E.F. released an album entitled Music of Quality and Distinction Volume One on Virgin Records, which involved other artists covering classic songs. The production was mainly in the Heaven 17/ B.E.F. style (i.e. synthesisers and LinnDrums). Tina Turner's version of The Temptations's &quot;Ball of Confusion&quot; drew the attention of Capitol Records and her next single &quot;Let's Stay Together&quot;, co-produced by Ware, peaked at number six in the UK charts and made the US Top 20. B.E.F.'s album also featured covers by Billy Mackenzie - &quot;The Secret Life of Arabia&quot; and &quot;It's Over,&quot; Paul Jones - &quot;There's A Ghost In My House,&quot; Paula Yates - &quot;These Boots Are Made For Walkin',&quot; Gary Glitter - &quot;Suspicious Minds,&quot; Bernie Nolan - &quot;You Keep Me Hangin' On,&quot; Glenn Gregory - &quot;Wichita Lineman&quot; and &quot;Perfect Day&quot; and Sandie Shaw - &quot;Anyone Who Had a Heart.&quot;\n\n\n01 Ball of Confusion (Feat. Tina Turner)\n02 The Secret Life of Arabia (Feat. Billy MacKenzie)\n03 There's a Ghost in My House (Feat. Paul Jones)\n04 These Boots Are Made for Walkin' (Feat. Paula Yates)\n05 Suspicious Minds (Feat. Gary Glitter)\n06 You Keep Me Hangin' On (Feat. Bernie Nolan)\n07 Wichita Lineman (Feat. Glenn Gregory)\n08 Anyone Who Had a Heart (Feat. Sandie Shaw)\n09 Perfect Day (Feat. Glenn Gregory)\n10 It's Over (Feat. Billy MacKenzie)\n\n\n\nIndustry - Stranger to Stranger [1984]\n\n\nThe bouncy, toe-tapping keyboards of Industry's &quot;State of the Nation&quot; seemed to be tailor-made for American Bandstand in the early '80s; however, the song's stinging anti-war lyrics made the track thought-provoking as well as catchy. &quot;State of the Nation&quot; wasn't Industry's only contribution to the pop world, but they aren't remembered for anything else. Comprised of Jon Carin (synthesizer/keyboards/vocals), Mercury Caronia (synthesizer/percussion/drums), Rudy Perrone (guitar/bass/vocals), and Brian Unger (guitar/vocals), Industry formed in New York. In 1983, the group released an EP; it was followed by a full-length album, Stranger to Stranger, on Capitol Records in 1984. &quot;State of the Nation&quot; was a hit in dance clubs, especially in Asia. Stranger to Stranger was Industry's only LP.\n\n\n01 Still of The Night\n02 Until We're Together\n03 Romantic Dreams\n04 What Have I Got to Lose\n05 State of the Nation\n06 Shangri-La\n07 Communication\n08 All I Need Is You\n09 Stranger in a Strange Land\n10 Living Alone Too Long\n\n\n\nRed Rockers - Good As Gold [1983]\n\n\nThe Red Rockers were a New Wave band from New Orleans, Louisiana. They formed in 1979 and disbanded in 1985. They are best known for their 1983 single &quot;China&quot;. John Thomas Griffith now plays guitar and sings in the band Cowboy Mouth, which he co-founded in 1990 with Fred LeBlanc. The Red Rockers toured the United States opening for The Cars, Men at Work, U2, Joan Jett, The Go Go's. Darren Hill has a management company called Ten Pin Management; he manages The New York Dolls, Paul Westerberg, and others.\n\n\n01 China\n02 Good as Gold\n03 Dreams Fade Away\n04 Change the World Around\n05 Answers to the Questions\n06 'Til It All Falls Down\n07 Running Away from You\n08 Fanfare for Metropolis\n09 (Come on into) My House\n10 Home Is Where the War\n\n\n\nThe Lover Speaks -The Lover Speaks [1986]\n\n\nThe Lover Speaks was the new wave duo of David Freeman (vocals), and Joseph Hughes (arranger, composer). They sang the original version of the song &quot;No More &quot;I Love You's&quot;&quot;, covered by Annie Lennox in 1995 on her Medusa album, taking it to #2 on the UK singles chart. I have always called this LP one of the best records that ever came out of the 80s.\n\n\n01 Every Lover's Sign\n02 No More 'I Love You's'\n03 Never to Forget You\n04 Face Me and Smile\n05 Absent One\n06 Love is- 'I Gave You Everything'\n07 'This Can't Go On!'\n08 Still Faking This Art of Love\n09 Tremble Dancing\n10 Of Tears\n\n","torrent":{"xt":"urn:btih:dc2b57f45143a3a11b616151749b64de48b5a770","amp;dn":"4+Rare+80s+Albums+%5BPart+3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc2b57f45143a3a11b616151749b64de48b5a770","infoHashBuffer":{"type":"Buffer","data":[220,43,87,244,81,67,163,161,27,97,97,81,116,155,100,222,72,181,167,112]},"announce":[],"urlList":[]}}