{"title":"Gran Torino","uid":4977484,"size":4681451520,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:ddae5ca06f84f2f91e0277abc7fae70f92c399ed&amp;dn=Gran+Torino&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"lulu24","files":1,"time":1246077126,"description":"Walt Kowalski is a widower who holds onto his prejudices despite the changes in his Michigan neighborhood and the world around him. Kowalski is a grumpy, tough-minded, unhappy an old man, who can't get along with either his kids or his neighbors, a Korean War veteran whose prize possession is a 1972 Gran Torino he keeps in mint condition. When his neighbor Thao, a young Hmong teenager under pressure from his gang member cousin, tries to steal his Gran Torino, Kowalski sets out to reform the youth. Drawn against his will into the life of Thao's family, Kowalski is soon taking steps to protect them from the gangs that infest their neighborhood.  Written by alfiehitchie\n\nRecently widowed senior Walt Kowalski speaks his mind no matter who he offends, and growls under his breath whenever he disagrees with those around him. Much of his personal values are shaped from his time in the Korean War. He doesn't understand his family, nor they him. As such, they tolerate each other more than love each other. He has lived in the same house for much of his adult life, in an older working class suburban neighborhood of Detroit. It is slowly transforming into an immigrant neighborhood. The Lor family, of ethnic Hmong descent, move in next door to Walt, the family which includes two teenagers: outspoken Sue, and brooding and passive Thao. The neighbors' initial &quot;don't speak to me&quot; relationship changes when, out of circumstance, Walt saves Thao from a potentially violent incident with a Vietnamese youth gang. This incident, only the latest of run-in's Thao has had with them, sparks the neighbors to get to know each other. This new relationship with his neighbors extends to an antagonistic relationship with the Vietnamese gang. Walt realizes that neither Thao or Sue will ever be able to live in peace as long as the gang exists. Written by Huggo \n\n\n\n\n\n\n----------------------------------------------------------\n\nI've decrypted and shrunk the movie to fit on a DVD with all options still included.  All menus, all subtitles and extras...all you have to do is either mount and play on a virtual drive or burn.\n\nEnjoy!","torrent":{"xt":"urn:btih:ddae5ca06f84f2f91e0277abc7fae70f92c399ed","amp;dn":"Gran+Torino","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ddae5ca06f84f2f91e0277abc7fae70f92c399ed","infoHashBuffer":{"type":"Buffer","data":[221,174,92,160,111,132,242,249,30,2,119,171,199,250,231,15,146,195,153,237]},"announce":[],"urlList":[]}}