{"title":"Stevie Jackson - (I Can't Get No) Stevie Jackson [2011][FLAC]","uid":8632395,"size":270190876,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:de82ec6185aa333d804f33deacd32b9e74fd5b7a&amp;dn=Stevie+Jackson+-+%28I+Can%27t+Get+No%29+Stevie+Jackson+%5B2011%5D%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":13,"time":1372662970,"description":"Artist: Stevie Jackson\nRelease: (I Can't Get No) Stevie Jackson\nReleased: 2011\nLabel: BANCHORY\nCatalog#: BANCHORY6318\nFormat: FLAC / Lossless/WEB\n[color=blue]Country: UK\nStyle: rock\n\n01. Pure of Heart\n02. Just, Just So to the Point\n03. Try Me\n04. Richie Now\n05. Dead Man's Fall\n06. Bird's Eye View\n07. Man of God\n08. Kurosawa\n09. Where Do All the Good Girls Go?\n10. Telephone Song\n11. Press Send\n12. Feel the Morning\n\nSince he penned &quot;Seymour Stein&quot; for 1998's The Boy with the Arab Strap, Belle &amp; Sebastian guitarist Stevie Jackson usually contributed at least one song per album. The tunes were nice counterpoints to Stuart Murdoch's and proved Jackson to have a nice way with a hook and a jangle. On his debut solo album, (I Can't Get No) Stevie Jackson, the initial question might be whether he could pull off an entire album's worth of songs all by himself. The answer is an unqualified yes. With songwriting help from friends Roy Moller and Gary Thom (the three of them known collectively as the Company) and musical backing from Pastel Katrina Mitchell on drums, Bill Wells on bass, Rose Melberg on backing vocal, and B&amp;S mates Bob Kildea, Sarah Martin, Mick Cooke, and Richard Colburn (among others), Jackson comes through with a batch of witty and catchy songs done in a variety of styles but always full of his trademark low-key charm. Jackson is a well-known lover of rock &amp; roll of all kinds and the album jumps from country-tinged balladry (&quot;Pure of Heart&quot;) and funky blue-eyed soul (&quot;Just, Just, So to the Point&quot;) to chiming folk-rock (&quot;Kurosawa&quot;) and quietly reflective songs (&quot;Bird's Eye View&quot;). His tender voice fits in perfectly no matter the style and the musicians he chose for the task are well up to it, always sounding just right. The strongest tracks on the album, though, are those that stick closest to the formula of his Belle &amp; Sebastian contributions: short, snappy pop songs with a little bit of soul, a dash of Zombies melancholy, and easy-to-sing-along-with melodies. The super hooky &quot;Try Me&quot; is the hit, but the record is filled with many of those kinds of bright and sunny-ish songs. He even gives Stuart Murdoch a run for his money on the pocket sweet soul symphony &quot;Man of God&quot; -- it would easily be a highlight of a B&amp;S record. Jackson may have been cast in the eternal sideman role in Belle &amp; Sebastian, but (I Can't Get No) Stevie Jackson shows without a doubt that he is a pop craftsman in his own right.","torrent":{"xt":"urn:btih:de82ec6185aa333d804f33deacd32b9e74fd5b7a","amp;dn":"Stevie+Jackson+-+%28I+Can%27t+Get+No%29+Stevie+Jackson+%5B2011%5D%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de82ec6185aa333d804f33deacd32b9e74fd5b7a","infoHashBuffer":{"type":"Buffer","data":[222,130,236,97,133,170,51,61,128,79,51,222,172,211,43,158,116,253,91,122]},"announce":[],"urlList":[]}}