{"title":"EnigmaT Set Rips { Cuts } - November 1st, 2013","uid":9130311,"size":749468457,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:deecc07f425e1a545fcd49e42279e928af98ee49&amp;dn=EnigmaT+Set+Rips+%7B+Cuts+%7D+-+November+1st%2C+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EnigmaT","files":86,"time":1383302075,"description":"2nd Phase - No Show (GDJB Rip)-enTc.mp3\n3LAU, Paris &amp; Simo Feat. Bright Lights - Escape (Maurin Remix) (Cut From StephDJ Set)-enTc.mp3\nAbstract Vision - Rocket (ASOT 637 Rip)-enTc.mp3\nAdam Szabo &amp; Johan Vilborg Feat. Johnny Norberg - Two To One (Jaco Remix) (ASOT 637 Rip)-enTc.mp3\nAgnelli Nelson pres. An Project - New Light (Protoculture Remix) (ASOT 637 Rip)-enTc.mp3\nAji Mon Nair - Let's Go Retro (Cut From Ronde Set)-enTc.mp3\nAllen Watts &amp; Billy Gillies - Afterburner (Allan Morrow Remix) (Cut From El Jay Set)-enTc.mp3\nAllen Watts &amp; Billy Gillies - Afterburner (Original Mix) (Cut From Uplift Set)-enTc.mp3\nArmin van Buuren - Last Stop Before Heaven (Maarten De Jong Remix) (ASOT 637 Rip)-enTc.mp3\nArmin van Buuren - Pulsar (Cosmic Gate Remix) (ASOT 637 Rip)-enTc.mp3\nArt Shumiloff &amp; Jenia - Roxanne (Your Shape) (Original Mix) (Cut From Ferry Set)-enTc.mp3\nAwd - ID (Original Mix) (Cut From Shiver Set)-enTc.mp3\nBaggi Begovic &amp; Team Bastian - Sleep Till I Come Home (Original Mix) (Cut From R3HAB Set)-enTc.mp3\nBastian Salbart - One More Day (Cut From MIKE Set)-enTc.mp3\nBeat Service - Undercover (ASOT 637 Rip)-enTc.mp3\nBeat Service - Undercover (GDJB Rip)-enTc.mp3\nCarl Orff - Carmina Burana (StarX &amp; Exceeder Remix) (Cut From StephDJ Set)-enTc.mp3\nCraig London - The Colour Of Gold (Original Mix) (Cut From London Set)-enTc.mp3\nCristian Arango - Poison (Cut From Patterson Set)-enTc.mp3\nDaniel Forster ft. Gringa - Next Place (Rolvario &amp; Thales Neves Remix) (Cut From StephDJ Set)-enTc.mp3\nDarren Tate feat. Jodie Elms - All I Am (Witness45 Remix) (Cut From Suzy Set)-enTc.mp3\nDinka - Waterproof (Original Mix) (Cut From Rusu Set)-enTc.mp3\nDonna Summer - MacArthur Park (Laidback Luke Dub Version) (Cut From R3HAB Set)-enTc.mp3\nEaston &amp; Christina Novelli - Already Gone (Original Mix) (Cut From Del Mar Set)-enTc.mp3\nErick Strong &amp; Eskova - Another Day Of Life (Alekzander Mainstage Dub) (Cut From Ben Gold Set)-enTc.mp3\nEssonita feat. Irina Makosh - Don't Try To Love Me (Ethillas Remix) (Cut From Suzy Set)-enTc.mp3\nFergie &amp; Sadrian - Anubis (Trip Remix) (Cut From Misja Set)-enTc.mp3\nFisherman &amp; Hawkins - Antidote (GDJB Rip)-enTc.mp3\nFred McLovin &amp; Vlad Rusu - Bongas (Original Mix) (Cut From Rusu Set)-enTc.mp3\nG8 &amp; Andski - Arcanum (Cut From MIKE Set)-enTc.mp3\nG8 &amp; Andski - Underworld (Cut From Bluehawk Set)-enTc.mp3\nGal Abutbul &amp; Sarah Russell - You Have Realised (Dub) (Cut From Ferry Set)-enTc.mp3\nGal Abutbul &amp; Sarah Russell - You Have Realised (Uplifting Remix) (Cut From Bobina Set)-enTc.mp3\nGouryella - Gouryella (Lee Osborne Mix) (Cut From Shiver Set)-enTc.mp3\nHazem Beltagui - Raising The Sail (ASOT 637 Rip)-enTc.mp3\nHeinrich Mendez - Mystery Trip (Cut From Ronde Set)-enTc.mp3\nImperfect Hope - Beat Your Soul (tranzLift Emotional Remix) (Cut From Uplift Set)-enTc.mp3\nIncipit Q - When the Night Comes (Cut From Durand Set)-enTc.mp3\nInvalyd featuring Polina - Never Coming Down (GDJB Rip)-enTc.mp3\nIzzy Meusen &amp; Beatsole - From Here To Chelyabinsk (Yura Moonlight Remix) (ASOT 637 Rip)-enTc.mp3\nJacob Plant - When I Say Go (Cut From Page Set)-enTc.mp3\nJames Dymond - Solidus (ASOT 637 Rip)-enTc.mp3\nJavah feat. Xan - Vice Of Life (4 Strings Remix - 2013 Re-Master) (Cut From Suzy Set)-enTc.mp3\nJohn Newall - Looking Ahead Part 2 (Original Mix)- (Cut From El Jay Set)-enTc.mp3\nJohnny Yono - Exodus (ASOT 637 Rip)-enTc.mp3\nJohnny Yono - Exodus (GDJB Rip)-enTc.mp3\nJordy Dazz - Torpedo (Original Mix) (Cut From R3HAB Set)-enTc.mp3\nJordy Dazz - Torpedo (Original Mix) (Cut From Rusu Set)-enTc.mp3\nKelly Andrew - Beyond The Stars (ASOT 637 Rip)-enTc.mp3\nKobana - Sighted (Cut From Ronde Set)-enTc.mp3\nKrewella - Lights &amp; Thunder (Y2Z REMIX) (Cut From StephDJ Set)-enTc.mp3\nLudowick - Jump (Cut From Patterson Set)-enTc.mp3\nManida - O'ahu Night (Original Mix) (Cut From Uplift Set)-enTc.mp3\nManida - Oahu Night (Original Mix) (Cut From Romel Set)-enTc.mp3\nMichael Wulff - Overdrive (Mike Spinner Remix) (Cut From Misja Set)-enTc.mp3\nMorvan - And She Smiles (Monoverse Remix) (Cut From Misja Set)-enTc.mp3\nNaden - Suspiro (Cut From Ronde Set)-enTc.mp3\nNaden - Suspiro (Original Mix) (Cut From Shiver Set)-enTc.mp3\nNadia Ali - Rapture (Craig London Bootleg Remix) (Cut From London Set)-enTc.mp3\nO.B.M Notion - Fatality (Etasonic Remix) (Cut From Del Mar Set)-enTc.mp3\nO.B.M Notion - Gravity (Manida Remix) (Cut From Romel Set)-enTc.mp3\nOiryal - Nostalgia (Original Mix) (Cut From Del Mar Set)-enTc.mp3\nOmina Feat. Everything by Electricity - Bones  (ASOT 637 Rip)-enTc.mp3\nOrjan Nilsen - Mafioso (Mark Sixma Remix) (ASOT 637 Rip)-enTc.mp3\nOrjan Nilsen - Mafioso (Mark Sixma Remix) (GDJB Rip)-enTc.mp3\nPaul van Dyk - For An Angel (Maison &amp; Dragen 2013 Reboot) (Cut From Xabi Set)-enTc.mp3\nPROFF &amp; Kaspar Kochker - One More Request (Bloodgroove &amp; Kikis Remix) (Cut From Ronde Set)-enTc.mp3\nRAM - Sledgehammer (Antillas Remix) (Cut From Ben Gold Set)-enTc.mp3\nRAM - Sledgehammer (Original Mix) (Cut From Bobina Set)-enTc.mp3\nSam Winstown - Don't Pretend (Club Mix) (Cut From Duguid Set)-enTc.mp3\nScience Deal vs Jerom - Decade {CC Anthem 2013} (Progressive Mix) (ASOT 637 Rip)-enTc.mp3\nScience Deal vs. Jerom - Decade (Progressive Mix) (GDJB Rip)-enTc.mp3\nSensetive5 - The Sand of Time (Main Mix) (GDJB Rip)-enTc.mp3\nShanahan - Euphony (Cut From First State Set)-enTc.mp3\nShiloh - Man In The Mirror (Alex Sonata Remix) (Cut From Bobina Set)-enTc.mp3\nSteve Dekay &amp; Stiben Dapper - Machlud (Original Mix) (Cut From Shiver Set)-enTc.mp3\nThe Chemical Brothers - Do It Again (Jewelz &amp; Scott Sparks Bootleg) (Cut From Rusu Set)-enTc.mp3\nThomas Gold feat. Kaelyn Behr - Remember (Original Mix) (Cut From Rusu Set)-enTc.mp3\nTiesto Feat. Kyler England - Take Me (Michael Brun Remix) (-Short- Cut From Rusu Set)-enTc.mp3\nTristan Garner - SevenCore (Cut From First State Set)-enTc.mp3\nVictor Fedorow - Scintilla (Original Mix) (Cut From Granddaddy Set)-enTc.mp3\nWrechiski - #Wearechange (Original Mix) (Cut From Del Mar Set)-enTc.mp3\nxeON - Mustang (Original Mix) (Cut From Rusu Set)-enTc.mp3\nZedd feat. Hayley Williams - Stay The Night (Schoolboy Remix) (Cut From First State Set)-enTc.mp3\nZiggy - Amilo (Original Mix) (Cut From R3HAB Set)-enTc.mp3\nZombie Nation - Kernkraft 400 (Riggi &amp; Piros Remix) (Cut From Rusu Set)-enTc.mp3\n","torrent":{"xt":"urn:btih:deecc07f425e1a545fcd49e42279e928af98ee49","amp;dn":"EnigmaT+Set+Rips+%7B+Cuts+%7D+-+November+1st%2C+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"deecc07f425e1a545fcd49e42279e928af98ee49","infoHashBuffer":{"type":"Buffer","data":[222,236,192,127,66,94,26,84,95,205,73,228,34,121,233,40,175,152,238,73]},"announce":[],"urlList":[]}}