{"title":"Methodic Doubt (2016)","uid":13193291,"size":39664058,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:df47b0ac5b430b1a511f7b500782dde6235e2ef0&amp;dn=Methodic+Doubt+%282016%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pBtu6RHs","files":11,"time":1452462619,"description":"Methodic doubt is the brainchild of composers kris dirksen and dane short. As self taught musicians and producers, the duo's lack of formal training has resulted in an irreverence for the traditional boundaries of film and television music, resulting in a genre-bending mix of sounds that reflects their eclectic musical influences. Crafting a signature blend of effected guitars, twisted electronics, and an ever-changing blend of live and orchestral instrumentation, the pair have always focussed on progression rather than aping current scoring trends.\r\n\r\nThe duo cut their teeth in the film trailer and video game advertising worlds and have amassed hundreds of credits to their name. In doing so, the pair have had the opportunity to work on blockbuster superhero campaigns, indie dramedies, and almost everything in between. This wide spectrum of advertising projects bred a great deal of versatility into the composers from the start of their careers.\r\n\r\n2013 saw methodic doubt's first forays into television and film scoring. The duo were tapped by showrunner greg yaitaines (house, lost) to score cinemax's action noir banshee (exec. Producer alan ball). On the feature side, the pair scored the warner bros./dc comics documentary necessary evil.\r\n\r\nIn addition to their work as a duo, in 2007 dane and kris launched methodic doubt music, a collective of artists, composers and producers creating premium quality music for film, television and video game advertising. Headquartered in los angeles with a satellite office in vancouver, canada, the company has a staff of 10, and works with a growing team of composers in brooklyn, new jersey, london, and more","torrent":{"xt":"urn:btih:df47b0ac5b430b1a511f7b500782dde6235e2ef0","amp;dn":"Methodic+Doubt+%282016%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df47b0ac5b430b1a511f7b500782dde6235e2ef0","infoHashBuffer":{"type":"Buffer","data":[223,71,176,172,91,67,11,26,81,31,123,80,7,130,221,230,35,94,46,240]},"announce":[],"urlList":[]}}