{"title":"Lynda.com - Effective Presentations","uid":7039301,"size":1999149848,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:e1eb4f3e00c24966c16500b5cf746fdbf44b3f3d&amp;dn=Lynda.com+-+Effective+Presentations&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LetalM","files":264,"time":1329484696,"description":"Lynda.com - Effective Presentations\nDescription\tCourse name:\nEffective Presentations (2006)\n\nAuthor:\nJeff Van West\n\nDuration:\n11h 06m\n\nReleased on:\n3/10/2006\n\nExercise files:\nYes\n\nSoftware works on:\nMac and Windows\n\nDESCRIPTION:\n\nAn estimated 30 million presentations are given every day in offices around the world. Judging from articles like &quot;PowerPoint is Evil&quot; (Wired) and &quot;PowerPoint Makes You Dumb&quot; (New York Times), which have been appearing in recent years, most of these presentations are probably not having the hoped-for effect. Jeff Van West wants to change all that. In Effective Presentations, Jeff will help transform your style and technique so that you will be making an impact with your dynamic presentations in no time. Jeff will teach you a structured yet flexible system to take you from concept, through design and development, and into delivery. In this video-based tutorial, Jeff tackles the complete process - from defining your mission and weaving a story, to the on-screen options for presenting data, selecting images, and integrating sound. Jeff also covers proven skills and techniques that will help prepare you to present. Exercise files accompany the training videos, allowing you to follow along and learn at your own pace.\n\nTopics include:\n\n  - Defining a presentation's single mission and supporting goals\n   -Writing for your speech, slides, and support materials\n   -Adjusting slide layout for maximum effect and readability\n   -Infusing slide content with meaning, context, and impact\n   -Appropriate use of sounds, images, and animation\n   -How to create supporting materials and integrate them into the presentation\n   -Rehearsing your technique and weaving in some tips from the pros\n   -Preparing the materials, the room, and yourself to present\n\n[b]","torrent":{"xt":"urn:btih:e1eb4f3e00c24966c16500b5cf746fdbf44b3f3d","amp;dn":"Lynda.com+-+Effective+Presentations","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1eb4f3e00c24966c16500b5cf746fdbf44b3f3d","infoHashBuffer":{"type":"Buffer","data":[225,235,79,62,0,194,73,102,193,101,0,181,207,116,111,219,244,75,63,61]},"announce":[],"urlList":[]}}