{"title":"Japanarama.Vol.1-3-INCOMPLETE.Ztatic.Redist.Pack-Z-Com","uid":4461128,"size":2893378672,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e23e715c2a045c4596ffcecae87c595a9c5b12e5&amp;dn=Japanarama.Vol.1-3-INCOMPLETE.Ztatic.Redist.Pack-Z-Com&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Z-Com","files":39,"time":1224706957,"description":"Japanarama.Vol.1-3-INCOMPLETE.Ztatic.Redist.Pack-Z-Com\n******************************************************\n\nThis Ztatic Redistribution Package is an INCOMPLETE collection of the Japanarama Volumes 1-3, former available by Too Far East on VHS from Kyoto, Japan, closed for orders since 2005. Its missing the 2nd hour of Vol. 2 and my vhs-rip of vol.1 is less than satisfactory. I will be adding a new, full rip of my original vhs-tapes of all 3 vol's when I get my new gear, but plz enjoy what is in the meantime....\n\n &lt;a href=&quot;\nhttp://too-far-east.tripod.com/japanarama/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://too-far-east.tripod.com/japanarama/index.html&lt;/a&gt;\n\n\nReviews: JAPANARAMA! Psycho TV From Japan \n-----------------------------------------\n\nShock Cinema -\n\nWelcome to a brain-numbing, two-hour compilation of the weirdest, most outrageous moments from current Japanese television. And despite a lack of subtitles, this is all so bizarre, fast-paced and colorful that few are needed. Although there are a few slow portions (music acts, clips from old movies), most of this is prime material. There's a game show where losers are bungee-catapulted over a gorge, naked, with flares strapped to their feet; transvestites try to apply their make-up while on a moving roller coaster; and a program makes its contestants (often underdressed females) sit in a tank of boiling water, in exchange for commercial air-time. Much of this is rather sadistic, but the contestants seem to love it! Theres an outdoor wrestling show where guys are tossed out of the ring, onto a giant glue-trap or a bed of fireworks; live scorpions are secretly placed on peoples heads; and men in bathing suits slam each other with buckets of hot wax, during a game of rock-paper-scissors. My favorite bits are the trippy commercials, which range from a (badly named) product called Funky Egg to a video store that proudly boasts of stocking rape and animal videos. Its particularly amusing to watch high-profile US stars happily kissing corporate ass in Japanese ads. There are car commercials with Mel Gibson, Brad Pitt, Jean Reno, Leonardo DiCaprio, and Ray Charles (who cant even drive a car!); a saki-peddling, samurai Madonna battling a lame CGI dragon; Michael J. Fox hawking fishing gear; and The Three Tenors for an airline. By far, the most annoying has Quentin Tarantino playing an action hero for Perfect TV. This vastly entertaining sampler of Japan's media madness makes excellent party fare, and almost made me think that American TV wasnt the most IQ-squashing fare on the planet, after all. \n\n-Steve Puchalski\n\n------------------\n\nVideoscope -\n\nToo Far East presents a compelling, even addictive compilation of clips culled from a wide array of wild and crazy Japanese TV shows, mostly of 1990s vintage. Much of the footage is devoted to some of Japan's notorious, cheerfully sadistic extreme game shows, which feature such imaginative stunts as a transvestite attempting to apply lipstick while riding a high-speed rollercoaster. Another, beach-set show pits a pair of pro wrestlers against amateurs selected from the crowd, with predictably painful results. Our fave is Super Jockey, where entrepreneurs and their ubiquitous fetching femme companions can spiel their products for the same amount of time that they succeed in spending immersed in a tank of boiling-hot water (!); additional suspense is provided by the time limit imposed to change their clothes behind a curtain before they're exposed to the audience. The cassette also includes scenes from music videos by the likes of the Piss Kids, scenes from Infra-man-type adventure series, a Candid Camera clone and a host of commercials starring American celebs, many of whom wouldn't consider performing the same chores Stateside: The list includes Brad Pitt, Madonna, Mel Gibson, Juliette Lewis and Quentin Tarantino (in a spot for PerfecTV). The tape is only sporadically subtitled, but in many cases subtitling would seem supremely superfluous.\n\n-Joe Kane\n\n--------------------\n\nPsychotronic Video -\n\nVolume 1 - This is professionally edited clips from recent Japanese TV with ridiculous, often dangerous and humiliating quiz show stunts, candid camera imitations, wrestling, musical numbers, a drag show and some Ultraman type heroes. Several shows feature giggling young girls in bikinis trying to stay in a clear tub of extremely hot water, doing push ups on a clear floor (filmed from below) and doing other routines designed to show off their bodies. You could say this is evidence of an insane, sick nation, but we probably shouldn't be the ones to judge. Seeing the celebrity commercials is a revelation. Cars are endorsed by Mel Gibson, Brad Pitt, Christian Slater, Leonardo DiCaprio, Ray Charles, and Juliette Lewis (who speaks some Japanese). Madonna shills for booze, Michael J. Fox for fishing rods and The Three tenors (!) for an airline. Other actors, models, and sport figures appear, but best of all is Quentin Tarantino in a violent, funny, action packed spot for satellite dishes. I wonder if he directed it too. \n\nVolume 2 - Nudity and painful, stupid and sadistic gags are common on modern Japanese TV shows. Some take Candid Camera ideas to new extremes. Many examples are on this enlightening compilation, along with commercials (many for beer and cigarettes, one uses &quot;Papa Oom Mow Mow&quot;) and musical segments. A guy lights his farts and wrestlers are even wackier than American ones (and check out the blackface Don King imitator). &quot;Robamimi&quot; (a weather girl) wears a metal bra that pops open in public places and there's a public bath quiz show with nearly naked females jumping out of the water to push a buzzer. The most unsettling clips are men going gaga over tall American blondes with huge, bare, cartoonish silicone breasts. I liked the ad for the local version of Annie, a vintage 60s Ventures style instrumental band clip and the silly, FX laden video for the girl singing group Puffy. Shameless celebs seen making big easy bucks include a Samurai Madonna (booze), Jodie Foster (coffee latte), Dennis Rodman, Ringo Starr, Brad Pitt, Liv Tyler, members of Kiss, Beavis and Butthead and Demi Moore and Bruce Willis (not together). Two fun ads for cell phones feature Quentin Tarantino with Sonny Chiba (!). And then there's all the fish, insects and lizards....\n\n-Michael J. Weldon\n\n---------------------\n\n","torrent":{"xt":"urn:btih:e23e715c2a045c4596ffcecae87c595a9c5b12e5","amp;dn":"Japanarama.Vol.1-3-INCOMPLETE.Ztatic.Redist.Pack-Z-Com","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e23e715c2a045c4596ffcecae87c595a9c5b12e5","infoHashBuffer":{"type":"Buffer","data":[226,62,113,92,42,4,92,69,150,255,206,202,232,124,89,90,156,91,18,229]},"announce":[],"urlList":[]}}