{"title":"10 Minute Solution Quick Tummy Toners with Jessica Smith [MP4]","uid":11821645,"size":1077750545,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:e38887a90924283ca6da6609f21ffde1a58c00c1&amp;dn=10+Minute+Solution+Quick+Tummy+Toners+with+Jessica+Smith+%5BMP4%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"elessedilgirl","files":7,"time":1429281200,"description":"No time to exercise? We have the soltuion for you - the 10 Minute Solution! Everyone can find at least ten minutes in their day, and we've developed 5 tummy toning workouts that are just 10 minutes each. These quick workouts will help shrink your workout time and your waistline. Compact and ultra efficient, the 10 minute belly blasts fit into even the busiest of schedules. Splt them into 5 separate workouts or do them all together for the ultimate belly fat attack!\n\nCrunch Free Abs\nNo need for bunches of crunches to get a toned tummy. This workout will tighten your entire midsection without a single crunch\n\nYoga Abs\nEver heard that stress contributes to abdomincal fat? In this segment, use specific yoga poses to relieve stress and tension while building strong, flat abs.\n\nBikini Belly\nCombine calorie burning cardio with standing ab exercises to sculpt your six pack and blast away fat. This multi- tasking workout will get your belly into bikini shape- fast.\n\nAB &amp; Waist Definer\nuse specially designed rotational exercises to twist and turn your tummy into shape. these moves have acinching effect on your midsection to create a beautifully defined waistline.\n\nSex, Sporty Abs\nStrong abs are sexy. These all tiem favorite exercises will build strong, functional abs that are great for improving your game or jsut showing off at the beach!\n\nVideo; x264; 714*578 (4:3); 2448 kbps; 25.000 fps\nAudio; aac; 160 kbps; 2 ch; 48.0 Khz","torrent":{"xt":"urn:btih:e38887a90924283ca6da6609f21ffde1a58c00c1","amp;dn":"10+Minute+Solution+Quick+Tummy+Toners+with+Jessica+Smith+%5BMP4%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e38887a90924283ca6da6609f21ffde1a58c00c1","infoHashBuffer":{"type":"Buffer","data":[227,136,135,169,9,36,40,60,166,218,102,9,242,31,253,225,165,140,0,193]},"announce":[],"urlList":[]}}