{"title":"Essentials of Polymer Science and Engineering","uid":12423501,"size":39642935,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e38d455fc6ccbffccb437dc9b08370c78fdc0598&amp;dn=Essentials+of+Polymer+Science+and+Engineering&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1442339050,"description":"Essentials of Polymer Science and Engineering (Paul C Painter, Michael M Coleman).pdf\n\nISBN 9781932078756\n\nThis book is at once an introduction to polymers and an imaginative invitation to the field of polymer science and engineering as a whole, including plastics and plastics processing. Created by two of the best-known scientists in America, the text explains and helps students as well as professionals appreciate all major topics in polymer chemistry and engineering: polymerization synthesis and kinetics, applications of probability theory, structure and morphology, thermal and solution properties, mechanical properties, biological properties and plastics processing methods. Essentials of Polymer Science and Engineering, designed to supercede many standard texts (including the authors'), is unique in a number of ways. Special attention has been paid to explaining fundamentals and providing high-level visuals. In addition, the text is replete with engaging profiles of polymer chemists and their discoveries. The book explains the science of polymer engineering, and at the same time, tells the story of the field from its beginnings to the present, indicating when and how polymer discoveries have played a role in history and society. The book comes well equipped with study questions and problems and is suitable for a one- or two-semester course for chemistry students at the undergraduate and graduate levels","torrent":{"xt":"urn:btih:e38d455fc6ccbffccb437dc9b08370c78fdc0598","amp;dn":"Essentials+of+Polymer+Science+and+Engineering","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e38d455fc6ccbffccb437dc9b08370c78fdc0598","infoHashBuffer":{"type":"Buffer","data":[227,141,69,95,198,204,191,252,203,67,125,201,176,131,112,199,143,220,5,152]},"announce":[],"urlList":[]}}