{"title":"Erich Fromm - Two audiobooks on philosophy, psychoanalysis, poli","uid":4028744,"size":112437278,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:e3dd5858454ffad96349a08e370f6c76d6555137&amp;dn=Erich+Fromm+-+Two+audiobooks+on+philosophy%2C+psychoanalysis%2C+poli&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HenKaiPan","files":8,"time":1203057093,"description":"Two books by Erich Fromm, internationally renowned Jewish-German-American social psychologist, psychoanalyst, and humanistic philosopher. He was associated with that became known as the Frankfurt School of critical theory.\n\n\n\n\nThe Art of Loving\n\nFromm&amp;#039;s most popular book, it was an international bestseller and recapitulated and complemented the theoretical principles of human nature found in Escape from Freedom and Man for Himself, principles which were revisited in many of Fromm\\&amp;#039;s other major works. In this work love is presented as a skill that can be taught and developed. It opposes the idea of loving as something magic and mysterious that cannot be analyzed and explained.\n\n\n\nThe Art of Being\n\nThis classic work by psychologist and social philosopher Eric Fromm builds upon his previous popular book &quot;To Have or to Be&quot;. The Art of Being teaches us to avoid the tantalizing illusions of our consumer-driven world by learning to function as a whole person from a state of inner completeness or being. The transition from an identity of having to being creates a state of enlightened psychological and spiritual happiness. Fromm observes that the modern person is less a self-reflective being than a composite of data promoted by the mass media, and he encourages us to pursue true self-awareness beyond simple political, ideological, and religious clichÃƒ?Ã‚Â©s. By learning to be centered in the self, the individual is less swayed by the endless pressures and dissatisfactions of the culture of consumerism.\n\n\nall text from Wiki and Amazon\n\nShare philosophy audio!","torrent":{"xt":"urn:btih:e3dd5858454ffad96349a08e370f6c76d6555137","amp;dn":"Erich+Fromm+-+Two+audiobooks+on+philosophy%2C+psychoanalysis%2C+poli","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3dd5858454ffad96349a08e370f6c76d6555137","infoHashBuffer":{"type":"Buffer","data":[227,221,88,88,69,79,250,217,99,73,160,142,55,15,108,118,214,85,81,55]},"announce":[],"urlList":[]}}