{"title":"Human History viewed as SOVEREIGN INDIVIDUALS versus MANIPULATED","uid":3638347,"size":602991,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e419f834d4b22293b8ba3d7b18c8dfac64cbbdf7&amp;dn=Human+History+viewed+as+SOVEREIGN+INDIVIDUALS+versus+MANIPULATED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"qutec","files":1,"time":1173782938,"description":"This is the highly revealing booklet Human History viewed as SOVEREIGN INDIVIDUALS versus MANIPULATED MASSES (1986) from Valorian Society. This joint work by a secluded group of highly perceptive writers views the historical and current problem of humans as two opposing cultures that cannot be mixed. The culture of sovereign individuals has had to fight a two front battle against manipulated masses - manipulated by overt force in the East, and manipulated by brainwashing in the Western World. TV brainwashing by internationalists and the unconstitutional use of money as manipulative force in the U.S. now threatens to produce one worldwide totalitarian human entity. This is the historic viewpoint which usually gets omitted from history books since there you only see the \\&quot;conflict\\&quot; between for example Hitler and Stalin. In reality there was no conflict between them as both were skillful manipulators in pursuit of totalitarian power. The only conflict was between the manipulators and opressed masses. This is the perspective an ordinary man should know about since it most affects him. 100 pages. A must read for everyone.\n\nFrom the backcover:\nHumans are now poisoning the earth and manufacturing weapons for atomic war. Public \\&quot;educators\\&quot; have the task of preparing children to accept and become part of this kind of \\&quot;humanity\\&quot;. They present history\\&amp;#039;s known facts with a view to promoting acceptance of \\&quot;the way things are\\&quot;. The writers of this work have detached themselves from this kind of \\&quot;humanity\\&quot; and, having a need to explain the reason for their detachment to their children, have looked at history\\&amp;#039;s known facts from a different perspective. Human History, as here presented, is the other side of history\\&amp;#039;s coin. Looking at both sides restores balance - and provides and inducement to again consider possible solutions to the, seemingly unsolvable, human problem.","torrent":{"xt":"urn:btih:e419f834d4b22293b8ba3d7b18c8dfac64cbbdf7","amp;dn":"Human+History+viewed+as+SOVEREIGN+INDIVIDUALS+versus+MANIPULATED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e419f834d4b22293b8ba3d7b18c8dfac64cbbdf7","infoHashBuffer":{"type":"Buffer","data":[228,25,248,52,212,178,34,147,184,186,61,123,24,200,223,172,100,203,189,247]},"announce":[],"urlList":[]}}