{"title":"Dalida - Her Greatest Hits - 2CD 2011","uid":9349702,"size":638436523,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e58347bde3c91a44fe70ceadcd9f094347e6a4bf&amp;dn=Dalida+-+Her+Greatest+Hits+-+2CD+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"barber9","files":-1,"time":1387101605,"description":"Born Yolande Christina Gigliotti of Italian parents on January 17, 1933 in Shoubra, a district of Cairo, Egypt, she was the child of an opera violinist and was given singing lessons at an early age. She developed into a beautiful young lady, and in 1954 she won the Miss Egypt beauty contest and immediately left for Paris, France to pursue a career in motion pictures. \n\n\nDespite her looks, her first films were less than successful, but she began performing in music halls and cabarets, singing in French, Italian and other languages. Using the stage name, Dalida, she recorded songs, her second single titled Bambino, brought instant fame. In 1957, she appeared at the Paris Olympia as the opening act for Charles Aznavour and later the same year for Gilbert Becaud. She would go on to record in several languages, touring the globe including sold-out performances at Carnegie Hall in New York City. \n\nDuring her career, Dalida recorded 500 French songs, 200 of which were translated into Italian, and 200 into other languages. She sold more than 80 million records world-wide, winning numerous awards, scoring 55 gold records. Yet, despite her fame and fortune, her personal life was difficult and filled with much drama and tragedy. In 1961 she married her mentor Lucien Morisse, but the marriage lasted only a few months when she left him for the painter Jean Sobieski (later the father of American actress Leelee Sobieski). A few years later, her still distraught ex-husband died of a self-inflicted gunshot wound. \n\nIn 1967 her new lover, the Italian singer, Luigi Tenco also took his own life and Dalida too attempted suicide. She was living with the flamboyant and less than reputable, Richard Chanfray (referred to as the Comte de St Germain) when he took his own life in July 1983. She recovered from these tragedies and continued to perform but by her own accounts, life had little meaning and she spent years searching for personal fulfillment, including traveling to Nepal to study the Hindu religion. \n\n\nOn May 3, 1987 she died as a result of an overdose of sleeping pills leaving behind a suicide note that said: Life has become unbearable ... forgive me. \n\nDalida is buried in the Cimetiere de Montmartre, Paris, France, her gilded life-size statue one of the most outstanding of the many sculpted works in the famous cemetery. \n\nIn 1997, the angle of the rues Girardon and Abreuvoir in Paris were inaugurated as Place Dalida. (biographybase.com)\n\n- - -\n\nDalida - Her Greatest Hits\n(2CD ZYX Music 2011)\n\n 1. Bambino  \n 2. Flamenco Bleu  \n 3. Madona  \n 4. Eh Ben! \n 5. Les Gitans  \n 6. Je Pars \n 7. Tu M'etait Destin  \n 8. Guitare Et Tambourin   \n 9. Marina   \n10. J'ai R   \n11. Du Moment Qu'on S'aime  \n12. Du Moment Qu'on S'aime   \n13. L'amour Chante  \n14. C'est Ca L'amore \n15. Love In Portofino   \n16. Luna Caprese   \n17. Tout L'amour  \n18. La Chanson D'orphee  \n19. Ciao Ciao Bambina \n20. Marie Marie...\n21. Am Tag Als Der Regen Kam  \n22. Marchande De Fruits    \n23. Aie! Mon Coeur   \n24. Maintenant   \n25. Helena  \n26. Adieu Mon Amour \n27. Buenas Noches Mi Amor \n28. Quand On A Que L'amour   \n29. Le Ranch De Maria  \n30. Lazarelle \n31. Pour Garder  \n32. Le Petit Chemin De Pierre \n33. Por Favor \n34. Histoire D'un Amour  \n35. Gondolier \n36. Ay! Mourir Pour Toi \n37. Le Jour O   \n38. Gitane    \n39. Aime-moi  \n40. Hava Naguila\n","torrent":{"xt":"urn:btih:e58347bde3c91a44fe70ceadcd9f094347e6a4bf","amp;dn":"Dalida+-+Her+Greatest+Hits+-+2CD+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e58347bde3c91a44fe70ceadcd9f094347e6a4bf","infoHashBuffer":{"type":"Buffer","data":[229,131,71,189,227,201,26,68,254,112,206,173,205,159,9,67,71,230,164,191]},"announce":[],"urlList":[]}}