{"title":"Invitacion a la filosofia - Andre Comte-Sponville.pdf","uid":8921165,"size":12267034,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e5b2fe14d68c9733112b2286bb651c6e3eb18595&amp;dn=Invitacion+a+la+filosofia+-+Andre+Comte-Sponville.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sponville","files":-1,"time":1379258648,"description":"Filosofar es pensar por uno mismo, pero nadie puede lograrlo verdaderamente sin apoyarse en el pensamiento de otros, y especialmente en los grandes filosofos del pasado. La filosofia no es solamente una aventura. Es tambien un trabajo que no puede hacerse sin esfuerzo, sin lecturas, sin herramientas. Los primeros pasos suelen ser arduos y desaniman a mas de uno. Esta es la razon por la que, durante los ultimos anos, el autor de este libro ha publicado sus Cuadernos de filosofia. En que consisten? En una coleccion de iniciacion a la filosofia: doce pequenos volumenes que incluyen, cada uno de ellos, una seleccion de unos cuarenta textos, normalmente muy breves, y que se abrian con una introduccion de un par de paginas en la que se intenta decir lo que a Comte Sponville le parece esencial sobre tal o cual nocion. Estas doce introducciones, revisadas y considerablemente ampliadas, constituyen el presente volumen. Su pretension sigue siendo modesta: continuan siendo una iniciacion, una especie de puerta de acceso, entre otras muchas posibles, a la filosofia. Pero, tras su lectura, es el lector quien debe descubrir por si mismo las obras, algo que habra de hacer tarde o temprano, y confeccionar, si asi lo desea, su propia antologia. Veinticinco siglos de filosofia constituyen un tesoro inagotable. Si este librito es capaz de animar a alguien a acercarse a el, si logra ayudarle a deleitarse en el y a aportarle ideas, entonces no habra sido escrito en vano.","torrent":{"xt":"urn:btih:e5b2fe14d68c9733112b2286bb651c6e3eb18595","amp;dn":"Invitacion+a+la+filosofia+-+Andre+Comte-Sponville.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5b2fe14d68c9733112b2286bb651c6e3eb18595","infoHashBuffer":{"type":"Buffer","data":[229,178,254,20,214,140,151,51,17,43,34,134,187,101,28,110,62,177,133,149]},"announce":[],"urlList":[]}}