{"title":"Caligula's Horse Discography","uid":10513994,"size":229422779,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e634f0c6133bcb420995c951d130634b11ae1025&amp;dn=Caligula%27s+Horse+Discography&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"buginya","files":19,"time":1404882356,"description":"Caligula's Horse biography\n\nTaking their name from the mad Roman emperor and his beloved steed Incitatus, CALIGULA'S HORSE is an Australian progressive rock/metal band intent on bridging the gap between dynamic, meaningful songwriting and instrumental prowess.\n\n\nThe brainchild of guitarist, songwriter and producer Sam Vallen, CALIGULA'S HORSE - initially composed of just Vallen and vocalist Jim Grey - released its digital debut &quot;Moments From Ephemeral City&quot; in April 2011, and received instant acclaim from lovers of all strains of progressive music across many continents. Originally intended as a studio-only project, Vallen and Grey put out feelers for a live band soon after the album's release, assembling the current lineup of Geoff Irish on drums, Zac Greensill on guitar and Dave Couper on bass and vocals.\n\n\nCALIGULA'S HORSE's approach to songwriting is uncompromisingly eclectic, but no less accessible to audiences of all different musical styles. They take influence from such bands and artists as Devin Townsend, Pain Of Salvation, Opeth, Meshuggah, Porcupine Tree, Steve Vai, Frost, Periphery, Karnivool, Muse, Steely Dan, The Beatles, and Frank Zappa amongst many others.\n\n\n\nAfter months of rehearsing the recorded material, and also recording two additional tracks as the &quot;Colossus&quot; EP - released in September of 2011 - the &quot;C-HORSE&quot;, as some devotees like to abbreviate it to kicked off with live shows in October 2011. These are early days for a diverse and enthusiastic bunch of young virtuosos, but 2012 looks to be the breakout year for CALIGULA'S HORSE.\n\nFind Caligula's Horse on facebook at:\n\n++++++++\n\nGreat Prog!!  Support the artist.  Buy if you like.","torrent":{"xt":"urn:btih:e634f0c6133bcb420995c951d130634b11ae1025","amp;dn":"Caligula%27s+Horse+Discography","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e634f0c6133bcb420995c951d130634b11ae1025","infoHashBuffer":{"type":"Buffer","data":[230,52,240,198,19,59,203,66,9,149,201,81,209,48,99,75,17,174,16,37]},"announce":[],"urlList":[]}}