{"title":"Monster Jam Path Of Destruction [USA][PS3][English][www.consolas","uid":6049609,"size":1915739107,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:e66abeed9ec6fd87af8c2f13fd0e12bf5bba0324&amp;dn=Monster+Jam+Path+Of+Destruction+%5BUSA%5D%5BPS3%5D%5BEnglish%5D%5Bwww.consolas&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"consolasatope","files":43,"time":1292632940,"description":"Plataforma: PlayStation 3\nGÃƒÂ©nero: ConducciÃƒÂ³n, DestrucciÃƒÂ³n, Arcade\nDesarrollado por: --\nDistribuido por: Activision\nTambiÃƒÂ©n disponible en: X360  Wii  PSP  DS\nRegion: USA\nIdiomas: English\n\nResumen:\nGet behind the wheel of the world's biggest and baddest monster trucks and prove you're the best at the Monster Jam World Finals! Monster Jam 3: Path of Destruction is all about authenticity, personality and fun, with 30 officially licensed Monster Jam trucks, including fan-favorites Grave Digger, Maximum Destruction, and Grinder. You can also create and customize your own trucks with thousands of options, unlocking new parts and upgrades as you progress through the game.Eight real life stadiums from the Monster Jam circuit help bring the live atmosphere to the living room, with explosive truck introductions, pyrotechnics and lighting, all happening before a roaring crowd. In single player mode the goal is the same as for real life drivers - rise through the ranks of ruthless competitors to ultimately battle against the best at the Monster Jam World Finals. Plus, head-to-head multiplayer modes take the heart-pounding competition to another level. And best yet, get the true Monster Truck experience with the Playstion 3 and Wii exclusive Monster Jam Grave Digger Custom Steering Wheel peripheral, included in special edition Monster Jam 3: Path of Destruction PS3 and Wii game packages. Combine it with your Playstation 3 or Wii remote controller for a true steering feel. It's the most authentic Monster Jam action ever!\n\nFeatures:\n* Authentic Monster Trucks: Grave Digger, Maximum Destruction, Blue Thunder and more that look and handle like their real-life counterparts\n* Authentic Setting: Perform in a live event with unique truck introductions, pyrotechnics, stage lighting and a thunderous crowd!\n* Create and Customize Your Own Truck: Create your very own Monster Truck with thousands of options and unlock new parts and performance upgrades\n* Authentic Action: Experience what driving a Monster Truck is all about in stadium racing, freestyle, stunt challenges, circuit racing and more - even challenge your friends in head-to-head multiplayer!\n* Special bonus: Includes a Monster Jam Gravedigger Custom Steering Wheel peripheral to use with your Playstation 3 controller for a true Monster Jam experience.. ","torrent":{"xt":"urn:btih:e66abeed9ec6fd87af8c2f13fd0e12bf5bba0324","amp;dn":"Monster+Jam+Path+Of+Destruction+%5BUSA%5D%5BPS3%5D%5BEnglish%5D%5Bwww.consolas","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e66abeed9ec6fd87af8c2f13fd0e12bf5bba0324","infoHashBuffer":{"type":"Buffer","data":[230,106,190,237,158,198,253,135,175,140,47,19,253,14,18,191,91,186,3,36]},"announce":[],"urlList":[]}}