{"title":"Roger Waters - Project K.A.O.S","uid":9136199,"size":402515347,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:e83afe4a29d48a9763803ad4591558763eb4d4ab&amp;dn=Roger+Waters+-+Project+K.A.O.S&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"}{eywood","files":18,"time":1383417350,"description":"Project KAOS is a variation on the Radio KAOS album that is more true to the original concept than the released version.  This is more of what Roger had in mind, but the record company restricted him to the length of one album.  Oh if only CDs were the standard back then instead of a new and not fully accepted technology.\n\nRadio KAOS is underrated because its deeply flawed.  A lot of the material intended for it was left off, and that leaves the story barely discernable.  It caused Roger to have to include a plot outline in the booklet, something he never had to do before.  Going to Live in L.A., for example, is essential to the story line, but is missing.  On side one you're in England, then all of a sudden on side 2 you're in LA with no explanation.\n\nThis uses all the available official material from the KAOS period that relates to the concept (the pseudo live version of Money from the Sunset Strip single is not on here, as it has nothing to do with the story) as well as a couple things from the When The Wind Blows soundtrack.  Sources used for this are the Radio KAOS CD, the extended single version of Radio Waves and Molly's Song, the KAOS Video EP, the Banded Radio KAOS album (the radio version without all the Jim Ladd banter) and the When The Wind Blows OST.  The Billy voice before The Tide Is Turning was generated with Superior Software's SPEECH! program created for the Commodore 64 computer in 1986.  \n\nThis version is a little different and more finely tuned than the older releases that have turned up.  I've also seen copies of this that were obviously done by someone other than myself, though not as well, I think.  This is the real deal and should be considered the definitive version.  I Honestly will never listen to the official Radio KAOS ever again now that this exists, and I haven't for many years.\n\nYou want to know the sources?  In detail?  I can do that.\n\nThe radio tuning and station ID at the start are from the 20 minute Video KAOS VHS tape.\n\nGet Back To Radio is from the 12&quot; single of The Tide Is Turning\n\nRadio Waves is a composite I made from the CD version and the 12&quot; extended version.  That version had the instrumental verse at the start, and had a different ending.  I used portions of it to create a new middle section for the CD version\n\nWho Needs Information is from the standard Radio KAOS CD with extra dialogue at the start from Video KAOS\n\nFolded Flags is from the When The Wind Blows soundtrack.\n\nMe Or Him is from the CD, as is The Powers That Be.\n\nGoing To Live In LA is from the 12&quot; single for Radio Waves.\n\nThe Fish Report With A Beat is from Video KAOS.\n\nSunset Strip is from the CD, but the last note is from the banded version of Radio KAOS, a special mix made for radio stations with every song separated and all of Jim Ladd's talk removed.  All the tracks have clean starts and endings, Home being the most obvious because the drum track is clean, none of that &quot;I don't like fish&quot; and &quot;I'd like to be home with my monkey and my dog&quot; stuff.\n\nMolly's Song is the B-side to Who Needs Information.  Although this song was written for the album, and a reprise of it appears as part of Four Minutes, it was never recorded.  A live version was used for the single.\n\nHome is from the CD, but a couple beats at the start were cut in from the banded LP and a line of Jim's dialogue was added from Video KAOS.\n\nFour Minutes is from the CD with additional Billy dialogue from Video KAOS.\n\nThe Tide Is Turning is from the CD with additional Billy dialogue generated with the program &quot;Speech!&quot; created for the Commodore 64 computer in 1986.  This is the same software used for the voice on the album.  I had Billy say &quot;There must be more to life than lucky strikes and some unlucky ones&quot; which is part of the Folded Flags lyrics.  &quot;I just wanted everyone to know what it felt like.  You.  Me. And the powers that be.&quot; is what Billy says in this spot in the concerts.  I thought it gave more serious impact to the faux nuclear destruction to have 8 seconds of silence and then that.\n\nPipes And Drums is just a name I made up based upon rest of the line in Folded Flags &quot;There must be more to life than lucky strikes and some unlucky ones, and folded flags, and pipes, and drums&quot;.  Since the Folded Flags song is on there I thought it would be nice to reprise it with a similar musical theme and name it sympathetically.  The song is actually called Hilda's Dream, and its off the When The Wind Blows soundtrack.\n\n\n01 Get Back To Radio\n02 Radio Waves\n03 Who Needs Information\n04 Folded Flags\n05 Me Or Him\n06 The Powers That Be\n07 Going To Live In L.A.\n08 The Fish Report With A Beat\n09 Sunset Strip\n10 Molly's Song\n11 Home\n12 Four Minutes\n13 The Tide Is Turning (After Live Aid)\n14 Pipes And Drums\n\n\n\n\n","torrent":{"xt":"urn:btih:e83afe4a29d48a9763803ad4591558763eb4d4ab","amp;dn":"Roger+Waters+-+Project+K.A.O.S","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e83afe4a29d48a9763803ad4591558763eb4d4ab","infoHashBuffer":{"type":"Buffer","data":[232,58,254,74,41,212,138,151,99,128,58,212,89,21,88,118,62,180,212,171]},"announce":[],"urlList":[]}}