{"title":"The Enemy Bin Laden - epub (Hitchens)","uid":6406213,"size":73277,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e86f720750054107f7aa13d877b9e87ce2a77701&amp;dn=The+Enemy+Bin+Laden+-+epub+%28Hitchens%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bookzilla","files":-1,"time":1305815507,"description":"Celebrated polemicist Christopher Hitchens, author of God Is Not Great: How Religion Poisons Everything, reflects upon the life and death of Osama bin Laden in this sobering Kindle Single. This isn't the first time Hitchens has turned his barbed pen on a despot guilty of drinking too much of his own bloody Kool-Aid. But &quot;bin Ladenism,&quot; he argues, &quot;like other nihilistic movements, is ultimately doomed to fail.&quot; Lest you take any comfort from this assertion, he is then quick to remind us that &quot;the war against superstition and the totalitarian mentality is an endless&quot; one. It's a war Hitchens thinks is worth fighting, though, and this rousing Kindle Single serves as his call to arms. --Erin Kodicek \nProduct Description\nIn a brilliant essay on the death of Osama bin Laden, Christopher Hitchens insists that the necessity to resist the threat of theocratic fanaticism is by no means cancelled. Hitchens argues that bin Laden and his adherents represented the most serious and determined and bloodthirsty attempt to revive totalitarian and racist ideology since 1945. Further, that while the unending struggle for reason is entitled to take some especial comfort in his demise, the values of secularism, libertarianism, internationalism, and solidarity will always need to be defended and reaffirmed. \n\n2011\nPrint Length: 17 pages \n \n","torrent":{"xt":"urn:btih:e86f720750054107f7aa13d877b9e87ce2a77701","amp;dn":"The+Enemy+Bin+Laden+-+epub+%28Hitchens%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e86f720750054107f7aa13d877b9e87ce2a77701","infoHashBuffer":{"type":"Buffer","data":[232,111,114,7,80,5,65,7,247,170,19,216,119,185,232,124,226,167,119,1]},"announce":[],"urlList":[]}}