{"title":"Pena de muerte[dvdrip][spanish]","uid":6717770,"size":736974848,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e889792a375c2502de28578a8d4814e44a67efc1&amp;dn=Pena+de+muerte%5Bdvdrip%5D%5Bspanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Black1000","files":-1,"time":1317649893,"description":"Pena de muerte\n\nAÃƒÂ±o: 1995\n\nDuraciÃƒÂ³n: 120 min\n\nReparto: Susan Sarandon, Sean Penn, Robert Prosky, Margo Martindale, Celia Weston, Raymond J. Barry, R. Lee Ermey, Scott Wilson\n\nGÃƒÂ©nero: Drama\n\nSinopsis\n\nInspirada en una historia real sobre la profunda relaciÃƒÂ³n surgida entre una monja y un condenado a muerte en una cÃƒÂ¡rcel americana, esta pelÃƒÂ­cula supone un provocador examen sobre el crimen y el castigo. Susan Sarandon consiguiÃƒÂ³ con ella ganar un Oscar a la Mejor InterpretaciÃƒÂ³n Femenina en 1995 y Sean Penn fue nominado como Mejor Actor. Pena de Muerte es una pelÃƒÂ­cula conmovedora y absorbente con un argumento original y cautivador que te mantendrÃƒÂ¡ atento desde el principio hasta el final de la pelÃƒÂ­cula. Helen Prejean (Sarandon) es una monja compasiva de Nueva Orleans que actÃƒÂºa como consejera espiritual de Mathew Poncelet (Penn), un violento asesino que espera el dÃƒÂ­a de su ejecuciÃƒÂ³n en el corredor de la muerte, y cuya misiÃƒÂ³n principal es ayudar a las personas tales como Mathew a encontrar su salvaciÃƒÂ³n. Aunque a veces indagar demasiado puede llevarte a encontrar el lado mÃƒÂ¡s oscuro y malvado del hombre, la hermana Helen piensa que toda persona tiene su lado bueno. Ahora su principal tarea serÃƒÂ¡ conseguir el tiempo suficiente y retrasar la ejecuciÃƒÂ³n para salvar a Mathew y demostrar a todos que nadie tiene por quÃƒÂ© ser ejecutado por muy atroz que haya sido su pasado.\n\n","torrent":{"xt":"urn:btih:e889792a375c2502de28578a8d4814e44a67efc1","amp;dn":"Pena+de+muerte%5Bdvdrip%5D%5Bspanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e889792a375c2502de28578a8d4814e44a67efc1","infoHashBuffer":{"type":"Buffer","data":[232,137,121,42,55,92,37,2,222,40,87,138,141,72,20,228,74,103,239,193]},"announce":[],"urlList":[]}}