{"title":"Volcanic and Tectonic Hazard Assessment for Nuclear Facilities","uid":12694601,"size":23845379,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e94c1fd923bcfe4448cd7c0fab733f2b6a165d28&amp;dn=Volcanic+and+Tectonic+Hazard+Assessment+for+Nuclear+Facilities&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1446716806,"description":"Volcanic and Tectonic Hazard Assessment for Nuclear Facilities (Cambridge University Press, 2009).pdf\r\n\r\nISBN 9780521887977\r\n\r\nGeoscientists worldwide are developing and applying methodologies to estimate geologic hazards associated with the siting of nuclear facilities. Understanding such hazards, particularly in the context of the long functional lifetimes of many nuclear facilities, is challenging. This book documents the current state-of-the-art in volcanic and tectonic hazard assessment for proposed nuclear facilities, which must be located in areas where the risks associated with geologic processes are quantifiable and demonstrably low. Specific topics include overviews of volcanic and tectonic processes, the history of development of hazard assessment methodologies, description of current techniques for characterizing hazards, and development of probabilistic methods for estimating risks. Hazard assessment examples are drawn from around the world. This volume will promote interest and debate about this important topic among researchers and graduates developing methods in geologic hazard assessment, geologists and engineers who assess the safety of nuclear facilities, and regulatory bodies that evaluate such assessments","torrent":{"xt":"urn:btih:e94c1fd923bcfe4448cd7c0fab733f2b6a165d28","amp;dn":"Volcanic+and+Tectonic+Hazard+Assessment+for+Nuclear+Facilities","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e94c1fd923bcfe4448cd7c0fab733f2b6a165d28","infoHashBuffer":{"type":"Buffer","data":[233,76,31,217,35,188,254,68,72,205,124,15,171,115,63,43,106,22,93,40]},"announce":[],"urlList":[]}}