{"title":"Love in the Balance Series by Jessica Lemmon","uid":9150022,"size":486977,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:eab1eafedb8d2342de764ee9acd29cdab04ac9fa&amp;dn=Love+in+the+Balance+Series+by+Jessica+Lemmon&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"420weedman","files":2,"time":1383672450,"description":"Can't Let Go\nA LOVE IN THE BALANCE NOVELLA\nAN INSTANT SPARK\nSadie Howard would never admit there's such a thing as love at first sight, but she can't deny the connection between her and sexy Adonis Aiden Downey. She also can't deny she loves to kiss him-his mouth might be his most precious asset. Despite every promise to herself not to get involved any deeper than a first date, she can't keep from seeing more of Aiden . . . in more ways than one.\nAiden Downey had no idea the hot blonde from the club would trigger his protective, gentle nature, but the moment she drops her guard and he sees the real Sadie Howard, he's a goner. When a family crisis puts the brakes on their budding romance, can Aiden find a way to hold on to her? Or will he lose the best thing in his life just as quickly as he found her?\n\nHard to Handle\nONCE BURNED Sadie Howard never dates a guy more than once-but Fate has other plans for her when it comes to Aiden Downey, the one that got away. Aiden loved her, left her, and broke her heart. Yet suddenly she's bumping into him at every turn, driven to distraction by his wicked grin and rock-hard body. Now she can't resist finishing what they started-as long as she doesn't let herself fall in love...\nTWICE AS TEMPTING Aiden Downey threw away the best thing he ever had when he let Sadie go, and now he's determined to win back the woman he's always wanted. Sadie agrees to let him into her life-and her bed-as long as there are no strings attached. But Aiden's not about to make the same mistake again. Can he convince her to take a second chance on a once-in-a-lifetime love?","torrent":{"xt":"urn:btih:eab1eafedb8d2342de764ee9acd29cdab04ac9fa","amp;dn":"Love+in+the+Balance+Series+by+Jessica+Lemmon","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eab1eafedb8d2342de764ee9acd29cdab04ac9fa","infoHashBuffer":{"type":"Buffer","data":[234,177,234,254,219,141,35,66,222,118,78,233,172,210,156,218,176,74,201,250]},"announce":[],"urlList":[]}}