{"title":"The Marlene Dietrich  Collection - Morocco (1930) and Blonde Ven","uid":9471303,"size":7700779008,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:eab7b69da24aea8bbbfe19b22e75d669d70376af&amp;dn=The+Marlene+Dietrich++Collection+-+Morocco+%281930%29+and+Blonde+Ven&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SaM","files":-1,"time":1389581785,"description":"The Marlene Dietrich  Collection - Morocco (1930) and Blonde Venus (1932) DVD9 [DDR]\n\n\nThe Marlene Dietrich  Collection - Morocco (1930)\n\nMorocco is a 1930 American romance drama film directed by Josef von Sternberg and starring Gary Cooper, Marlene Dietrich, and Adolphe Menjou. Based on the novel Amy Jolly by Benno Vigny and adapted by Jules Furthman, the film is about a cabaret singer and a Legionnaire who fall in love, but their relationship is complicated by his womanizing and the appearance of a rich man who is also in love with her. The film is most famous for the scene in which Dietrich performs a song dressed in a man's tailcoat and kisses another woman (to the embarrassment of the latter), both of which were rather scandalous for the period.\n\nMorocco was nominated for four Academy Awards in the categories of Best Actress in a Leading Role (Marlene Dietrich), Best Art Direction, Best Cinematography and Best Director (Josef von Sternberg). In 1992, Morocco was selected for preservation in the United States National Film Registry by the Library of Congress as being &quot;culturally, historically, or aesthetically significant&quot;.\n\n    CAST:-\n    Gary Cooper as Legionnaire Tom Brown\n    Marlene Dietrich as Amy Jolly\n    Adolphe Menjou as La Bessiere\n    Ullrich Haupt as Adjutant Caesar\n    Eve Southern as Madame Caesar\n    Francis McDonald as Sergeant\n    Paul Porcasi as Lo Tinto, nightclub owner\n\nDirected by Josef von Sternberg\nProduced by Hector Turnbull\nScreenplay by Jules Furthman\nBased on Amy Jolly by Benno Vigny\nMusic by Karl Hagos\nRunning time 91 minutes\n\nMOVIE REVIEW:- Morocco (1930)\nWealthy La Bessiere (Adolphe Menjou) tries to strike up an acquaintance with disillusioned nightclub singer Amy Jolly (Marlene Dietrich) on a ship bound for Morocco. Though polite, she later tears up and tosses away his calling card. They meet again at the nightclub where she is the headliner.\n\nAlso in the audience is appreciative ladies man, Legionnaire Private Tom Brown (Gary Cooper). During her first performance, after kissing a woman in the audience, Amy slips Tom her key. He takes her up on her offer that night, and they become acquainted. He discovers that she has become embittered with life and men, but, as they talk, she finds herself coming to like him. Unwilling to risk heartbreak once again, she asks him to leave before anything serious happens.\n\nOn the street, Tom encounters Legionnaire Adjutant Caesar's wife (Eve Southern). It is clear that she has a past clandestine relationship with him, which she desires intensely to maintain. Her husband, Tom's commanding officer, watches undetected from the shadows, as Tom rejects her. Meanwhile, Amy changes her mind and seeks Tom out. Madame Caesar then hires two street ruffians to attack the couple. Tom manages to seriously wound both, while he and Amy escape unscathed.\n\nThe next day, Tom is brought before Adjutant Caesar on the charge of injuring two allegedly harmless natives. Amy clears him, but Caesar makes him aware that he knows about Tom's involvement with his wife. Tom is ordered to leave for Amalfi Pass with a detachment commanded by Caesar. He suspects that Caesar intends to rid himself of his romantic rival.\n\nThat night, Tom overhears La Bessiere, who has been courting Amy all along, offer to marry her. Though he has fallen in love with her himself, Tom decides that she would be better off with a rich man than with a poor Legionnaire. When Tom hides the depth of his feelings for her before his departure, Amy eventually accepts La Bessiere's proposal.\n\nOn the march to Amalfi Pass, the detachment runs into a machine gun nest. Caesar orders Tom to deal with it, then decides to accompany him. Caesar is killed by the enemy.\n\nLater, at their engagement party, La Bessiere and Amy learn that what's left of Tom's detachment has returned. Frantic, Amy rushes outside, but learns that Tom was wounded and left behind to recuperate in a hospital. She informs La Bessiere that she must go to Tom that very night; wanting only her happiness, he drives her there.\n\nShe finds that he has not been injured at all. Because he feigned being wounded to avoid returning, he has been assigned to a new unit, which is about to march away into the desert. \n\nAmy is torn, but when she sees a handful of native women stubbornly following the Legionnaires they love, she joins them.\n\n-----------------------------------------------------------------------------\n\nThe Marlene Dietrich  Collection - Blonde Venus (1932) \n\nBlonde Venus is a 1932 Pre-Code drama film starring Marlene Dietrich and Cary Grant. The movie was produced and directed for Paramount Pictures by Josef von Sternberg with a \n\nscreenplay by Jules Furthman and S. K. Lauren adapted from a story by Furthman and von Sternberg. The music score was by W. Franke Harling, John Leipold, Paul Marquardt and \n\nOscar Potoker, and the cinematography by Bert Glennon.\n\nDietrich performs three musical numbers in this film, including the now-obscure &quot;You Little So-and-So&quot; (music and lyrics by Sam Coslow and Leo Robin) and &quot;I Couldn't Be Annoyed&quot; \n\n(music and lyrics by Leo Robin and Richard A. Whiting). The highlight is perhaps &quot;Hot Voodoo&quot; (music by Ralph Rainger, lyrics by Sam Coslow), which is nearly 8 minutes long and \n\nmostly instrumental, featuring jazz trumpet and drums. Dietrich sings the lyrics toward the end of this sequence, which takes place in a nightclub.\n\nThis movie predates She Done Him Wrong by a year, although Mae West claimed to have discovered Cary Grant for that film, elaborating that up until then Grant had only made \n\n&quot;some tests with starlets&quot;, an assertion rejected by some other actresses, including Sylvia Sidney.\n\nCAST:-\nMarlene Dietrich as Helen Faraday/Helen Jones\nHerbert Marshall as Edward 'Ned' Faraday\nCary Grant as Nick Townsend\nDickie Moore as Johnny Faraday\nGene Morgan as Ben Smith\nRita La Roy as Taxi Belle Hooper\nRobert Emmett O'Connor as Dan O'Connor\nSidney Toler as Detective Wilson\n\nProduced and Directed by Josef von Sternberg\nWritten by Jules Furthman, S. K. Lauren\nMusic by W. Franke Harling\nRunning time 93 min\n\nMOVIE REVIEW:- Blonde Venus (1932)\nThe movie begins with 7 American students traveling in Germany. They stop at a pond and see 6 girls (who all work for a theater) bathing. The girls see the students and attempt to conceal themselves (as they were unclothed). One of the girls, Helen (Dietrich), asks them to go away, to which one of the guys, Ned (Marshall), respond by saying no.\n\nThe movie then shifts to years later, showing a mother bathing a boy, telling him to hurry since his Dad is coming home soon. We then see a man entering a doctor's office, offering to sell his body. This turns out to be Ned, who is an American chemist poisoned with Radium, expecting to die within the year. The doctor tells him that there is a famous German doctor who has had success treating radiation poison and recommends Ned to travel to Germany.\n\nThe mother and the boy turn out to be Ned's wife and son. Before bed time, the son, Johnny, asks his mother and Ned to tell him the &quot;Germany story.&quot; The story is a combination of dialogue between the mother and Ned, beginning with Ned telling Johnny about his travel in Germany as a student and his encounter of &quot;six beautiful princesses at a pond,&quot; one of whom told Ned that she will grant him a wish if he leaves. Ned wished to see her again, and that very night, Ned went to the local theater, spotting the &quot;princess&quot; on the stage. Johnny then asks his mother what the princess thought of Ned, to which she responds that she wanted to see him again. After the show, Ned asked &quot;the princess&quot; for a walk, and while under a tree, embraced her. The &quot;princess&quot; turns out to be Helen, whom Ned marries after his real-life encounter with her.\n\nJohnny then falls asleep, and Ned and Helen discuss the possibility of having Ned travel to Germany for treatment. It is very evident that Ned loves Helen and wishes not to leave her, and at the same time, the entire treatment and travel are very expensive, to which the couple couldn't find ways to finance. Helen then thinks of the idea of &quot;going on stage&quot; again. \n\nAlthough Ned were absolutely against that idea, Helen went along anyway, hoping to find ways to help her husband.\n\nHelen finds work at a night club and turns out to be a great singer, attracting great attention in her first performance (in which she is required to don an ape suit). Within the audience is Nick Townsend (Grant), a millionaire and an attractive young man. Nick is evidently interested in Helen, and after the show, went back stage to meet her, finding out about her family troubles and offering her $300 on the spot.\n\nWhen Helen returns home, she lied to Ned about how she got the money, instead saying that the producer &quot;paid her in advance.&quot; She then asks if Ned &quot;loves her,&quot; to which Ned replies, &quot;Do I love you? Oh you poor thing&quot; then embraces her.\n\nThe next day, Johnny and Helen see Ned off to Germany at the docks. Nick picks up Helen, to her irritation. Nick then promises to give her all the money Ned needs for his treatment, thereby sparing her from working again. To escape her producer (who since Helen's initial success has been tracking her down for more performance), Helen begins to live with Nick, eventually developing feelings for him. She is unable to resist neither money nor beauty, and thus finally admits that she loves Nick, not Ned. Yet she tells Nick that she must go back to Ned, since he needs her more than Nick does.\n\nBefore Ned is to return, she goes on a two week trip with Nick, believing that it's their last moments together. Ned, however, returns two days early, finding his home empty and begins to chase down clues, ultimately finding out that his wife has been cheating on him with Nick.\n\nHelen comes back from her trip with Nick and bids him farewell (Nick decides to travel to Europe to &quot;forget about Helen&quot;). She returns home, shockingly discovers that Ned is already there. Ned confronts her with her infidelity and asks her to bring him Johnny, since Johnny is &quot;all I've got.&quot; She agrees but instead grabs Johnny and escapes, living on the run and trying to avoid Ned, who reports their escape to the police, who have since been tracking her.\n\nEventually, Helen realizes that life on the run is not right for Johnny and agrees to give him to Ned. Ned asks her to never see him or Johnny again.\n\nAfter a dramatic breakdown after her separation with Johnny, Helen begins to officially sing in cabarets, making a successful career that eventually brought her to Paris. In a fateful performance, she runs into Nick, who continues to profess his feelings for Helen. Nick knows that Helen loves Johnny and wishes to see him again. He offers to take her back to the U.S., and the two return engaged.\n\nHelen comes home and sees her son, Johnny, who is still unaware of his mother's infidelity and her engagement to Nick. Johnny asks his mother to tell him the &quot;Germany story&quot; again, since Ned had refused to tell it because he &quot;has forgotten it.&quot; Johnny then proceeds to tell the story himself, asking his parents to verify. He begins by asking Ned if he was in Germany as a student and if he saw a pond with &quot;6 beautiful princesses,&quot; to which Ned responds, &quot;I was sentimental and foolish back then.&quot; But through this forced dialogue with Johnny telling the story, Ned and Helen begin to realize what their separation means for Johnny, who still lives in his own world in which his parents are together.\n\nHelen then sings to Johnny the song that she sang before he sleeps every night (the lyric of this song is a poem by Heinrich Heine). During the song, both Helen and Ned realizes that this home is where they both belong, and the movie ends with their embrace.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: MPEG-2\nVideo Bitrate: 4999 kbps\nVideo Resolution: 720x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 23.976\nAudio Codec:  AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages:English\nRunTime 184 mins\nSubtitles: English, Francais\nRipped by: Trinidad [DDR]\nDuration: 184 mins","torrent":{"xt":"urn:btih:eab7b69da24aea8bbbfe19b22e75d669d70376af","amp;dn":"The+Marlene+Dietrich++Collection+-+Morocco+%281930%29+and+Blonde+Ven","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eab7b69da24aea8bbbfe19b22e75d669d70376af","infoHashBuffer":{"type":"Buffer","data":[234,183,182,157,162,74,234,139,187,254,25,178,46,117,214,105,215,3,118,175]},"announce":[],"urlList":[]}}