{"title":"Houston - Lost And Unbuilt (History Art Architecture).pdf","uid":13092939,"size":28106256,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:eafef8f497d55594459c5a5905e44a8bacdf6c43&amp;dn=Houston+-+Lost+And+Unbuilt+%28History+Art+Architecture%29.pdf&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STBGD","files":1,"time":1451077519,"description":"Houston Lost and Unbuilt by Steven R. Strom\r\nEnglish | 2010 | ISBN 0292721137 | 200 pages | PDF | 26.80 MB\r\n\r\nDriven by an almost fanatical desire for whatever is new, &quot;modern,&quot; and likely to make money, Houston is constantly in the process of remaking itself. Few structures remain from the nineteenth century, and even much of the twentieth-century built environment has fallen before the wrecking ball of &quot;progress.&quot; Indeed, the demolition of older buildings in Houston can be compared to the destruction of cityscapes such as Berlin, Warsaw, and Tokyo in World War II. But because this wholesale restructuring of Houston's built environment has happened in peacetime, historically minded people have only recently sounded an alarm over what is being lost and the toll this destruction is taking on Houstonians' sense of place.\r\nHouston Lost and Unbuilt presents an extensive catalogue of twentieth-century public and commercial buildings that have been lost forever, as well as an intriguing selection of buildings that never made it off the drawing board. The lost buildings (or lost interiors of buildings) span a wide range, from civic gathering places such as the Houston Municipal Auditorium and the Astrodome to commercial enterprises such as the Foley Brothers, Sears Roebuck, and Sakowitz department stores to &quot;Theatre Row&quot; downtown to neighborhoods such as Fourth Ward/Freedmen's Town","torrent":{"xt":"urn:btih:eafef8f497d55594459c5a5905e44a8bacdf6c43","amp;dn":"Houston+-+Lost+And+Unbuilt+%28History+Art+Architecture%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eafef8f497d55594459c5a5905e44a8bacdf6c43","infoHashBuffer":{"type":"Buffer","data":[234,254,248,244,151,213,85,148,69,156,90,89,5,228,74,139,172,223,108,67]},"announce":[],"urlList":[]}}