{"title":"Stay: A History of Suicide and the Philosophies Against It (2013","uid":9280838,"size":1681868,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ed6b374c5c70578213c17f943c61f7a89d123464&amp;dn=Stay%3A+A+History+of+Suicide+and+the+Philosophies+Against+It+%282013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bookzilla","files":1,"time":1385937948,"description":"Many thousands of people kill themselves every year, and many more are left behind to grieve. Distressing statistics show that suicide rates are rising, and studies confirm that suicide causes more suicide, both among those who knew the person and even among strangers who feel some connection. In this highly original book Jennifer Michael Hecht channels her grief for two friends lost to suicide into a search for history's most persuasive arguments against the irretrievable act. Hecht recounts individual suicide cases from the Bible and ancient Greeks to the present day and analyzes how ideas about suicide have changed over time. She explains several puzzling aspects of attitudes toward suicide, including the strange fact that secular philosophy has long been associated with a pro-suicide attitude. In our own times, when the influence of religious prohibitions has waned, Hecht finds that we lack shared, secular, logical arguments against suicide. But there are such arguments, and she focuses new attention on these forgotten ideas that offer hope in the face of despair and powerful reasons to stay when suicide seems a tempting choice.\n\n2013\n","torrent":{"xt":"urn:btih:ed6b374c5c70578213c17f943c61f7a89d123464","amp;dn":"Stay%3A+A+History+of+Suicide+and+the+Philosophies+Against+It+%282013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed6b374c5c70578213c17f943c61f7a89d123464","infoHashBuffer":{"type":"Buffer","data":[237,107,55,76,92,112,87,130,19,193,127,148,60,97,247,168,157,18,52,100]},"announce":[],"urlList":[]}}