{"title":"Sexually Broken--Chanel Preston stuck in stocks and worked over ","uid":10084169,"size":2145906182,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:ee6fda43d43ff5ee19ed8b8ccf8e404922bc9d73&amp;dn=Sexually+Broken--Chanel+Preston+stuck+in+stocks+and+worked+over+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"merzedes","files":-1,"time":1399067780,"description":"\nChanel Preston stuck in stocks and worked over by 2 cocks, brutal deepthroat and multiple orgasms! | Chanel Preston | Matt Williams\n\nMay 2, 2014\n\n\niPod, Low and High bitrate MP4 + Pics.\n\n\nLush Chanel Preston is here today to do what she does best. Which is suck and fuck with the animal intensity she brings to every scene she does. This is a sexual freak that loves what she does with an undeniable passion. Here at Sexuallybroken we know just how to reward that sort of passion-stick the bitch in stocks and drill her down without mercy from both ends until she is cross-eyed.\n\nThe set up is simplicity in itself. Bound down on her knees in a custom made wooden bondage device, the stocks are at the perfect height for cock worship. Chanel can not move or shift or dodge the dick in any way, she is reduced to just a face pussy. We walk right up and sheath ourselves down to the hilt. All she can do is endure and hang on for the ride, opening up her throat as wide as possible. One after another the dicks take turns tag teaming her face. The drool flows out and down over the stocks, pooling onto the floor.\n\nThe beauty of this position is how easily it can be shifted, and without even bothering to take Chanel out of the stocks, we rotate it enough so that she is now standing on her feet and bent over. This opens up both ends for our use, and we take immediate advantage of that fact. Both throat and pussy are thoroughly owned. We take her from both sides and try and meet in the middle. This sexual beast is becoming tamed. Her eyes are glassy and as the cocks work her over and her limbs become limp, only the bondage holds her up.\n\nThis fuck doll is throughly used and blasted out into the outer realms of sexual subspace. A good serving of top shelf cock always does the trick. We leave her in the stocks, lolling in deep subspace. She makes a handy decoration to the studio, we might leave her there for a while yet... \n \nScreens &lt;a href=&quot;\nhttp://sexuallybroken.com/sexual/bondage/2014/05_02cpreston5/SexuallyBroken-Chanel-Preston-Matt-Williams-Chanel-Preston-stuck-in-stocks-and-worked-over-by-2-cocks-brutal-deepthroat-and-multiple-orgasms.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://sexuallybroken.com/sexual/bondage/2014/05_02cpreston5/SexuallyBroken-Chanel-Preston-Matt-Williams-Chanel-Preston-stuck-in-stocks-and-worked-over-by-2-cocks-brutal-deepthroat-and-multiple-orgasms.php&lt;/a&gt;\n\n14 000 down, but how much more to come ?? You decide ;) \n\nThe more you appreciate it, the more we want to do it. Can we get to 15k ??? \n\nWell, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)\n\n\nAny Questions ?? Read our FAQ!!\n &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:ee6fda43d43ff5ee19ed8b8ccf8e404922bc9d73","amp;dn":"Sexually+Broken--Chanel+Preston+stuck+in+stocks+and+worked+over+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee6fda43d43ff5ee19ed8b8ccf8e404922bc9d73","infoHashBuffer":{"type":"Buffer","data":[238,111,218,67,212,63,245,238,25,237,139,140,207,142,64,73,34,188,157,115]},"announce":[],"urlList":[]}}