{"title":"The Great British Bake Off - An Extra Slice - S02E01","uid":12207178,"size":175044109,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ee73cd0599a937a8b78e1c06bb7bbaa6131483f5&amp;dn=The+Great+British+Bake+Off+-+An+Extra+Slice+-+S02E01&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"uggauga","files":2,"time":1438996991,"description":"Web download directly from the Beeb\n1280x720\nx264\n\nTo accompany the news Season 6 of The Bake Off\n\n*********************\n\nThe Great British Bake Off: An Extra Slice, Series 2 Episode 1\n\nThe Great British Bake Off is back and will be joined by An Extra Slice on BBC Two. Each week, host Jo Brand will be chatting to a panel of celebrity Bake Off fans, looking at all the shenanigans and goings-on in the tent. Jo will shine a spotlight on the best, the worst and the 'must try harder next time' bakes from the latest episode, with chat, exclusive footage from the BBC One show and an interview with the baker who left the tent that week.\n\nThe studio audience of Bake Off fans will be challenged to bring a bake from home and reveal their efforts on the show, plus viewers will be invited to share photos of their efforts too - the delightful, the delicious and the downright disastrous.\n\nKicking off the series, Jo and her panel of Bake Off fans will give us their take on the 12 brand new bakers and their attempts in cake week. Will they go mad for the bakers' madeira cake? How do they think the dozen coped with their first ever technical bake - Mary's frosted walnut cake? Whose black forest gateau show-stopper stopped the show?\n\nAn Extra Slice - when one helping of Bake Off just isn't enough","torrent":{"xt":"urn:btih:ee73cd0599a937a8b78e1c06bb7bbaa6131483f5","amp;dn":"The+Great+British+Bake+Off+-+An+Extra+Slice+-+S02E01","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee73cd0599a937a8b78e1c06bb7bbaa6131483f5","infoHashBuffer":{"type":"Buffer","data":[238,115,205,5,153,169,55,168,183,142,28,6,187,123,186,166,19,20,131,245]},"announce":[],"urlList":[]}}