{"title":"Daniel and the Revelation - Uriah Smith","uid":4557643,"size":1760653,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ef1d92f684cfbbcd99cbf39f391ba70e441705be&amp;dn=Daniel+and+the+Revelation+-+Uriah+Smith&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Qinael","files":1,"time":1228553475,"description":"Written by Uriah Smith, this book examines in great detail the prophetic books of Daniel and the Revelation in clear terms. The interpretations of these books are of great relevance to the world today, and a wealth of ideas abound regarding what the symbols used within them mean. \n\nWhat is the mark of the beast? Is it a chip? A barcode? A worldwide currency? Or something altogether different?\n\nWhat is the &quot;beast&quot; that gives the mark, anyway? And what about it's image? Angels? Beasts? Winds, oceans, horns, and plagues? \n\nUsing a very simple method - let the Scriptures interpret the Scriptures - this book answers all of these inquiries and more, showing the clear and unmistakable consistency of the prophetic records. \n\nDivided into two sections, the first half deals with the book of Daniel, with each chapter corresponding to a chapter in the Old Testament writing. The second half is similarly structured, with each chapter parallel to the chapter it examines in the book of Revelation. \n\nFor those with serious questions wanting a solid and logical answer to what these books mean, this book is a must read.","torrent":{"xt":"urn:btih:ef1d92f684cfbbcd99cbf39f391ba70e441705be","amp;dn":"Daniel+and+the+Revelation+-+Uriah+Smith","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef1d92f684cfbbcd99cbf39f391ba70e441705be","infoHashBuffer":{"type":"Buffer","data":[239,29,146,246,132,207,187,205,153,203,243,159,57,27,167,14,68,23,5,190]},"announce":[],"urlList":[]}}