{"title":"Yattaman Serie Completa - Tutti i Torrent [DVDrip ITA] TNT Villa","uid":6097739,"size":1349720,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ef2bf7b96cef7882790af6301dba284d487f047d&amp;dn=Yattaman+Serie+Completa+-+Tutti+i+Torrent+%5BDVDrip+ITA%5D+TNT+Villa&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"l.diliberto","files":9,"time":1294843968,"description":"Yattaman Serie Completa - Tutti i Torrent [DVDrip ITA] TNT Village\n\n.: Release Originale :.\n &lt;a href=&quot;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=236038&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=236038&lt;/a&gt;\n\n.: Trama :.\n\nAnni '80: il terzetto di ladri e truffatori conosciuto come Trio Drombo, il cui simbolo ÃƒÂ¨ un teschio, viene contattato e &quot;cooptato&quot; dal Dottor Dokrobei, un misterioso e potentissimo personaggio che si presenta loro sempre e solo in voce, collocata all'interno di un oggetto diverso di volta in volta, con impresso un teschio, che poi al termine della spiegazione, esplode.\n\nIl loro compito, da quel momento, sarÃƒÂ  trovare i quattro frammenti della Dokrostone, riuniti i quali si potrÃƒÂ  ottenere un favoloso tesoro. Il Trio Drombo inizia cosÃƒÂ¬ ad organizzare l'ennesima truffa per poter racimolare i soldi necessari alla realizzazione del robot da combattimento che li porterÃƒÂ  nel luogo dove secondo Dokrobei &quot;dovrebbe&quot; esserci un frammento della pietra. Inutile dire che l'intuizione del Dottore nella maggior parte dei casi si rivelerÃƒÂ  sbagliata.\n\nMa i tre non hanno fatto i conti con i paladini della giustizia, gli Yattaman (due ragazzini di nome Ganchan e Janet, detti anche Yatta1 e Yatta2), che scoprono i loro piani e li inseguono con i loro mezzi robot a forma di animali. Giunti nel luogo prescelto, le due formazioni si scontrano, prima fisicamente e poi per mezzo dei rispettivi robot. Ganchan ha come arma una Kendama, con la quale colpisce uno dei tre nemici e, premendo un tasto, scatena la scossa elettrica, cosÃƒÂ¬ come Janet ha un bastone telescopico dal quale escono scosse elettriche. Alla fine, piÃƒÂ¹ per la stupiditÃƒÂ  o la sfortuna dei cattivi che per la bravura dei buoni, il bene trionfa. Il trio Drombo si riavvia mesto verso casa a bordo di un tandem, ma le loro sofferenze non sono finite: il Dottor Dokrobei, collegato a loro tramite un altoparlante a forma di teschio installato sulla bici, ÃƒÂ¨ scontento di loro ed elargisce di volta in volta una terribile punizione a distanza. Ad esempio, li trasforma in tre oche e li fa inseguire dal lupo, trasforma il terreno su cui poggiano i piedi in sabbie mobili, fa apparire delle scarpe molleggianti da sottoterra e altro ancora. I tre, dalla disperazione, esclamano ripetutamente &quot;al diavolo Dokrobei!!!&quot;\n\nQuesto esilarante canovaccio si ripete per tutte le puntate della serie, sino all'ultima, dove uno stupito Trio Drombo riesce a mettere insieme la Dokrostone\n\n.: Cover :.\n &lt;a href=&quot;\nhttp://www.newbokan.net/Bokanologia/Yattaman/Anime%20Film/Yattaman-film-animazione-A.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.newbokan.net/Bokanologia/Yattaman/Anime%20Film/Yattaman-film-animazione-A.jpg&lt;/a&gt;\n\n.: Crediti :.\n\nTitolo originale Time Bokan Series: Yattaman\nAutore Tatsuo Yoshida\nRegia Hiroshi Sasagawa, Mamoru Oshii, Kouichi Mashimo, Noboru Ishiguro, Tomio Ashida\nSceneggiatura Yu Yamamoto, Hiroshi Yamada, Suzuki Ryoutakeshi,\nCharacter design * Yoshitaka Amano personaggi principali\n* Keiko Nakamori personaggi secondari\n* Akemi Takeda personaggi secondari\nMecha design Kunio Okawara\nStudio Tatsunoko\nMusiche Masayuki Yamamoto\n\n.: Dati tecnici medi del ripping per ogni episodio :.\n\nDimensione: 697 Mb\nDurata: 1.54.20\n\nVideo Codec: DivX 5.0\nVideo Bitrate: 719 kb/s\nRisoluzione: 512x384\nFPS (Frames/sec): 25.000\nQF (Frame quality): 0.146\n\nAudio Codec: Mp3\nAudio Bitrate: 128 kb/s\nFreq Audio: 48.000 Hz ","torrent":{"xt":"urn:btih:ef2bf7b96cef7882790af6301dba284d487f047d","amp;dn":"Yattaman+Serie+Completa+-+Tutti+i+Torrent+%5BDVDrip+ITA%5D+TNT+Villa","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef2bf7b96cef7882790af6301dba284d487f047d","infoHashBuffer":{"type":"Buffer","data":[239,43,247,185,108,239,120,130,121,10,246,48,29,186,40,77,72,127,4,125]},"announce":[],"urlList":[]}}