{"title":"Vicious Complete Season 1 ENG SUBS WEBRIP","uid":11978318,"size":1156280552,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ef33ec7e093b13c080123798fd9a22d5f45ad348&amp;dn=Vicious+Complete+Season+1+ENG+SUBS+WEBRIP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"makinapufterpup","files":16,"time":1433104654,"description":"Vicious.UK.Complete.Season.1.ENG.SUBS.WEBRIP.Sir.Ian.McKellen.Sir.Derek.Jacobi\n\nEpisodes 1 through 6 were ripped from ITV in the following format:\n\nFormat: MPEG-4\nsize: 704x396\nDisplayAspectRatio: 16:9\nFrameRate: 25.000 fps\nAudioCodec: AAC\nChannels: 2 channels\nSamplingRate: 48.0 KHz\n\nThe Christmas Special was ripped from Project Free TV in the following format:\n\nFormat: MPEG-4\nsize: 720x404\nDisplayAspectRatio: 16:9\nFrameRate: 25.000 fps\nAudioCodec: AAC\nChannels: 2 channels\nSamplingRate: 48.0 KHz\n\n* Please Note: The Project Free TV rip of the Christmas Special is included because there was not a version available to rip directly from ITV. I wanted to be able to share all the episodes of Vicious before Series 2 begins 2015-06-01. Subs for the Christmas Special are fromAll other subs are directly from ITV. *\n\nEpisode Descriptions:\n\nVicious.s01e01.ENG.SUBS.ITV.WEBRIP\n\nFreddie and Stuart are hosting a wake to mark the passing of an old friend. As they are joined by their small circle of elderly chums, the couple manage to create a toe-curlingly awkward evening with very little food but plenty of bitchy insults. Their new young upstairs neighbour Ash - whose sexuality becomes a point of great debate - spends the evening attempting to be the perfect guest, while fending off the advances of Freddie and Stuart's best friend Violet.\n\nVicious.s01e02.ENG.SUBS.ITV.WEBRIP\n\nFreddie and Stuart go shopping for a new coat for Freddie's Dr Who fan club event. Meanwhile new neighbour Ash seeks advice from Violet and Penelope on winning back his ex-Â­girlfriend.\n\nVicious.s01e03.ENG.SUBS.ITV.WEBRIP\n\nFreddie has an important audition coming up whilst Ash frets over his own career direction. Freddie suggests that Ash pursues acting and teaches him the tricks of the trade. But, when Ash secures an acting role after just his first audition, Freddie is thrown into a state of depression. Meanwhile, Violet seeks advice from Freddie and Stuart on her sordid love affair with her Hungarian boyfriend. \n\nVicious.s01e04.ENG.SUBS.ITV.WEBRIP\n\nAsh invites Freddie, Stuart, Penelope and Mason to go clubbing, which Freddie and Stuart turn into a popularity contest. Meanwhile, Violet arranges to go and visit her latest online suitor... even though he lives in Argentina. \n\nVicious.s01e05.ENG.SUBS.ITV.WEBRIP\n\nFreddie and Stuart invite Ash and his new, apparently perfect, girlfriend Chloe to dinner. Violet is having some difficulty with her lover in Buenos Aires.\n\nVicious.s01e06.ENG.SUBS.ITV.WEBRIP\n\nIt's the night of Freddie and Stuart's anniversary party and Stuart decides that he is going to tell his mother the truth about him and Freddie being a couple.\n\nVicious.s00e01.Christmas.Special.ENG.SUBS.PFTV.WEBRIP\n\nA festive edition of the comedy starring Ian McKellen and Derek Jacobi as a couple who have lived together in London for 50 years. Freddie and Stuart invite friends round for a Christmas Day celebration at their flat, where a game of truth or dare leads to unexpected revelations as young neighbour Ash struggles to manage in the kitchen, and Freddie prepares for a big role","torrent":{"xt":"urn:btih:ef33ec7e093b13c080123798fd9a22d5f45ad348","amp;dn":"Vicious+Complete+Season+1+ENG+SUBS+WEBRIP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef33ec7e093b13c080123798fd9a22d5f45ad348","infoHashBuffer":{"type":"Buffer","data":[239,51,236,126,9,59,19,192,128,18,55,152,253,154,34,213,244,90,211,72]},"announce":[],"urlList":[]}}