{"title":"DND_Disc1","uid":11759431,"size":4684927746,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:efa3cadf29fe42782fb4a8e2e5d5728bd57a7113&amp;dn=DND_Disc1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Belus4","files":2,"time":1426541198,"description":" Hey look, a Dungeons &amp; Dragons ride!\n\nWith these fateful words six friends visiting an amusement park one Sunday climb aboard a themed roller-coaster ride and are magically transported into the Realm of Dungeons &amp; Dragons. Here they are mentored by a gnomish wizard named the Dungeon Master who assigns them roles along with magical totems.\n\nSteadfast Hank is appointed ranger and given a bow that fires multipurpose arrows of golden energy, brash youngster Bobby is appointed barbarian and given a club that wreaks tremendous havoc, bumbling Albert who is nicknamed Presto is appointed magician and given a conjuring hat, timid Sheila is appointed thief and given a cloak of invisibility, Eric the haughty coward is appointed cavalier and given a shield complete with forcefield, while gymnast Diana is appointed acrobat and given a javelin that grows and shrinks.\n\nBefriending a baby unicorn they nickname Uni the kids are soon caught in a skirmish between a five-headed dragon known as Tiamat and the fiendish Venger who wants their totems to subjugate the many-headed dragon queen before he can conquer the Realm.\n\nStranded in this fantastic world these new heroes must follow the Dungeon Master's cryptic advice as he guides them homewards on adventures exploring the strange Realm, battling monsters, opposing tyrants and outwitting Venger","torrent":{"xt":"urn:btih:efa3cadf29fe42782fb4a8e2e5d5728bd57a7113","amp;dn":"DND_Disc1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"efa3cadf29fe42782fb4a8e2e5d5728bd57a7113","infoHashBuffer":{"type":"Buffer","data":[239,163,202,223,41,254,66,120,47,180,168,226,229,213,114,139,213,122,113,19]},"announce":[],"urlList":[]}}