{"title":"One Morning Like A Bird by Andrew Miller","uid":9622088,"size":398244,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:efefd8e2bb5e87f13beaf8bc1b7a71e40cb17e40&amp;dn=One+Morning+Like+A+Bird+by+Andrew+Miller&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"PirateBook","files":1,"time":1392518191,"description":"\n1940. Tokyo. Japan is at war with China, and Yuji Takano is clinging to the life he has made for himself as a young poet - the company of his friends, the monthly meetings of the French Club at Monsieur Feneon's house, the days of writing and contemplation made possible by an allowance from his father, a professor at Tokyo's elite Imperial university...\n\nBut the world is closing in on Yuji. His father is disgraced, the allowance is scrapped, and the threat of conscription is coming ever closer. And then there is Monsieur Feneon's nineteen-year-old daughter Alissa, a girl with her own very definite ideas of what she wants, and whose fate becomes inextricably bound up with Yuji's. \n\nIn hauntingly evocative prose, Andrew Miller tells a timeless story about growing up and growing free of self-delusions, about following the heart and making the right choices in life. Vividly conveying its setting, he also draws a fascinating portrait of a bygone Tokyo and of Japan at a critical juncture in its history.\n\nGenre: Historical Fiction","torrent":{"xt":"urn:btih:efefd8e2bb5e87f13beaf8bc1b7a71e40cb17e40","amp;dn":"One+Morning+Like+A+Bird+by+Andrew+Miller","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"efefd8e2bb5e87f13beaf8bc1b7a71e40cb17e40","infoHashBuffer":{"type":"Buffer","data":[239,239,216,226,187,94,135,241,59,234,248,188,27,122,113,228,12,177,126,64]},"announce":[],"urlList":[]}}