{"title":"Microsoft Office 2010 Installer Channel Switcher ver 1.2 Final","uid":5850957,"size":10161254,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:f061f8de8d8f5018de25e37e2f01b382ec127736&amp;dn=Microsoft+Office+2010+Installer+Channel+Switcher+ver+1.2+Final&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pkaji123","files":-1,"time":1285384386,"description":"-----Office 2010 Installer Channel Switcher ( x86 &amp; x64 ) v1.2 -Stannieman-----\n      *********************************************************************\n\nDescription:\n============\n\nThis Application will convert your Retail Versions of Office 2010,Visio,Project Pro Installer Downloaded from MSDN or other,into a perfect Volume License ISO,which is 100% Genuine Untouched ISO,So that you can Activate Office with KMS Activation or with an MAK Key.\n\nIt also supports reverse function ie., You can convert a VL version of Office Installer to Retail also,This application will save your time &amp; BandWidth,as you dont need to download VL version again if you have a Retail Version.\nAnd there are more other uses too..\n\nAlso You can combine all input files into a one ISO,ie., Office ProPlus+Visio+Project Pro= One ISO.\n\nWhat it does?\n-------------\nIt combines all the input files into one iso which contains all the inputed installers.\nIt can convert the activation channel of the input products from retail into volume or visa versa.\n\n\nWhat it doesn't?\n----------------\nIt doesn't activate/crack Office, Visio or Project, unless you do it yourself with an unattended file.\nIt doesn't add any other crap to the installer.\n\nUsage Guide:\n============\n\n1) Input all the installers you want. Those can be exe files or iso images. Only original Microsoft installers should be used. It may be possible that non original installers pass the checks, but this could result into a corrupted output file. You can also add for example two x86 Visio installers with a different language, you will then have the choice between these languages during setup. (This requires the note at the bottom of the post!)\n\n2) Choose one activation channel for all the output files, or check &quot;Use advanced options&quot;. If you didn't check &quot;Use advanced options go to step 5, otherwise proceed with step 3.\n\n3) On the Advanced options tab select the desired activation channel.\n\n4) If you want to add additional files or folders or want to make moddifications to the files then you can check &quot;Add additional files/folders to the installer&quot;. This option will open an explorer window in the right directory before creating the output iso image.\nNever give an already moddified input installer, if you want to make moddifications always use this option or do it afterwards.\n\n5) Specify an output file.\n\n6) Click &quot;Start channel switching&quot; and wait until you iso is created.\n\nOther info or FAQ:\n==================\n\nThe output file is always an iso file. Why?\n\nBecause the exes are an sfx program followed by a regular cab file, but I think the files to extract from the cab are coded inside the sfx program. So when you add files to the installer, or when you switch the activation channel (which also renames files) the sfx program won't extract all necessary files.\nThe iso files are made exactly the same way as Microsoft made it's dual architecture MSDN iso: using cdimage 2.47 and the right commandline arguments so the iso is official-Microsoft-iso-like.\n\nWhy is the program almost 11MB in size?\n\nThe xml files are really edited, so only those parts that are different are replaced. The cab files are only different in their signature, that's also just edited. The msi files however have so many differences it's undoable to only change that parts, so I 7zipped those files and included them in the app. That's why it's pretty big for what it does. But still downloading 11MB is better than downloading all the magebytes nefor replacing the folders manually.\n\nIf you don't trust this you can always extract the output installer and check the file hashes of the files inside, you'll see for yourself nothing unwanted is added and the files are genuine. The hash of the output iso won't match any hash of valid office installers, this is only because the timestamps of some files are different.\n\nNote:\n=====\nImagine you make for example an iso with both English and Dutch versions of Visio.\nNow when the setup wizard is ran in English, setup forces you to install the English version (you can't uncheck it). You can still choose if you want to isntall the Dutch version also or not. Af cource if the setup is ran in Dutch it's the other way around.\n\nThe language the setup wizard uses is automatically determined from Windows' locale/language settings. This means an English version will always run the English setup, and you're forced to install at least the English version.\n\nYou can however force the setup to use a language, and this can be done in two ways:\n1) Changing Windows' locale/language settings\n2) Removing the Office.xx-xx folder (xx-xx is the language ID) for all languages, except the one from the language you want the setup running in. Setup will be forced to use this language simply because there is no other.\n\nChangelog:\n==========\n1.1 -&gt; 1.2\n- Added support for Visio and Project Professional\n- It can now combine Visio, Project and Office installers into one iso.\n- It can now combine different language installer into one multilanguage installer.\n1.0 -&gt; 1.1\n- Fixed the problem that caused incompatibility with Windows XP and earlier.\n- Typo\n\nPre-Requirements:\n=============\n.net Framework 3.5\n\nChecksums:\n==========\nMD5: 06ca8d4e972ec4742c5959da6a1f2cb6\nSHA1: 42d1329fd1fcab70312f6fdd25ca1b5a25fe5441\n\nHope you guys will like my uploads,so please help me to seed thi torrent.\n\n\n\n\n\n","torrent":{"xt":"urn:btih:f061f8de8d8f5018de25e37e2f01b382ec127736","amp;dn":"Microsoft+Office+2010+Installer+Channel+Switcher+ver+1.2+Final","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f061f8de8d8f5018de25e37e2f01b382ec127736","infoHashBuffer":{"type":"Buffer","data":[240,97,248,222,141,143,80,24,222,37,227,126,47,1,179,130,236,18,119,54]},"announce":[],"urlList":[]}}