{"title":"Braid (1995-2012) [FLAC]","uid":8220229,"size":1900477722,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f0c6fc3cc6a130246897ce10c3ef66470adead07&amp;dn=Braid+%281995-2012%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1362460394,"description":"  1995 Frankie Welfare Boy Age Five\n  1996 The Age Of Octeen\n  1998 Frame &amp; Canvas\n  2000 Movie Music Vol 1\n  2000 Movie Music Vol 2\n  2011Closer to Closed\n  2012 Split with Balance and Composure\n\n\nIn a search to find others interested in trading videos of live shows, drummer/singer Bob Nanna, of Friction, placed a classified ad in Maximum Rocknroll and met drummer Roy Ewing, of Champaign-Urbana, Illinois, in 1993. That fall, Nanna, a freshman at the University of Illinois in Champaign-Urbana, started hanging out with Ewing, who played in Lowercase N. Nanna's friend guitarist Pete Havranek, of 42 Loads and Inkadink, wanted to play with someone new, so Ewing volunteered. Nanna became their singer and guitarist, Jay Ryan joined them on bass, and Braid were born. Shortly thereafter, Ryan left the band and went on to play with Hubcap and Dianogah. Todd Bell, who had played with Ewing in Lowercase N, replaced Ryan on bass. Kate Reuss was recruited to sing. Braid played their first show on December 10, 1993, in Danville, Illinois. Reuss left the band after the second show.\n\nAfter this, Braid went through some drastic changes. Nanna's other band, Friction, broke up for good, which meant that Braid were no longer a side project. Chris Broach joined as singer. Havranek left the band in August 1994, and Broach took over on guitar. A week later Braid recorded the Rainsnowmatch 7&quot;, which was released in December 1994 on Enclave Records. Braid's debut album, Frankie Welfare Boy Age 5, was released in June 1995 on Divot Records. In March 1997, Ewing left the band. Damon Atkinson, of Figurehead, joined Braid's spring tour and became the band's drummer. Two years later, in August 1999, Braid disbanded; the posthumous Lucky to Be Alive followed in the spring of 2000.\n\nAfter the split, members of the band broke off into a number of side projects. Bob Nanna formed the City on Film before eventually reuniting with Todd Bell and Damon Atkinson to create Hey Mercedes. Meanwhile, singer Chris Broach focused on his side project, the Firebird Band, on a full-time basis, and started his own label, Lucid Records. Braid reunited briefly for a one-off summer tour in 2004 before coming back together in a more serious capacity in 2011, when they released an EP, Closer to Closed, on Polyvinyl.","torrent":{"xt":"urn:btih:f0c6fc3cc6a130246897ce10c3ef66470adead07","amp;dn":"Braid+%281995-2012%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f0c6fc3cc6a130246897ce10c3ef66470adead07","infoHashBuffer":{"type":"Buffer","data":[240,198,252,60,198,161,48,36,104,151,206,16,195,239,102,71,10,222,173,7]},"announce":[],"urlList":[]}}