{"title":"Mikis Theodorakis - The Very Best Of Vol. 1 (2004) (Greek Music)","uid":13119049,"size":510199747,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f0f5939db8250644de2b69bd6d73db8cf63bea70&amp;dn=Mikis+Theodorakis+-+The+Very+Best+Of+Vol.+1+%282004%29+%28Greek+Music%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"alekow1","files":40,"time":1451673382,"description":"\nMIKIS THEODORAKIS: BIOGRAPHICAL NOTE\r\n\r\nMikis Theodorakis of Cretan descent was born in Chios Greece, 29 July 1925. He lived in many cities in Greece before setting in Athens, where he now lives.\r\nFrom 1954 to 1960 he worked in Paris and London composing symphonic music, ballet and film music. In 1960 he places himself as leader of the regenerative cultural-political movement in Greece centered on the union of poetry and music, composing dozens of song-cycles, oratorios, revues, music for the ancient Greek drama and other. This movement was connected with the progressive political forces of that period, which aimed, beyond the establishment of democratic life in Greece, to a much deeper and broader rebirth of the Greek people. This brings him often at the center of political life, climaxing with his active participation in the resistance movement against the military dictatorship (1967-74).\r\nTheodorakis wrote for all musical forms. His work, rich and versatile, transcends the limits of music and covers areas such as poetry, prose, philosophy, musicology, even political essays.\r\nThe first period of his musical creation (1940-53) includes songs, orlatorios, chamber music, ballets and symphonic works, THE FIRST SYMPHONY being his most significant work.\r\nThe second period, the Paris period (1954-59), includes chamber music, ballets and symphonic works, the major work being the ballet ANTIGONE commissioned by Covent Garden in 1959.\r\nThe third period, 1960-1980, is devoted to the popular music. Outstanding works produced are the oratorios AXION ESTI and CANTO GENERAL.\r\nThere follows the fourth period, 1981 to 1988, during which, while composing song-cycles, he returns to the symphonic music. Most significant works written are the Third Symphony, the Seventh Symphony, his first opera KOSTAS KARIOTAKIS (The Metamorphoses of Dionysus) and the ZORBAS ballet.\r\nFinally, during the fifth period (1989 to date), he composes three operas (lyric tragedies) MEDEA, ELECTRA and ANTIGONE. This trilogy is complemented by his new Opera LYSISTRATA. With these works Theodorakis ushers in the period of the Lyrical Life, that is, his complete turn to lyricism and perfection of the lyrical musical expression within the total range of his musical achievement.\r\n\r\n \nhttp://i.imgur.com/JWV0mww.jpg\r\n\r\n\r\n01. Mary Linda - If You Remember My Dream (Honeymoon)    [3:00]\r\n02. Grigoris Bithikotsis - A Day In May    [3:22]\r\n03. Grigoris Bithikotsis - My Mother And The Virgin    [3:35]\r\n04. Grigoris Bithikotsis - Drapetsona    [3:39]\r\n05. Stelios Kazantzidis, Marinella - Complaint    [4:12]\r\n06. Grigoris Bithikotsis - Denial    [3:24]\r\n07. Grigoris Bithikotsis - I've Kept Hold Of My Life    [2:22]\r\n08. Mikis Theodorakis - Beautiful City (You'll Become Mine)    [3:34]\r\n09. Melina Merkouri - My Love (Phaedra)    [3:32]\r\n10. Grigoris Bithikotsis - Foreign Lands (Moon, You Bewitched Me)    [3:30]\r\n11. Grigoris Bithikotsis - April    [3:03]\r\n12. Yiota Lydia - Sleep My Little Angel (Lullaby)    [3:32]\r\n13. Grigoris Bithikotsis - On Every Corner    [3:27]\r\n14. Grigoris Bithikotsis - The Doomed    [3:39]\r\n15. Dora Giannakopoulou - Marina    [4:16]\r\n16. Dora Giannakopoulou - The Garden Went Into The Sea    [4:25]\r\n17. Orchestra (Solo Bouzouki Yiorgos Zampetas) - The Kites    [2:32]\r\n18. Grigoris Bithikotsis &amp; Chorus - A Solitary Swallow    [3:31]\r\n19. Grigoris Bithikotsis &amp; Chorus - O Sun Of Justice    [4:49]\r\n20. Grigoris Bithikotsis &amp; Chorus - The Blood Of Love    [3:50]\r\n\r\n\r\n\r\nProject coordinator, compilation and text: Yiorgos Tsampras\r\nDigitally remastered: Panos Bothos\r\n\r\nLabel: Minos-EMI\r\nReleased: 2004\r\nCatalogue: 7243 577286 2 1\r\n\r\nCodec: Flac\r\nCompression Level: 6\r\nQuality: High\r\n\r\n\r\nCD-rip by alekow (EAC and Flac)\r\nCovers Included (600dpi)\r\n\r\nEnjoy, Seed and Share","torrent":{"xt":"urn:btih:f0f5939db8250644de2b69bd6d73db8cf63bea70","amp;dn":"Mikis+Theodorakis+-+The+Very+Best+Of+Vol.+1+%282004%29+%28Greek+Music%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f0f5939db8250644de2b69bd6d73db8cf63bea70","infoHashBuffer":{"type":"Buffer","data":[240,245,147,157,184,37,6,68,222,43,105,189,109,115,219,140,246,59,234,112]},"announce":[],"urlList":[]}}