{"title":"Steven - Operation Splinter Factor (US Secret Cold War Intellige","uid":8420423,"size":941987,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f1108f197f1a1e89f3b792c097eb86c4455b6394&amp;dn=Steven+-+Operation+Splinter+Factor+%28US+Secret+Cold+War+Intellige&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"red_gonzo","files":1,"time":1367172282,"description":"This is Stewart Steven's shocking book Operation Splinter Factor - The Untold Story of America's Most Secret Cold War Intelligence Operation (1974) which tells the untold story of a major and mostly unknown intelligence campaign of the Cold War. Designed to foster dissent and rebellion in Russia's newly acquired East European satellites - in effect, to splinter them off from the USSR and bring them closer to the Western orbit without starting another war. Its weapons were rumors and lies and a great many U.S. tax dollars. The battle did not end in the kind of American victory its general and chief strategist, Allen W. Dulles, expected it would. Instead, before it was over, 100,000 innocent people in Europe had suffered, and some thousand of them had been tortured and killed. Using an unsuspecting American Communist, Noel Field, and a Polish defector, Jozef Swiatlo, Dulles managed to discredit some of the great men of Eastern Europe. His ruthless policy, as much as Stalin's paranoia, was responsible for the postwar show trials that horrified the world with their brutality. Steven tells a cloak-and-dagger tale of the first magnitude, complete with double agents and agents provocateurs, poison-pen letters, false reports to the press, a bundle of dirty tricks, and a master spy who made the audacious operation possible. Enthralling reading, Operation Splinter Factor is a devastating indictment of the unchecked power of a few high officials to shape U.S. foreign policy. 235 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:f1108f197f1a1e89f3b792c097eb86c4455b6394","amp;dn":"Steven+-+Operation+Splinter+Factor+%28US+Secret+Cold+War+Intellige","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1108f197f1a1e89f3b792c097eb86c4455b6394","infoHashBuffer":{"type":"Buffer","data":[241,16,143,25,127,26,30,137,243,183,146,192,151,235,134,196,69,91,99,148]},"announce":[],"urlList":[]}}