{"title":"Wilco - 2004 - A Ghost is Born [EAC - FLAC]","uid":4635466,"size":367960025,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f218cd423c9c10cbff193c595fb003a6790919a3&amp;dn=Wilco+-+2004+-+A+Ghost+is+Born+%5BEAC+-+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bludStain","files":-1,"time":1231535133,"description":"Biography    by Jason Ankeny &amp; Zac Johnson\n\nWilco rose from the ashes of the seminal roots rockers Uncle Tupelo, who disbanded in 1994. While Jay Farrar, one of the group's two singer/songwriters, went on to form the band Son Volt, his ex-partner Jeff Tweedy established Wilco along with the remaining members of Tupelo's final incarnation, which included drummer Ken Coomer as well as part-time bandmates John Stirratt (bass) and Max Johnston (mandolin, banjo, fiddle, and lap steel). Guitarist Jay Bennett rounded out the group, which in 1995 issued their debut album, A.M., a collection of spry country-rock tunes that followed the course established in Tweedy's earlier work. Wilco's sophomore effort, 1996's two-disc set Being There, marked a radical transformation in the group's sound; while remaining steeped in the style that earned Tweedy his reputation, the songs took unexpected detours into psychedelia, power pop, and soul, complete with orchestral touches and R&amp;B horn flourishes. Shortly after the release of Being There, which most critics judged to be among the year's best releases, Johnston left the group to play with his sister, singer Michelle Shocked, and was replaced by guitarist Bob Egan of the band Freakwater. At the same time, while remaining full-time members of Wilco, Stirratt, Bennett, and Coomer also began performing together in the pop side project Courtesy Move. In 1998, Wilco collaborated with singer/songwriter Billy Bragg on Mermaid Avenue, a collection of performances based on unreleased material originally written by Woody Guthrie.\n\nTheir stunningly lush third album, Summerteeth, followed in 1999 and met with critical acclaim but only average sales, initiating tensions with their label, Warner Bros. 2000 saw the release of Mermaid Avenue, Vol. 2, which featured more selections from the band's collaborations with Bragg on Woody Guthrie's unfinished songs. Following this release, longtime drummer Ken Coomer decided to amicably leave the band and was replaced by the Chicago-based Glenn Kotche. The band then focused on recording their fourth album, Yankee Hotel Foxtrot, which ultimately led to the departure of guitarist Jay Bennett, and further tensions with their label. Unwilling to change the album to make it more &quot;commercially viable,&quot; Wilco bought the finished studio tapes from Warner/Reprise for a reported $50,000 and left the label altogether. Leaked tracks from the album surfaced on the Internet in late 2001, and the stripped-down lineup of Tweedy, Kotche, Stirratt, and multi-instrumentalist Leroy Bach embarked on a small tour to support -- or drum up support for -- their unreleased album. Nonesuch Records picked up the album and the official release came out in early 2002 to widespread critical acclaim. Meanwhile, an independent film documenting the drama surrounding the album entitled I Am Trying to Break Your Heart followed in the fall of 2002. During the down time after the album was recorded, Tweedy composed and recorded the film score to the Ethan Hawke film Chelsea Walls, which ended up being released around the same time as Yankee Hotel Foxtrot.\n\nWilco toured extensively following the release of Yankee Hotel Foxtrot, and in 2003 began work on their next album, A Ghost Is Born. While sessions went smoothly compared to Yankee Hotel Foxtrot, after the album was finished Leroy Bach left the band in a split that was described as mutual and amicable; guitarist Nels Cline, keyboardist Mike Jorgensen, and multi-instrumentalist Pat Sansone joined Wilco for their subsequent tour. Shortly before the album's release, Tweedy surprised many fans by announcing he had entered a drug rehabilitation facility to treat a dependency on painkillers, prescribed to treat a long history of migraine headaches aggravated by panic disorder. Tweedy discussed his health problems in depth, along with the often tangled history of Wilco and Uncle Tupelo, in Wilco: Learning How to Die, a biography of the group written by rock journalist Greg Kot, published to coincide with A Ghost Is Born's release in the spring of 2004. The following year, the group released Kicking Television: Live in Chicago, a 23-track collection recorded in the Windy City's Vic Theatre, an album that was later deemed one of the Top 20 best live albums by Q Magazine. In 2007 Wilco's sixth studio album, Sky Blue Sky, hit shelves. \n\nReview    by Mark Deming\n\nIt's hard not to wonder if Wilco's breakthrough 2002 release, Yankee Hotel Foxtrot, would have been such a critical success and so eagerly embraced by the indie rock community if it hadn't become such a cause cÃŽËœlÃŽÂ¦bre thanks to the band being unceremoniously dropped by Reprise Records, and then signed by Nonesuch after the album had become a hot item on the Internet. Much of the critical reaction to the album, while almost uniformly enthusiastic (and rightly so), had an odd undertow that suggested the writers were not especially familiar with Wilco's body of work, registering a frequent sense of surprise that an &quot;alt-country&quot; band would make such an adventurous album while ignoring the creative shape-shifting that had been so much a part of Jeff Tweedy and company's approach on Being There and Summerteeth. The irony is that 2004's A Ghost Is Born, the eagerly awaited follow-up to Yankee Hotel Foxtrot, is also the Wilco album with the strongest stylistic link to its immediate predecessor, as if their new fans are being given a moment to catch up. A Ghost Is Born hardly sounds like a retread of YHF, but the languid, ghostly song structures, the periodic forays into dissonance, and the pained, hesitant vocals from Jeff Tweedy that were so much a part of that album also take center stage here. But while much of Yankee Hotel Foxtrot had a cool and slightly removed feeling, A Ghost Is Born is considerably warmer and more organic; the extended instrumental breaks in several of the songs (two cuts are over ten minutes long) sound more like a group in full flight than the Pro Tools-assembled structures of YHF. And while Wilco's former secret weapon, Jay Bennett, is now out of the picture, the rest of the group (especially multi-instrumentalist Leroy Bach, keyboardist Mikael Jorgensen, and guitarist/co-producer Jim O'Rourke) fill the gaps with admirable grace and strength. If A Ghost Is Born has a flaw, it's in the songwriting; while this album is a &quot;grower&quot; if there ever was one, revealing more of its unexpected complexities with each spin, there are no songs here as immediately engaging as &quot;War on War,&quot; &quot;Heavy Metal Drummer,&quot; or &quot;I'm the Man Who Loves You&quot; from YHF, and while &quot;Hummingbirds,&quot; &quot;Handshake Drugs,&quot; and &quot;Wishful Thinking&quot; are tuneful and charming, they lack the resonance and emotional impact of Tweedy's strongest work. And the album's most purely enjoyable tune, the witty &quot;The Late Greats,&quot; closes out the disc after the 15-minute drone dirge of &quot;Less Than You Think,&quot; dramatically blunting its effectiveness. A Ghost Is Born confirms what old fans and recent converts already know ÃƒÂ¹ that Wilco is one of America's most interesting and imaginative bands ÃƒÂ¹ and it's brave and compelling listening. But if you're expecting another genre-defying masterpiece, well, maybe we'll get one of those next time.\n\nTracks\n    \n01   At Least That's What You Said     Tweedy     5:33\n02   Hell Is Chrome     Jorgensen, Tweedy     4:38\n03   Spiders (Kidsmoke)     Tweedy     10:46\n04   Muzzle of Bees     Tweedy     4:56\n05   Hummingbird     Tweedy     3:11\n06   Handshake Drugs     Tweedy     6:07\n07   Wishful Thinking     Kotche, Tweedy     4:41\n08   Company in My Back     Tweedy     3:46\n09   I'm a Wheel     Tweedy     2:37\n10   Theologians     Tweedy     3:36\n11   Less Than You Think     Bach, Jorgensen, Kotche ...     15:04\n12   The Late Greats     Tweedy     5:03 \n\n","torrent":{"xt":"urn:btih:f218cd423c9c10cbff193c595fb003a6790919a3","amp;dn":"Wilco+-+2004+-+A+Ghost+is+Born+%5BEAC+-+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f218cd423c9c10cbff193c595fb003a6790919a3","infoHashBuffer":{"type":"Buffer","data":[242,24,205,66,60,156,16,203,255,25,60,89,95,176,3,166,121,9,25,163]},"announce":[],"urlList":[]}}