{"title":"Ted Nugent - Motor City Madness 320cbr (Big Papi) 2002 Sony Musi","uid":9460041,"size":93615738,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f328f3fffff106ddfbfb138c2898f3aa741a08e4&amp;dn=Ted+Nugent+-+Motor+City+Madness+320cbr+%28Big+Papi%29+2002+Sony+Musi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Big-Papi","files":-1,"time":1389333978,"description":"Source: 2002 CD\n\n\nBy Demonmaster\nAfter years of playing in his childhood band, The Amboy Dukes, Nugent had finally honed the band down from 7 guys doing variations of Acid Rock, to 3 and sometimes 4 guys that were ready to take on the Hard Rock world face first, Ted, as most know, had a huge hit with the 'Dukes in the mid 60's with &quot;Journey To The Center Of The Mind&quot; and a minor hit with that band's version of &quot;Gloria&quot;. But again, those tapped into the Acid Rock culture. Ted had bigger and meaner Rock songs in mind, and as an avid anti drug advocate, the Acid Rock tag, left him cold. By the way, when those two songs hit, Ted was all of 16 years old!! After recording two more &quot;Ted Nugent and The Amboy Dukes&quot; albums in 73-74 (notice the name change) while having bigger and harder sounds, still got lumped into the hated genre. Producer Tom Werman, who had been following all this with a keen eye, went to Ted, and told him it was time to fullfill his potential. Ted agreed, but said in an interview, that he told Werman, only half jokingly &quot;If my guitar sound comes out wimpy, or my vision for what I'm doing doesn't come across due to production, I will hunt you down, and kill you, your wife, and your kids&quot; Although joking, Ted knew it was make or break time for his career and he wasn't going out without a fight. Still using the remaining rythmn section from the 'Dukes, Nugent dipped deep in his big bag of tricks, and blessed the Rock World with one of the best guitar albums, if not Hard Rock albums, of all time.\n\nI STILL, to this day, get goosebumps and shivers when I hear that opening guitar lick to &quot;StrangleHold&quot;! This song kicks major ass from first note to last. Most people miss that there is a short bass solo in there, just before the breakdown into the bluesy middle part. And that guitar note that leads into the middle just seems to hang on forever, without going into feedback. I find my head rising to it, anticipating the drop on it to let the middle part officially begin. For someone trying to drop the Acid Rock tag, this song fits into that tag so well. The side to side backward cymbal crashes, the flanged bass underneath it all, just the whole movement of the entire piece is so captivating. Ted is playing in such a bluesy manner, that he hasn't really played before or since. Even he says that he doesn't know where half that stuff came from. He just shut his eyes, and let it come. I have two different &quot;live&quot; versions of this song, and he doesn't come close on either one. BUT, I got to see him live for the first time on Kiss' 2001 Farewell tour, and at 51 years old, when he played this song, it was note for f#@$%g note! Absolutley amazing!\n\n&quot;Stormtroopin'&quot; sounds like it could have been on any of the later Amboy Dukes albums, but a good song nonetheless. &quot;Hey Baby&quot; is more of a hard rock blues, a harbinger really, of what a lot of bands were getting ready to do, this could have fit on any early &quot;Bad Company&quot; album, quite comfortably. The same with &quot;Where You Been All My Life&quot; A lot of people point to &quot;Motor City Madhouse&quot; as the guitar tour de Force, for Ted, but when played alongside &quot;StrangleHold&quot; It just doesn't, in my opinion, hold up. And the fake ending on it, kinda makes this one my least favorite on the record.\nThere is a &quot;hidden&quot; gem on this record, that never really got the respect it deserved, &quot;Feel Right At Home&quot;, which is basically just organ, bass, and drums/w.brushes.it is such a cool soulfull little piece, which was such a departure from anything else on the album, and for Ted personally, that it just never got the attention it deserved. If you have this album, throw that little number on, forget that it's Nugent, and REALLY listen to it. You'll be sorry you missed it all this time.\nFor me, there is a &quot;Holy Trio&quot; of &quot;must listen to&quot; songs on this album, that whenever I pull the album out I...well, must listen to..lol The first one being &quot;StrangleHold&quot; of course. The second one is &quot;Just What The Doctor Ordered&quot; Which, if you listen closely is Ted telling his story, of how he got to that point. The guitar riff in this song is just fantastic, as is the playing, the arrangement and the structure. As on StrangleHold&quot;, Nugent steps out of his &quot;box&quot; in his playing, and it pays off big time. The other one is &quot;Snakeskin Cowboys&quot;, While not really being a departure guitar wise for him, it is a great song that again, I feel never, got it's due. And the &quot;tough guy&quot; imagry in the lyrics is excellent. This is the kind of song, that he seemed to be aiming the Dukes at all along, and in that vein, it deserves more attention than it recieved.\n\nFor what it's worth. My band usually ends it's night with &quot;Stranglehold&quot; and knowing that we can never even get close to Ted's brilliance on this song, we just basically use the middle section to give everyone in the band a solo, and it works, at least from my perspective. I always introduce the song by saying &quot;We are the only band in Orlando crazy enough to try this song&quot; Whether that's the true case or not, It hypes the crowd, because they know what is coming...lol\n\nFor me, although he did have some songs later that rated with the ones on this album, he never really had an album that held together as well as this one. A brilliant moment of everything working right at the right time. And a primer to the Metal assault that was soon to be upon us in 80's.","torrent":{"xt":"urn:btih:f328f3fffff106ddfbfb138c2898f3aa741a08e4","amp;dn":"Ted+Nugent+-+Motor+City+Madness+320cbr+%28Big+Papi%29+2002+Sony+Musi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f328f3fffff106ddfbfb138c2898f3aa741a08e4","infoHashBuffer":{"type":"Buffer","data":[243,40,243,255,255,241,6,221,251,251,19,140,40,152,243,170,116,26,8,228]},"announce":[],"urlList":[]}}