{"title":"Microsoft Office 2016 v15.13.3 (Mac OSX) [DEVIOUS]","uid":15766602,"size":1185410687,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:f3ecdff3c9ff03788e99c5cfa9917e41155d3c29&amp;dn=Microsoft+Office+2016+v15.13.3+%28Mac+OSX%29+%5BDEVIOUS%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":26,"uploader":"deviousc","files":2,"time":1473154495,"description":"\n\r\nMicrosoft Office 2016 v15.13.3 (Mac OSX) [DEVIOUS]\r\n\r\nOS:\t\tMac OSX\r\nSize:\t\t1.1 GB\r\nLanguage:\tEnglish\r\nType:\t\tProductivity\r\nTags:\t\tMicrosoft Office,Office 2016,Microsoft Office,Devious\r\n\r\n\r\nMicrosoft Office 2016 is the complete, cross-platform, cross-device solution for the modern workplace, with smart tools for individuals, teams, and businesses. It can open your applications, documents anywhere, across multiple devices. Get the installed applications you know and trust - Word, Excel, PowerPoint, OneNote, Outlook, Publisher, Access. Always have the latest, full installed versions of Word, Excel, PowerPoint, OneNote, Outlook, Publisher, and Access and capture your ideas however you work best - using a keyboard, pen, or touchscreen. Microsoft Office 2016 will offer new security, compliance, and deployment features, giving organizations more control over sensitive data and IT more flexibility in deployment and management. \r\n\r\nMicrosoft expanded the Office footprint to iPad and Android tablets. Upgraded Office experiences on the Mac, the iPhone and on the web. Also have been added new apps to the Office family with Sway and Office Lens. All designed to keep your work moving, everywhere. While you've seen us focus on tuning Office for different platforms over the last year, make no mistake, Office on Windows desktop is central to our strategy. \r\n\r\nMicrosoft Office 2016 suite includes applications such as Word, Excel, PowerPoint, and Outlook. Office 2007, Office 2010, Office 365, or Office 2013 users can open documents created without any additional action. Customers using earlier versions of Office may need to download and install a compatibility pack","torrent":{"xt":"urn:btih:f3ecdff3c9ff03788e99c5cfa9917e41155d3c29","amp;dn":"Microsoft+Office+2016+v15.13.3+%28Mac+OSX%29+%5BDEVIOUS%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f3ecdff3c9ff03788e99c5cfa9917e41155d3c29","infoHashBuffer":{"type":"Buffer","data":[243,236,223,243,201,255,3,120,142,153,197,207,169,145,126,65,21,93,60,41]},"announce":[],"urlList":[]}}