{"title":"Pink Floyd-First Australian Show(1971)(2008 GFR Rem.)[AUD A-][EA","uid":4624973,"size":418518302,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f447da3ae7533e148eaf818624e7fa3090353995&amp;dn=Pink+Floyd-First+Australian+Show%281971%29%282008+GFR+Rem.%29%5BAUD+A-%5D%5BEA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"thewall68","files":17,"time":1231178260,"description":"Releaser: thewall\n\nExtractor: EAC 0.99 prebeta 4  \nRead Mode: Secure with NO C2, accurate stream, disable cache.\nCodec: Flac 1.2.1;  Level 8  \nSource: Original CD \nArtwork:  Full Scans 300dp.\n\nLabel:Godfather Records\n\n\nPink Floyd first performed in Australia on Friday 13th August 1971, at Melbourne Festival Hall.\n\nPink Floyd, Melbourne 1971 concert flyerThey arrived in Australia on 11th August 1971, and at Melbourne Airport they were interviewed by Gary Mac for Go-Set (a 24 page music newspaper). Australian journalists, not realising that the Floyd disliked talking about the music, actually received a couple of decent interviews with all the members of the band. Mac's interview plus a review of the Melbourne concert appeared in the Saturday, 28th August 1971 edition of Go-Set (volume 6, number 35).\n\nThe Rock Concert Club of Australia was responsible for bringing Pink Floyd down under on this occasion, but their promotion left a lot to be desired. The resulting audiences put Floyd off coming here again. At each gig, the Rock Concert Club put 10&quot; round, purple leaflets on every seat, telling the audience that if they were members of the club they could have seen the band for free. I am sure that the Floyd were unimpressed by this.\n\nThe Melbourne Festival Hall is renowned for its poor sound, but the Floyd along with their quad sound were able to overcome the hall's shortcomings. The hall was only about half full owing to almost non-existant promotion. At both concerts Pink Floyd were supported by other bands, a very rare occurrence indeed! Pirana came on first and played for one hour followed by Lindsay Bourke. Both bands were well below the Floyd standard of extreme freeform improvisation.\n\nAfter a ten minute break (9:30pm approx), Pink Floyd came on stage and Roger announced &quot;Good evening. This is called Atom Heart Mother&quot;. They then went into a sixteen minute non-orchestrated performance of the piece. After a minute or so of tuning up, Roger announced, &quot;We're just going to retune then we're going to do two things together. The first of which is a song from the soundtrack from the film More, which I hear was banned over here, and it's called Green Is The Colour. And the second is an instrumental called Careful With That Axe, Eugene&quot;. Both songs together lasted fourteen and a half minutes. This was either the last, or the penultimate, performance of Green Is The Colour (I'm not sure if it was played in Sydney).\n\nAfter that, Roger said &quot;This next thing is a new piece, and it's called Echoes. And it's going to take us a minute or two to get it together because one of our lenses has burnt out&quot;. This was the first time it was announced as &quot;Echoes&quot; (and lasted twenty two minutes), but it still had the alternate lyrics for the first verse and chorus, and the quick ending without the multi-tracked choir as at the Montreaux 1971 gig.\n\nThe band then played a twelve and a half minute Set The Controls For The Heart Of The Sun without announcing it. They then played an eleven minute Cymbaline before Roger proclaimed &quot;Okay. This is going to be our last tune. Thank you all for coming. It's called A Saucerful Of Secrets and we'll see you again some time&quot;.\n\n\n\nN.B.\n\nThe sound is not the best, but for a 1971 Audiance recording it's acceptable\n\nN.B. 2\n\nThe date on the cover is wrong; it's not the 13 September but 13 August, of course...\n\n\nLineage: My Silver Cd-EAC-FLAC Levell 8\n\n\n\nTracklisting:\n\n\n\n1 \t  \tAtom Heart Mother (16:09)\n2 \t  \tGreen Is The Colour (4:04)\n3 \t  \tCareful With That Axe, Eugene (10:56)\n4 \t  \tSet The Controls For The Heart Of The Sun (12:48)\n5 \t  \tEchoes (22:10)\n6 \t  \tCymbaline (11:08)\n","torrent":{"xt":"urn:btih:f447da3ae7533e148eaf818624e7fa3090353995","amp;dn":"Pink+Floyd-First+Australian+Show%281971%29%282008+GFR+Rem.%29%5BAUD+A-%5D%5BEA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f447da3ae7533e148eaf818624e7fa3090353995","infoHashBuffer":{"type":"Buffer","data":[244,71,218,58,231,83,62,20,142,175,129,134,36,231,250,48,144,53,57,149]},"announce":[],"urlList":[]}}