{"title":"Le mysterieux docteur Cornelius (1984) 8,1 FR st 85 langues","uid":13726277,"size":518772674,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f50c455157338281af438982f2cfd5a11fd1dfc8&amp;dn=Le+mysterieux+docteur+Cornelius+%281984%29+8%2C1+FR+st+85+langues&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"asc11","files":93,"time":1456967480,"description":"Episode 1 of 6\r\n\r\nXvid 640x480 25 fps 998 kbps\r\nAC3 128 kbps 1ch nonlinear compression\r\n59 min 49 sec\r\n\r\nthumbnails, jpg in torrent\r\nFrench, with subtitles in about 85 languages\r\n\r\n\r\na-suivre.org:\r\nSculpteur de chair\r\n\r\nLa République bananière du Xampana, quelque part en Amérique, est le théâtre de ce premier épisode. Le générique chanté faussement effrayant, aussi mignon que kitchounet a installé une ambiance décalée et légère. Pourtant, dès les premières secondes, un travailleur forcé est abattu de sang froid sous nos yeux. Nous sommes donc installés instantanément dans une atmosphère de fiction familiale, certes, mais de fiction familiale où des choses graves et riches de signification politique peuvent se produire. C’est déjà là une première chose qui a été perdue dans la fiction hexagonale d’aujourd’hui.\r\n\r\nNous faisons la connaissance des deux frères Kramm : il y a Fritz (Jean Bouise) qui se décrit comme le ’’logisticien’’ qui met en application la pensée de son frère : Cornélius (Gérard Desarthe), celui qui a les idées de génie. Comme par exemple d’injecter dans l’eau du robinet la substance d’une plante qui garde docile la population du pays. Au Xampana, le pouvoir se partage entre Jorgell et Dorgan. Pour accomplir leurs desseins, les deux frères diaboliques vont se jouer des tensions qu’ils vont créer et alimenter entre ces deux hommes et entre leurs fils.\r\n\r\nCar, dans sa salle d’autopsie, l’infâme Cornélius découpe les cadavres qu’il aime tant, sauve les parties saines conservées dans une armoire frigorifique. Sculpteur de chair, il a pour sombre dessein de créer de toute pièce, à partir d’un assemblage hétéroclite de morceaux de corps, un homme qui lui obéisse sans faille, et qui lui permettre de devenir le Maître du monde","torrent":{"xt":"urn:btih:f50c455157338281af438982f2cfd5a11fd1dfc8","amp;dn":"Le+mysterieux+docteur+Cornelius+%281984%29+8%2C1+FR+st+85+langues","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f50c455157338281af438982f2cfd5a11fd1dfc8","infoHashBuffer":{"type":"Buffer","data":[245,12,69,81,87,51,130,129,175,67,137,130,242,207,213,161,31,209,223,200]},"announce":[],"urlList":[]}}