{"title":"Aphorisms by Manuel Dimech","uid":7786055,"size":185129726,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f590c527e2bbeb09061902f26f469e874309b46a&amp;dn=Aphorisms+by+Manuel+Dimech&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"lordgatt","files":1,"time":1351895157,"description":"&quot;The true colour of the sea-water is better seen in a small vessel or in the hollow of the hand than in its immense bed. So likewise we can better see the qualities of a man placed in a narrow place, destitute of all power than on a high place, invested with power, the splendour whereof may dazzle our eyes, and make us see prominent virtues where there are only low vices.&quot; Manuel Dimech - Aphorism 1951\n\nThe wisdom enclosed in this book comes to you from a Maltese philosopher of rare qualities.\n\nThe hundreds of aphorisms which the book comprises were penned down when their forsaken author was a thousand miles away from his country and family, exiled and imprisoned at a concentration camp for no other reason than that of being an outspoken maverick.\n\nPublished here for the first time straight from the original manuscripts, these gems of wisdom deal with much about anything under the sun, from politics to religion and home economics; from human foibles to the purpose of life and the meaning of death. \n\nThis is the Definitive Edition of Manuel Dimech's Final Writings.\n\n&quot;Teach the untaught, they will be sure to bless your memory one day, when your teaching will have enabled them to see and partake of the immense treasure you have disclosed to them.&quot; Manuel Dimech - Aphorism 1714\n\nI AM SURE THE SUBJECT OF THIS BOOK, IN TRUE SOCIALIST FASHION, WOULD HAVE LIKED IT TO BE FREE FOR ALL TO ENJOY. THAT IS WHY I HAVE SCANNED IT AND REPRODUCED IT HERE FOR ALL TO ENJOY.","torrent":{"xt":"urn:btih:f590c527e2bbeb09061902f26f469e874309b46a","amp;dn":"Aphorisms+by+Manuel+Dimech","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f590c527e2bbeb09061902f26f469e874309b46a","infoHashBuffer":{"type":"Buffer","data":[245,144,197,39,226,187,235,9,6,25,2,242,111,70,158,135,67,9,180,106]},"announce":[],"urlList":[]}}