{"title":"Slot machine documentation","uid":13312841,"size":127953559,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f5b220fd24f1111e15855955354a74f2b472acc1&amp;dn=Slot+machine+documentation&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"slotleaks","files":119,"time":1453791090,"description":"This is a dump of documentation related to slot machines and the casino industry.\r\n\r\n\r\nFolders:\r\n----------\r\n* Bill Validators - contains documentation for various JCM bill validators and the VTI Matrix. JCM's ID-003 serial protocol is documented in WBA_Service_Manual_with_ID003.pdf\r\n* GSA marketing materials - contains presentations produced by the Gaming Standards Association regarding their new G2S, S2S, and GDS protocols\r\n* Misc. APIs - AmEx CC authorization &quot;PIP terminal&quot; protocol\r\n* Printers - service manuals for the FutureLogic Gen1 and Gen2 and the Ithaca/Transact Epic 950\r\n* Protocols - contains documentation for SAS, G2S, S2S, GDS, and QCOM\r\n* Regulations - contains various jurisdictions' regulatory requirements\r\n* Slots - currently only contains documentation for the Bally ProSlot6000\r\n\r\nThis is probably the only place to get the full IGT Slot Accounting System 6.02 protocol documentation except from IGT themselves! Normally, IGT requires a formal request on company letterhead and a signed non-disclosure agreement to get this documentation.\r\n\r\nThis also contains documentation for several of the Gaming Standards Association's newer protocols, including G2S, S2S, and GDS. However, it seems the versions of these are a few years old, from before the GSA changed their minds about keeping these protocols open. To get current versions requires membership in the GSA costing at minimum $10,000/year. However, the new versions of those protocols should be backwards-compatible with the older versions contained in this torrent","torrent":{"xt":"urn:btih:f5b220fd24f1111e15855955354a74f2b472acc1","amp;dn":"Slot+machine+documentation","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f5b220fd24f1111e15855955354a74f2b472acc1","infoHashBuffer":{"type":"Buffer","data":[245,178,32,253,36,241,17,30,21,133,89,85,53,74,116,242,180,114,172,193]},"announce":[],"urlList":[]}}