{"title":"Cutting Edge - Too Poor for Posh School (11 March 2010)[PDTV(Xvi","uid":5431623,"size":409735168,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f6555645921d42daa9cf33d2105d5e46b8fa5969&amp;dn=Cutting+Edge+-+Too+Poor+for+Posh+School+%2811+March+2010%29%5BPDTV%28Xvi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Inter69","files":1,"time":1268440041,"description":"Channel 4 - 11 March 2010\n\nLondon's elite Harrow School is one of the world's most famous private schools. Renowned for producing statesmen, Churchill and Nehru; writers Richard Curtis and Anthony Trollope; and numerous captains of industry, Harrow is one of the last remaining all-boys boarding schools in Britain and one steeped in history.\n\nYet access into a world seen as the preserve of the super-rich really does come at a price: over a whopping Ã‚Â£28,000 a year in school fees. But for those who can't afford the fees there's another way in. Each year, two boys from far less wealthy families are offered the chance of a scholarship.\n\nThe Peter Beckwith Scholarship is targeted specifically at families who'd never be able to pay for such a privileged education at a boarding school. The means-tested scholarship can pay up to full fees for a boy's entire career at Harrow, and two years at a prep school before they join Harrow at 13 years old. All in all it's worth close to Ã‚Â£200,000.\n\nIn autumn 2009 Harrow granted Cutting Edge access - for the first time - to film the annual selection contest. It all happens on a single day in November.\n\nThe documentary follows the journey of three of the 11 shortlisted boys as they undergo a relentless day of tests and interviews. The parents of 10-year-old Krishan and 11-year-olds Numhan and Tumi can only wait in hope as their sons compete for a prize that will change their lives forever.","torrent":{"xt":"urn:btih:f6555645921d42daa9cf33d2105d5e46b8fa5969","amp;dn":"Cutting+Edge+-+Too+Poor+for+Posh+School+%2811+March+2010%29%5BPDTV%28Xvi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f6555645921d42daa9cf33d2105d5e46b8fa5969","infoHashBuffer":{"type":"Buffer","data":[246,85,86,69,146,29,66,218,169,207,51,210,16,93,94,70,184,250,89,105]},"announce":[],"urlList":[]}}