{"title":"Un Pais Para Comerselo -18 Cordoba [DVDRip][Spanish]","uid":6777422,"size":734021632,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f65c6d7e0ee70da95e5e3b650692142bfdc62f33&amp;dn=Un+Pais+Para+Comerselo+-18+Cordoba+%5BDVDRip%5D%5BSpanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"virana","files":-1,"time":1319790684,"description":"Un Pais Para Comerselo - 18 Cordoba\n\n  En este viaje, Juan, Imanol y Tonino irÃƒÂ¡n en busca de la belleza de la provincia de CÃƒÂ³rdoba. Belleza resumida en lugares como la Medina Azahara, los patios cordobeses, la filigrana... pero tambiÃƒÂ©n en productos tan sutiles como el vino Montilla-Moriles o platos como el salmorejo y el flamenquÃƒÂ­n entre otros.\nCÃƒÂ³rdoba y su legado ÃƒÂ¡rabe\n\nJuan pasearÃƒÂ¡ por los patios de la Mezquita Catedral de CÃƒÂ³rdoba para conocer el legado monumental y cultural que dejaron los ÃƒÂ¡rabes en esta ciudad y disfrutarÃƒÂ¡ de una autÃƒÂ©ntica receta de origen ÃƒÂ¡rabe: el tajÃƒÂ­n de verduras. Por su parte, Imanol pasearÃƒÂ¡ por la ciudad de CÃƒÂ³rdoba evocando el pasado medieval de la ciudad y de la convivencia entre ÃƒÂ¡rabes, cristianos y judÃƒÂ­os. Tonino descubrirÃƒÂ¡ la huella de los romanos en CÃƒÂ³rdoba.\n\nEl esplendor de la ÃƒÂ©poca ÃƒÂ¡rabe ha eclipsado el pasado romano de la ciudad, ya que CÃƒÂ³rdoba fue capital de la BÃƒÂ©tica Romana. Pero en los rincones de la juderÃƒÂ­a Un paÃƒÂ­s para comÃƒÂ©rselo descubrirÃƒÂ¡ tambiÃƒÂ©n tradiciones como la del cuidado de los patios cordobeses, la filigrana o a artesanos que continÃƒÂºan fabricando el autÃƒÂ©ntico sombrero cordobÃƒÂ©s.\nUna provincia de singular belleza\n\nCÃƒÂ³rdoba es una ciudad que invita a nuestros protagonistas a pasearla y como no, a tapear platos tan conocidos de la gastronomÃƒÂ­a cordobesa como las berenjenas a la miel o una de las tortillas de patatas mÃƒÂ¡s grandes que jamÃƒÂ¡s hayan visto nuestros guias particulares.\n\nLa provincia guarda espacios naturales de singular belleza, como el Valle de las Pedroches, un lugar idÃƒÂ³neo para la crianza del cerdo ibÃƒÂ©rico y la producciÃƒÂ³n de uno de los jamones mÃƒÂ¡s afamados; o la Sierra SubbÃƒÂ©tica Cordobesa, que Juan e Imanol descubrirÃƒÂ¡n a lomos de un caballo. En las faldas de estas montaÃƒÂ±as se encaraman pueblos tan singulares como Zuheros, donde Tonino estarÃƒÂ¡ en uno de los monumentos naturales mÃƒÂ¡s sorprendentes de la provincia: la cueva de los murciÃƒÂ©lagos. Por su parte, Juan e Imanol conocerÃƒÂ¡n las tradicionales labores de pastoreo de esta zona y por supuesto, disfrutarÃƒÂ¡n de los quesos que elaboran.\nNaranjas cordobesas, una herencia ÃƒÂ¡rabe\n\nHerencia ÃƒÂ¡rabe fueron tambiÃƒÂ©n las naranjas, y en la zona de Palma del RÃƒÂ­o encontraron un acomodo perfecto entre las aguas del Guadalquivir y las diferencias climÃƒÂ¡ticas que potencian los azÃƒÂºcares de estas naranjas cordobesas (por eso son tan apreciadas por su sabor). Palma del RÃƒÂ­o tiene un gran legado de recetas basadas en este cÃƒÂ­trico. Juan estarÃƒÂ¡ con IÃƒÂ±aki MartÃƒÂ­nez, uno de los cocineros que mÃƒÂ¡s ha sabido sacar partido a la versatilidad de este cÃƒÂ­trico en la cocina.\n\nImanol se trasladarÃƒÂ¡ hacia la zona de producciÃƒÂ³n de los afamados vinos Montilla-Moriles. ConerÃƒÂ¡ a Charo, propietaria de un lagar donde se sigue haciendo estos vinos a la vieja usanza: en tinajas hundidas en el suelo y con el velo de flor, dando esos matices tan ÃƒÂºnicos a estos vinos cordobeses. Impulsado por su pasiÃƒÂ³n por estos vinos, Imanol conocerÃƒÂ¡ a Rafael, uno de los pocos artesanos que siguen construyendo, a base de madera, hierro, fuego y mucha observaciÃƒÂ³n, los barriles donde envejecen los caldos de Montilla-Moriles.\nLa cuna del flamenquÃƒÂ­n\n\nLa campiÃƒÂ±a cordobesa, zona emblemÃƒÂ¡tica en lo que se refiere a la producciÃƒÂ³n de aceite de oliva, llevarÃƒÂ¡ a Un paÃƒÂ­s para comÃƒÂ©rselo hasta la localidad de Bujalance. AdemÃƒÂ¡s de su singular arquitectura, Bujalance es uno de los lugares que puja por ser cuna de nacimiento del flamenquÃƒÂ­n.\n\nNuestro viaje finalizarÃƒÂ¡ en CÃƒÂ³rdoba, donde Juan, Imanol y Tonino serÃƒÂ¡n reclamados por la CofradÃƒÂ­a del Salmorejo para investirles como cofrades de honor y donde celebremos este viaje con todos los amigos que hemos ido conociendo, en torno a un suculento guiso de rabo de toro.         \n","torrent":{"xt":"urn:btih:f65c6d7e0ee70da95e5e3b650692142bfdc62f33","amp;dn":"Un+Pais+Para+Comerselo+-18+Cordoba+%5BDVDRip%5D%5BSpanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f65c6d7e0ee70da95e5e3b650692142bfdc62f33","infoHashBuffer":{"type":"Buffer","data":[246,92,109,126,14,231,13,169,94,94,59,101,6,146,20,43,253,198,47,51]},"announce":[],"urlList":[]}}