{"title":"Vasen - Varldens Vasen 1997","uid":6513735,"size":326096071,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f6f83c3e71d18638815602af03d2d60ab3e81362&amp;dn=Vasen+-+Varldens+Vasen+1997&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"barber9","files":-1,"time":1309735880,"description":"VÃƒÂ¤sen ÃƒÂ¤r en svensk folkmusikgrupp frÃƒÂ¥n Uppsala bestÃƒÂ¥ende av Olov Johansson (nyckelharpa), Mikael Marin (altfiol) och Roger Tallroth (gitarrer, bosoki, oud, mandola) samt ibland ÃƒÂ¤ven Andre Ferrari (slagverk). Man spelar sÃƒÂ¥vÃƒÂ¤l traditionellt material som egna kompositioner. Gruppen turnerar varje ÃƒÂ¥r ÃƒÂ¤ven utanfÃƒÂ¶r Europa.\n\nVÃƒÂ¤sen spelade pÃƒÂ¥ Nordmans fÃƒÂ¶rsta skiva (1994). PÃƒÂ¥ den finska gruppen JPPs skiva String Tease (1998) var VÃƒÂ¤sen gÃƒÂ¤startister pÃƒÂ¥ tvÃƒÂ¥ spÃƒÂ¥r. Gruppen hÃƒÂ¶ll 2003 tillsammans med SÃƒÂ¶dermanlands-Nerikes nationskÃƒÂ¶r en konsert i Norbergs kyrka. (wikipedia)\n\nDiskografi\n   \n1990 - VÃƒÂ¤sen\n1992 - Vilda VÃƒÂ¤sen\n1993 - Essence\n1996 - Levande VÃƒÂ¤sen\n1997 - VÃƒÂ¤rldens VÃƒÂ¤sen\n1997 - Spirit\n1999 - Gront\n2001 - Live at the Nordic Roots Festival\n2003 - Trio\n2004 - Keyed Up\n2005 - Live in Japan\n2007 - Linnaeus VÃƒÂ¤sen\n2007 - Mike Marshall &amp; Darol Anger with VÃƒÂ¤sen\n2009 - VÃƒÂ¤sen Street\n\n- - -\n\nOlov Johansson and Mikael Marin started playing together as teenagers around 1980. During the early 1980's they would regularly visit Curt and Ivar Tallroth and Eric SahlstrÃƒÂ¶m, older musicians who lived nearby in the Uppland region, where they would play and learn traditional music from them. In this way they became a link in the living tradition that Swedish folk music has enjoyed through the centuries.\n\nIn 1989, at a music gathering in Roros, Norway, Olov met Roger Tallroth and asked if he would like to try to jam on nyckelharpa and guitar for a bit. Roger declined, intent at that moment on taking a shower. Fortunately, the shower was occupied, so Roger returned with his guitar, and they played for the rest of the day and far into the night. Among the witnesses to this fateful jam session was Olle Paulsson, who thought it was the best music he had ever heard, and made a promise to start a record label if they were willing to be recorded for a CD (and thus Drone Music was born).\n\nThe following summer Olov became World Champion of both the modern chromatic and older historical nyckelharpas at the first-ever Nyckelharpa World Championships at Osterbybruk, Sweden. The added momentum for the first CD recording, which was entitled Olov Johansson, VÃƒÂ¤sen. VÃƒÂ¤sen is a Swedish word with many meanings: spirit, noise, a living being, essence among the most prominent. It was originally meant to just be an album title, but soon people were calling to book the band VÃƒÂ¤sen and the name stuck.\n\nInitially some traditionalists (or something else, it wasn't many at all) in the Swedish folkmusic community showed some resistance to VÃƒÂ¤sen. While Olov and Mikael were playing fairly straightforward folkmusic duets, Roger's guitar definitely provided a different twist on Swedish traditional music. Yet it's exactly the guitar chordings and rhythms that also attracted an entirely new audience, and the band's popularity gradually grew, along with their international reputation.\n\nIn 1994, with two more studio albums under their belt (Vilda VÃƒÂ¤sen on Drone and Essence on the French Auvidis/Ethnic label), VÃƒÂ¤sen were asked to participate on a project of Swedish rock musician Mats Wester called Nordman, which featured rock music and lyrics but with arrangements and playing by VÃƒÂ¤sen. The first Nordman CD was a huge hit in Sweden, and the band embarks on two tours and records a second Nordman CD, playing in front of audiences of up to 25,000 people. On the first Nordman tour they meet drummer Andre Ferrari and eventually experiment with a drums-and-bass version of VÃƒÂ¤sen. Ultimately, they settle on Andre playing hand percussion, and the band officially becomes a quartet in 1996.\n\nIn 1997 the quartet goes into the studio and records Varldens VÃƒÂ¤sen (Whirled in North America). Tours of Norway, Denmark, Finland, Italy, France, the United States and Canada follow, as does a Swedish Grammy and two appearances on the national radio program A Prairie Home Companion in the U.S. In 1999 the band releases their sixth CD, Gront.\n\nMeanwhile the members of the band were getting older, having babies and facing the challenges of being a musician in the modern age. A widespread U.S. tour in September 2001 had to be scrapped after 9/11. Although the tour was rescheduled for 2002, Andre's reluctance to tour and economics forced the band to decide to come over as the original trio. The success and pleasure of playing a new set of trio material culminated in new recordings. (vasen.se)\n\n- - - \n\n\nVÃƒÂ¤sen - VÃƒÂ¤rldens VÃƒÂ¤sen 1997\n(Vaxholm Xource)\n\nFÃƒÂ¶rsta gÃƒÂ¥ngen som trumslagaren Andre Ferrari medverkar och gruppen upptrÃƒÂ¤der som kvartett. PÃƒÂ¥ albumet bÃƒÂ¶rjar de ÃƒÂ¤ven gÃƒÂ¥ ifrÃƒÂ¥n den traditionella folkmusiken och nÃƒÂ¤rma sig vÃƒÂ¤rldsmusiken.\n\t\n 1. Kapten Kapsyl (Captain Bottlecap)\n 2. Bambodansarna (The Bambo Dancers)\n 3. BÃƒÂ¶rjar du Fatta (Do You Get The Picture?)\n 4. Shapons Vindaloo\n 5. Nitti Pomfritti (90 French Fries)\n 6. 30-ÃƒÂ¥rs Jiggen (Thirty Year Jig)\n 7. Anno 1643\n 8. TÃƒÂ¤rtulingen\n 9. SÃƒÂ¥ld och Solde (Sold or Sale)\n10. En Timme I Ungern (One Hour In Hungary)\n11. Till Farmor (To Grandma)\n","torrent":{"xt":"urn:btih:f6f83c3e71d18638815602af03d2d60ab3e81362","amp;dn":"Vasen+-+Varldens+Vasen+1997","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f6f83c3e71d18638815602af03d2d60ab3e81362","infoHashBuffer":{"type":"Buffer","data":[246,248,60,62,113,209,134,56,129,86,2,175,3,210,214,10,179,232,19,98]},"announce":[],"urlList":[]}}