{"title":"Black Sabbath - Sabotage [24 bit FLAC] vinyl","uid":8107847,"size":969320254,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f71d3fb6e9e04250d1354ed3400e87f78fe3fda8&amp;dn=Black+Sabbath+-+Sabotage+%5B24+bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"24.96","files":-1,"time":1360115210,"description":"Sabotage is the final release of Black Sabbath's legendary First Six, and it's also the least celebrated of the bunch, though most die-hard fans would consider it criminally underrated. The band continues further down the proto-prog metal road of Sabbath Bloody Sabbath, and this time around, the synthesizers feel more organically integrated into the arrangements. What's more, the song structures generally feel less conventional and more challenging. There's one significant exception in the blatant pop tune &quot;Am I Going Insane (Radio),&quot; which rivals &quot;Changes&quot; as the most fan-loathed song of the glory years, thanks to its synth-driven arrangement (there isn't even a guitar riff!) and oft-repeated one-line chorus. But other than that song and the terrific album opener, &quot;Hole in the Sky,&quot; the band largely eschews the standard verse-chorus format, sticking to one or two melody lines per riffed section and changing up the feel before things get too repetitive. The prevalence of this writing approach means that Sabotage rivals Vol. 4 as the least accessible record of Sabbath's glory years. However, given time, the compositional logic reveals itself, and most of the record will burn itself into the listener's brain just fine. The faster than usual &quot;Symptom of the Universe&quot; is a stone-cold classic, its sinister main riff sounding like the first seed from which the New Wave of British Heavy Metal would sprout (not to mention an obvious blueprint for Diamond Head's &quot;Am I Evil?&quot;). Like several songs on the record, &quot;Symptom&quot; features unexpected acoustic breaks and softer dynamics, yet never loses its drive or focus, and always feels like Sabbath. Less immediate but still rewarding are &quot;Thrill of It All,&quot; with its triumphant final section, and the murky, sullen &quot;Megalomania,&quot; which never feels as long as its nearly nine and a half minutes. But more than the compositions, the real revelation on Sabotage is Ozzy Osbourne, who turns in his finest vocal performance as a member of Black Sabbath. Really for the first time, this is the Ozzy we all know, displaying enough range, power, and confidence to foreshadow his hugely successful solo career. He saves the best for last with album closer &quot;The Writ,&quot; one of the few Sabbath songs where his vocal lines are more memorable than Tony Iommi's guitar parts; running through several moods over the course of the song's eight minutes, it's one of the best performances of his career, bar none. Unfortunately, after Sabotage, the wheels of confusion came off entirely. Yes, there were technically two more albums, but for the non-obsessive, the story of Osbourne-era Sabbath effectively ends here.","torrent":{"xt":"urn:btih:f71d3fb6e9e04250d1354ed3400e87f78fe3fda8","amp;dn":"Black+Sabbath+-+Sabotage+%5B24+bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f71d3fb6e9e04250d1354ed3400e87f78fe3fda8","infoHashBuffer":{"type":"Buffer","data":[247,29,63,182,233,224,66,80,209,53,78,211,64,14,135,247,143,227,253,168]},"announce":[],"urlList":[]}}