{"title":"Grateful Dead - Road Trips: Vol. 3, No. 3 [FLAC] TQMP","uid":5713740,"size":1997740344,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f72aff8bcb685b7446a8f1b1990cddff109d3761&amp;dn=Grateful+Dead+-+Road+Trips%3A+Vol.+3%2C+No.+3+%5BFLAC%5D+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"pastafari","files":71,"time":1280001951,"description":"Grateful Dead - Road Trips: Vol. 3, No. 3: Fillmore East 5.15.70 [Live]\n2010\n\nOnce a deadhead, always a deadhead?\n\nBrought to you by TQMP\nThe Quality Music Project\n\nDisk set and suggestion to share, courtesy of slipper girl.\nArtwork scanning and stitching, courtesy of kubinetsqatsi.\nRipping and seeding the goddamn thing, pastafari.\n\n- - - - - - - \n\nNew 1970 &quot;Road Trips&quot; Features Prime Acoustic and Electric Dead\n\nCan it really be 40 years since Workingman's Dead was released? Why, it feels like only yesterday that &quot;Uncle John's Band&quot; first started wafting out over the FM airwaves, spreading its warm smile coast to coast and announcing to the world that the Good Ol' Grateful Dead were now traveling to some cool new spaces (in addition to most of their deliciously weird old ones). This edition of Road Trips (Vol. 3, No. 3) celebrates that magical and transformative spring of 1970 with one of the best-loved aural documents of that era: The Dead's early and late shows at the Fillmore East on May 15, 1970, presented nearly in their entirety over the first 3-CD set in this series (plus the accompanying Bonus Disc).\n\nThis was a big tour for the Grateful Dead family. For one thing, it was the first jaunt the Dead undertook with their country-rock offshoot, the New Riders of the Purple Sage (which at this point still included Garcia on pedal steel guitar), as their opening act. As an added treat, at a number of shows that spring--including these two--the Dead started the evening by playing a casual and intimate acoustic set consisting mostly of old folk and blues tunes, but also usually featuring a few songs from the (still unreleased) Workingman's Dead. Over the course of the two acoustic sets that night the group tackled such tunes as &quot;I Know You Rider,&quot; &quot;The Rub (Ain't It Crazy),&quot; &quot;Deep Elem Blues&quot; (which does not appear on the previously circulating recordings of the late show), &quot;Uncle John's Band,&quot; &quot;Black Peter,&quot; &quot;New Speedway Boogie,&quot; &quot;Candyman,&quot; &quot;Friend of the Devil&quot; (those last two wouldn't turn up until American Beauty later in 1970), and these four which have never before appeared on an official GD release: &quot;The Ballad of Casey Jones,&quot; &quot;Long Black Limousine,&quot; &quot;She's Mine&quot; (sung by Pigpen) and &quot;A Voice From on High,&quot; the last featuring John &quot;Marmaduke&quot; Dawson and David Nelson from the New Riders. There's plenty of charming between-songs banter and the sound is crystal clear.\n\nThere is lots to love in the electric sets the Dead played at the Fillmore East, too, including truly epic versions of &quot;Dark Star,&quot; &quot;That's It for the Other One&quot; and &quot;Morning Dew&quot;; favorites like &quot;China Cat &gt; I Know You Rider,&quot; &quot;St. Stephen&quot; and &quot;Cosmic Charlie&quot;; the exciting new tunes &quot;Casey Jones&quot; and &quot;Cumberland Blues&quot; (which they also played acoustic); and Pigpen workin' it on out on &quot;Hard to Handle,&quot; &quot;Good Lovin'&quot; and a fantastic &quot;Lovelight.&quot; The Dead always played great at the Fillmore East--this was already the group's third headlining stint there in 1970--and it was shows like these that established the band as a top East Coast draw during this era.\n\nThe Bonus Disc* (which will be included with the first wave or orders) features a few more songs from the Fillmore East shows, such as the second-ever version of &quot;Attics of My Life&quot; (another American Beauty classic) and a hot &quot;Easy Wind&quot; (which previously appeared on Fallout from the Phil Zone), and then a blistering sequence from the previous night's show at Meramec College--Kirkwood, MO: an electric &quot;New Speedway Boogie&quot; (complete with &quot;Nobody's Fault&quot; jam), &quot;St. Stephen,&quot; &quot;Not Fade Away&quot; and &quot;Lovelight.&quot; You can find the complete track listing for all four discs here.\n\nAs with all our releases, Road Trips Vol. 3, No. 3: May 15, 1970 was culled from the Grateful Dead's original tapes by Mr. Jeffrey Norman--the Pride of Petaluma--and mastered to the demanding HDCD spec for maximum power and clarity. The accompanying booklet for this 3-CD set includes vintage photos by Amalie Rothschild and Peter Simon and a historical essay by yours truly. All in all, it's sure to become another treasured favorite. Sound good? You can order it here.\n- Blair Jackson &lt;a href=&quot;\nhttp://www.dead.net/road-trips/road-trips-vol-3-no-3&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.dead.net/road-trips/road-trips-vol-3-no-3&lt;/a&gt;\n\n- - - - - - - \n\nTWO GOOD ACOUSTIC/ELECTRIC SETS FROM 1970 (****)\n\nConsisting of three discs-75,78,76 minutes each approximately (a fourth disc,78 minutes in length if you purchase from G.D., who has a lower price, in a timely manner),which contain most of both sets from that night. All tracks are unreleased except track 5 on the bonus disc (&quot;Easy Wind&quot;), which you can hear on the collection &quot;Fallout From The Phil Zone&quot;,a 2CD set put together by Phil Lesh. The sound is uniformly good with only a couple of instances of any sonic anomalies,which aren't anything to get excited about. The discs are slipped, bare, into a tri-fold cardboard holder. The booklet lists song titles, song lengths, composer (s) and whether the track came from the first or second show. Musicians are listed with instruments-the usual good job done by the Dead folks. Blair Jackson wrote the notes, a look back at those particular shows, the second which he attended, and the many tracks that were to appear on &quot;Workingmnan's Dead&quot; and &quot;American Beauty&quot;. There are also a number of atmospheric color photos of the band-individually and in concert. \n\nFor Deadheads who find the bands acoustic numbers (hear the above 2 albums if you're new) as deeply satisfying (or almost) as their electric excursions into the outer reaches of space, this set will do nicely. Anyone familiar with the bands music during this era will find many songs found on the above mentioned studio albums, plus a couple of songs not as well known. And the magic of a live setting gives this music that something intangible the Dead are known for. The Dead, who had released &quot;Live Dead&quot; only a few months before, had now incorporated country songs and old blues tunes into their repertoire. Garcia had begun playing with NEW RIDERS OF THE PURPLE SAGE, and Bob Weir had also started to add a number of tried and true country songs into the Dead's live sets. Songs like &quot;Don't Ease Me In&quot; by the great country blues artist Henry Thomas, and &quot;The Rub&quot;, &quot;She's Mine&quot;, and &quot;Katie Mae&quot; by Lightnin' Hopkins, alongside country songs like &quot;Silver Threads and Golden Needles&quot;, were given the Dead treatment, which wasn't really a stretch because the band routinely incorporated into their set lists different genres of music from the beginning. GRATEFUL DEAD lyricist Robert Hunter (who was living with Garcia at the time) was also looking back to the music that had inspired him in the early days, and was starting to write more folk, country, and blues themes into his songs. \n\nThe first disc (the early show) contains a large chunk of the first show (more from that show is on a portion of the bonus disc + tracks from the previous night in St. Louis),and songs like &quot;I Know You Rider&quot;, and &quot;Aint't It Crazy (The Rub)&quot; set things up for a relaxed evening with the GRATEFUL DEAD-which of course morphs into the electric portion with &quot;Casey Jones&quot;,&quot;St. Stephen&quot;, and so on. If you don't have the bonus disc, which contains a number of great tracks, the song selection on these three discs is just fine for getting the feel of what was happening on stage. \n\nThe second disc (beginning of the late show) is again acoustic at the outset (something the band didn't do to often) with some nice versions of &quot;Deep Elem Blues&quot;, &quot;Black Peter&quot;, and &quot;Friend of the Devil&quot;. On &quot;She's Mine&quot; and &quot;Katie Mae&quot;, Pigpen steps up to the mic with his gravelly blues voice while the subtle acoustic underpinnings contrast with his rough voice nicely. These tracks are evidence of just what the band lost with his death. The track &quot;A Voice From On High&quot;,with Marmaduke and David Nelson (from NEW RIDERS OF THE PURPLE SAGE) on extra vocals and a nicely played mandolin, give this track a deeper country feel than other tracks here, and is a nice surprise. From there the group (after a short introduction by the late Bill Graham) shifts into its electric mode and proceeds to deliver the kind of music the band is known for. The song &quot;I Know You Rider&quot; is given an electric outing, which is in stark contrast to the acoustic version from the first set, which shows how the band could take a song in any direction they felt like at the time. \n\nThe third disc (of the late show) continues the electric portion of the show with &quot;Good Lovin'&quot; (with a drum solo), and then a good &quot;Dark Star&quot; (with some nice electronic sounds)/&quot;St. Stephen&quot;/&quot;Not Fade Away&quot;/&quot;Turn on Your Lovelight&quot;, and ends with &quot;Cold Jordan&quot;, a nice way to end the show. The contrast between the acoustic numbers and then the often transcendent electric portions of this show once again prove the GRATEFUL DEAD were capable of going in virtually any direction they chose (and some they didn't consciously choose), and could start off at one point and then somehow end up somewhere else. But it all seems to somehow make sense-even if you're not hearing this music in a live setting. Garcia's guitar, with the band weaving in and out,over and around him is, at times, capable of lifting you up and transporting you to that special place that only the Dead were capable of doing. Very few bands had (have) that certain &quot;something&quot; that separates good bands from great ones-and the GRATEFUL DEAD had it. \n\nIf your tastes run towards the period (1970's)when the band was bringing in close harmonies together with acoustic instruments, and then segueing into that satisfying electric sound that only they could develop-this is something worth purchasing. The chance to hear not one, but two acoustic sets before their electric excursions into the nether regions of space shouldn't be missed. This is one of the better &quot;Road Trips&quot; sets the band has released-the care the band take no matter if the music is acoustic or electric is evident. So, sit back and let the music work its special magic, you won't be sorry.\n- Stuart Jefferson, top 100 amazon.com reviewer.\n\nTrack List\nDisc 1\n01- Don't Ease Me In\n02- I know You Rider\n03- Ain't It Crazy (The Rub)\n04- Long Black Limousine\n05- New Speedway Boogie\n06- Casey Jones\n07- St. Stephen\n08- That's It For The Other One\n09- Cosmic Charlie\n10- New Minglewood Blues\n\nDisc 2\n01- Deep Elem Blues\n02- The Ballad Of Casey Jones\n03- Silver Threads And Golden Needles\n04- Black Peter\n05- Friend Of The Devil\n06- Uncle John's Band\n07- She's Mine\n08- Katie Mae\n09- A Voice From On High\n10- China Cat Sunflower\n11- I know You Rider\n12- Cumberland Blues\n13- Hard To Handle\n14- Morning Dew\n15- Dire Wolf\n\nDisc 3\n01- Good Lovin'\n02- Dark Star\n03- St. Stephen\n04- Not Fade Away\n05- Turn On Your Lovelight\n06- Cold Jordan\n\nBonus Disc\n01- Friend of the Devil\n02- Candyman\n03- Cumberland Blues\n04- Cold Jordan\n05- Easy Wind\n06- Attics of My Life\n07- Beat It on Down the Line\n08- Next Time You See Me\n09- New Speedway Boogie\n10- St. Stephen\n11- Not Fade Away\n12- Turn On Your Lovelight\n\nArtwork, EAC log and CUE sheet included.\n\nAudio format: FLAC (Free Lossless Audio Codec) &lt;a href=&quot;\nhttp://flac.sourceforge.net/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://flac.sourceforge.net/index.html&lt;/a&gt; \n\nEnjoy, seed and inhale!\n\nLegalise it!\n\nPastafari Cubensis &lt;a href=&quot;\nhttp://thepiratebay.se/user/pastafari/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/pastafari/&lt;/a&gt;\nProud Member of the Church of the Flying Spaghetti Monster &lt;a href=&quot;\nhttp://venganza.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://venganza.org&lt;/a&gt;","torrent":{"xt":"urn:btih:f72aff8bcb685b7446a8f1b1990cddff109d3761","amp;dn":"Grateful+Dead+-+Road+Trips%3A+Vol.+3%2C+No.+3+%5BFLAC%5D+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f72aff8bcb685b7446a8f1b1990cddff109d3761","infoHashBuffer":{"type":"Buffer","data":[247,42,255,139,203,104,91,116,70,168,241,177,153,12,221,255,16,157,55,97]},"announce":[],"urlList":[]}}