{"title":"Cryptography and Network Security ,5th Edition {BBS}","uid":6801740,"size":8366547,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f72d56c87d699367356e0bec3535dc86a5811e00&amp;dn=Cryptography+and+Network+Security+%2C5th+Edition+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1320705247,"description":"William Stallings' Cryptography and Network Security: Principles and Practice, 5e is a practical survey of cryptography and network security with unmatched support for instructors and students.\n\nIn this age of universal electronic connectivity, viruses and hackers, electronic eavesdropping, and electronic fraud, security is paramount. This text provides a practical survey of both the principles and practice of cryptography and network security. First, the basic issues to be addressed by a network security capability are explored through a tutorial and survey of cryptography and network security technology. Then, the practice of network security is explored via practical applications that have been implemented and are in use today. An unparalleled support package for instructors and students ensures a successful teaching and learning experience.\n\nThe new edition has been updated to include coverage of the latest topics including expanded coverage of block cipher modes of operation, including authenticated encryption; revised and expanded coverage of AES; expanded coverage of pseudorandom number generation; new coverage of federated identity, HTTPS, Secure Shell (SSH) and wireless network security; completely rewritten and updated coverage of IPsec; and a new chapter on legal and ethical issues.\n\n\nAbout the Author\n\nWilliam Stallings has made a unique contribution to understanding the broad sweep of technical developments in computer networking and computer architecture. He has authored 18 titles, and counting revised editions, a total of 35 books on various aspects of these subjects. In over 20 years in the field, he has been a technical contributor, technical manager, and an executive with several high-technology firms. Currently he is an independent consultant whose clients have included computer and networking manufacturers and customers, software development firms, and leading-edge government research institutions.\n\nHe has received the prize for best Computer Science and Engineering textbook of the year from the Textbook and Academic Authors Association six times.\n\nBill has designed and implemented both TCP/IP-based and OSI-based protocol suites on a variety of computers and operating systems, ranging from microcomputers to mainframes. As a consultant, he has advised government agencies, computer and software vendors, and major users on the design, selection, and use of networking software and products.\n\nDr. Stallings holds a Ph.D. from M.I.T. in Computer Science and a B.S. from Notre Dame in Electrical Engineering.\nProduct Details\n\n    * Hardcover: 744 pages\n    * Publisher: Prentice Hall; 5 edition (January 24, 2010)\n    * Language: English\n    * ISBN-10: 0136097049\n    * ISBN-13: 978-0136097044","torrent":{"xt":"urn:btih:f72d56c87d699367356e0bec3535dc86a5811e00","amp;dn":"Cryptography+and+Network+Security+%2C5th+Edition+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f72d56c87d699367356e0bec3535dc86a5811e00","infoHashBuffer":{"type":"Buffer","data":[247,45,86,200,125,105,147,103,53,110,11,236,53,53,220,134,165,129,30,0]},"announce":[],"urlList":[]}}