{"title":"New Age Cults And Religions - Texe Marrs","uid":11719241,"size":9233862,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f74158306831d2f176e87b9375da67a8c89e50c2&amp;dn=New+Age+Cults+And+Religions+-+Texe+Marrs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"starxteel","files":1,"time":1424738781,"description":"\n\nAcross America and the world dangerous New Age cults and religious groups are growing in strength and numbers. As many as 50 million Americans are now New Age cultists while millions of others are unwittingly dabbling and experimenting in the occult through direct or indirect involvement with New Age religious and political organizations.\n\nThis is the first authoritative guide to the New Age cults and religions infecting and threatening our society. This outstanding work carefully analyzes these groups, revealing substantial, detailed information to convincingly answer the questions most asked. It clearly contrasts the false--sometimes bizarre--and unorthodox teachings and practices of the New Cults with the Living Truths contained in the Holy Bible.\n\n\nAbout the author:\n Texe Marrs is author of the landmark #1 national bestseller, Dark Secrets of the New Age, and 35 other books. He has taught American defense policy, international affairs, and political science at the University of Texas at Austin and two other universities. A retired career officer in the U.S. Air Force, he served throughout Europe and Asia. His Power of Prophecy shortwave radio program is heard around the world","torrent":{"xt":"urn:btih:f74158306831d2f176e87b9375da67a8c89e50c2","amp;dn":"New+Age+Cults+And+Religions+-+Texe+Marrs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f74158306831d2f176e87b9375da67a8c89e50c2","infoHashBuffer":{"type":"Buffer","data":[247,65,88,48,104,49,210,241,118,232,123,147,117,218,103,168,200,158,80,194]},"announce":[],"urlList":[]}}