{"title":"Bernadette Peters- The Sondheim Albums","uid":5627208,"size":206264630,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f7a6848ed337ed7745102ba2bc30c660b5fc0fe7&amp;dn=Bernadette+Peters-+The+Sondheim+Albums&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"hkbrandon","files":23,"time":1276525782,"description":"This live concert from 1997, a benefit for the Gay Men's Health Crisis, was Bernadette Peters's Carnegie Hall debut, and it's a joy. Peters has always had a special affinity for the music of Stephen Sondheim, and she spotlights some of his best songs, only a few of them from the shows she's best known for, Into the Woods and Sunday in the Park with George. The program is part career retrospective--including non-Sondheim selections from Mack and Mabel and Dames at Sea--and part wish list, which provides a forum for Peters's pouty humor (&quot;In this movie [Dick Tracy], this song was sung by a blonde bombshell... not me. Although we both have religious names.&quot;). She's backed by a full orchestra conducted by Marvin Laird, who also directed Peters's similar program a year later at London's Royal Festival Hall (captured on VHS and DVD). The very appreciative and knowing audience (there's applause at the first words of Dames' &quot;Raining in My Heart&quot;) includes Stephen Sondheim himself. No doubt he was very proud. --David Horiuchi \n\nBernadette Peters's Sondheim Etc. Etc. is, naturally, an addendum of additional material that was not included in Sondheim Etc., the initial recording of her December 9, 1997, Carnegie Hall concert to benefit the Gay Men's Health Crisis. We always figured there was more, especially considering that the original CD mirrored a lot of her 90-minute DVD, Bernadette Peters Live in Concert, which was recorded a year later at London's Royal Festival Hall. And sure enough, a number of songs from London appear on Sondheim Etc. Etc., including her pig Latin rendition of &quot;We're in the Money&quot; (a device originated by Ginger Rogers), songs from her solo albums (the oldie &quot;If You Were the Only Boy&quot; and Peter Allen's &quot;I Never Thought I'd Break&quot; from Bernadette and the country standard &quot;Faithless Love&quot; from I'll Be Your Baby Tonight), and two beautiful and moving songs that would make anyone's list of Bernadette's greatest hits, Andrew Lloyd Webber's &quot;Unexpected Song&quot; (from Song and Dance) and Stephen Sondheim's &quot;Children Will Listen&quot; (from Into the Woods). And because Sondheim is the prevailing theme of the evening, she also sings the gorgeous &quot;With So Little to Be Sure Of&quot; (also from the London DVD) and &quot;Later.&quot; The 52-minute program does include a lot of chatter, which will charm some listeners and bore others. But there's also a lovely encore of &quot;Have Yourself a Merry Little Christmas,&quot; after which Peters wishes her audience a good night. Even if the song selection isn't quite as strong as on the original CD, it's great to have more of the concert available. --David Horiuchi \n","torrent":{"xt":"urn:btih:f7a6848ed337ed7745102ba2bc30c660b5fc0fe7","amp;dn":"Bernadette+Peters-+The+Sondheim+Albums","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f7a6848ed337ed7745102ba2bc30c660b5fc0fe7","infoHashBuffer":{"type":"Buffer","data":[247,166,132,142,211,55,237,119,69,16,43,162,188,48,198,96,181,252,15,231]},"announce":[],"urlList":[]}}