{"title":"Adam Hanieh - Capitalism and Class in the Gulf Arab States [2011","uid":10354507,"size":3684401,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f823381b9e0101213b9f9b17b88533376fd53fc1&amp;dn=Adam+Hanieh+-+Capitalism+and+Class+in+the+Gulf+Arab+States+%5B2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anette14","files":-1,"time":1402711813,"description":"Description\nProduct Details\nBook Title: Capitalism and Class in the Gulf Arab States\nBook Author: Adam Hanieh (Author)\nHardcover: 266 pages\nPublisher: Palgrave Macmillan (June 15, 2011)\nLanguage: English\nISBN-10: 0230110770\nISBN-13: 978-0230110779\n\n===================================================================================\nBook Description\nPublication Date: July 15, 2011\nThe six Arab states of the Gulf Cooperation Council (GCC) play an increasingly prominent role in the global economy and throughout the broader Middle East region. This book analyzes the recent development of Gulf capitalism through to the aftermath of the 2008 economic crisis. Situating the Gulf within the evolution of capitalism at a global scale, it presents a novel theoretical interpretation of this important region of the Middle East political economy. Accompanied by an extensive empirical analysis of all sectors of the GCC economy, the book argues that a new capitalist class, Khaleeji Capital, is forming in the Gulf - with profound implications for the Middle East as a whole.\n\n===================================================================================\nReviews\n&quot;Capitalism and Class in the Gulf Arab States is the first work to be published in English that gives a full understanding of the formation and development of the Gulf capitalist class. Hanieh reminds the reader that the state was and is an essential tool in this process. The state is an essential feature of the economic rule of the class, and therefore of the constitution of the class itself. In other words, it is not a distinct or separate sphere that is external to the ruling class as the 'refiner state' theory pretends. This book allows the reader to see the important role played by GCC countries in the process of economic liberalization in the region, alongside other international institutions, and its increasing influence in the political economy of each country in the region.&quot; - Counterfire\n\n&quot;Hanieh's groundbreaking book argues that we should not view the Gulf Arab states as anomalies in the worldwide economy. Instead, he claims, the story of twentieth-century capitalism could not be told without recounting their central role: the 'global economy is part of the actual essence of the Gulf itself - the development of the global &quot;appears&quot; through the development of the Gulf.'&quot; ... Within Middle Eastern studies, it provides a challenge to the rentier-state framework - the main paradigm for understanding state-society relations and economic development in the Gulf states-...The book is also a contribution toward understanding Gulf capitalist accumulation on a local and regional scale and the connections between Gulf capitalism and the trajectory of the world capitalist system. Lastly, its examination of over five hundred Gulf Cooperation Council (GCC) companies, financial institutions, and projects provides a wealth of empirical data.&quot; - Arab Studies Journal\n\n&quot;Insightful, timely, and welcome...the analytical framework and substantial data he puts forward in the book will help readers map out the current and future processes of regional integration, class formations, and contradictions, and to situate these processes within the wider global political economy.&quot; - International Socialist Review\n\n&quot;The revolts across the Middle East have shaken the world and shown the sheer failure of standard interpretations of the region. Adam Hanieh has supplied us with a book that is desperately needed to shed prevailing stereotypes of the Arab states that dominate political debate and the academic literature alike. This is the most penetrating analysis of the contradictions of capitalism and class in the Gulf States available. It uncovers possible economic and political trajectories of these states like no other.&quot; - Greg Albo, Department of Political Science, York University, Toronto\n\n&quot;Adam Hanieh investigates the ways in which the Gulf Arab oil monarchies are inserted in the global capitalist/imperialist system, assessing their economic function as well as the political-military status that is attached to this function. This remarkable scholarly study informed by a critical perspective is most topical indeed at a time when the Gulf monarchies confirm their role as the key stronghold of reaction in a region deeply shaken by a tremendous revolutionary wave.&quot; - Gilbert Achcar, Professor in Development Studies and International Relations, School of Oriental and African Studies, University of London\n\n===================================================================================\nAbout the Author\nAdam Hanieh is a Lecturer in Development Studies at the School of Oriental and African Studies (SOAS) at the University of London.\n===================================================================================","torrent":{"xt":"urn:btih:f823381b9e0101213b9f9b17b88533376fd53fc1","amp;dn":"Adam+Hanieh+-+Capitalism+and+Class+in+the+Gulf+Arab+States+%5B2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f823381b9e0101213b9f9b17b88533376fd53fc1","infoHashBuffer":{"type":"Buffer","data":[248,35,56,27,158,1,1,33,59,159,155,23,184,133,51,55,111,213,63,193]},"announce":[],"urlList":[]}}