{"title":"Blackwater Park - Dirt Box (1972/1996) [FLAC]","uid":6460744,"size":262796813,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f91ee1b932314b689feaf48d96852681cbdf9fba&amp;dn=Blackwater+Park+-+Dirt+Box+%281972%2F1996%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zibbik","files":16,"time":1307753476,"description":"\nBand: Blackwater Park\nAlbum: Dirt Box\nYear: 1972/1996\nCountry: Germany\nGenre: Hard/Progressive Rock\n\nTrack list:\n\n01. Mental Block (03:18)\n02. Roundabout (05:45)\n03. One's Life (03:03)\n04. Indian Summer (06:10)\n05. Dirty Face (04:25)\n06. Rock Song (08:45)\n07. For No one (03:25)\n\nBlackwater Park:\n*Richard Routledge - guitar, vocals\n*Michael Fechner - guitar\n*Andreas Scholz - bass\n*Norbert Kagelmann - drums\n\nBlackwater Park was a little-known Berlin rock band that recorded its only album in Windrose Studios during December 1971.\n\nFans of the guitar driven, blues-flavored heavy progressive rock formula can't go wrong with 'Dirt Box'. Featuring a British vocalist, the group's sound can be compared to the likes of Free, Armaggedon, and Edgar Broughton Band.\n'Dirt Box', released on BASF, contains six original tracks of varying quality and a cover version of the Beatles' 'For No One' which comes off rather well. The album opens with 'Mental Block'. Containing gutsy guitar riffs which remind me of the band Free, the song features tight riffs that jam, scorching guitar solos, and an airy hammond organ for added effect.\nPowerful riffs guide the listener through 'Roundabout', an aggressive rocker with a slightly psychedelic intro. 'One's Life', 'Indian Summer', and 'Dirty Face' feature great guitar work and take on a heavy blues sound with 'Dirty Face' exploring the realm of boogie blues.\n'Rock Song' stands out for it is the most unique song on the album in terms of sound. The song opens with a spate of aggressive riffs before turning into a doom and gloom rocker with a slight Eastern influence (imagine Black Sabbath performing 'Careful With That Axe, Eugene') before ending in a series of heavy guitar solos. Finally, the album comes to a close with a rocked-up cover version of the 'For No One' from the Beatles' 1966 smash 'Revolver'.\nOverall, 'Dirt Box' has its shining moments, they combined elements from multiple extant and budding rock subgenres to construct their complex sound: hard rock, blues-rock, jazz-rock, acid rock, prog rock, and even proto-metal.\nUnfortunately, the group's one and only album, Dirt Box, released in 1972, failed to advance the band's career beyond its preliminary stages, and it wasn't long before Blackwater Park had quietly called it quits.\nBut, as has often been the case with these obscure Teutonic bands, the cult of Dirt Box gradually grew over the years, and by the start of the new millennium, its occasional CD reissues were being eagerly snapped up by '70s hard prog collectors. \n\n\n","torrent":{"xt":"urn:btih:f91ee1b932314b689feaf48d96852681cbdf9fba","amp;dn":"Blackwater+Park+-+Dirt+Box+%281972%2F1996%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f91ee1b932314b689feaf48d96852681cbdf9fba","infoHashBuffer":{"type":"Buffer","data":[249,30,225,185,50,49,75,104,159,234,244,141,150,133,38,129,203,223,159,186]},"announce":[],"urlList":[]}}