{"title":"The Life Before Her Eyes LIMITED DVDRip XviD-iMBT","uid":5947210,"size":730966016,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f9335450c156a57ca0d3d3621996b95d20a10eaa&amp;dn=The+Life+Before+Her+Eyes+LIMITED+DVDRip+XviD-iMBT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Horrorspoke","files":-1,"time":1289411904,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0815178/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0815178/&lt;/a&gt;\n\nStoryline\n\nA dramatic thriller about Diana, a suburban wife and mother who begins to question her seemingly perfect life--and perhaps her sanity--on the 15th anniversary of a tragic high school shooting. In flashbacks, Diana is a vibrant high schooler who, with her shy best friend Maureen, plot typical teenage strategies--cutting class,fantasizing about boys--and vow to leave their sleepy suburb at the first opportunity. The older Diana, however, is haunted by the increasingly strained relationship she had with Maureen as day of the school shooting approached. These memories disrupt the idyllic life she's now leading with her professor husband Paul and their young daughter Emma. As older Diana's life begins to unravel and younger Diana gets closer and closer to the fatal day, a deeper mystery slowly unravels.\n\nReview:\n\nI saw this film at the AFI International Film Festival in Dallas. This film brought about every single emotion that I think one could have. I cried, laughed and was completely terrified. The film had me examine every little thing that could possibly make me understand the outcome. I haven't seen a film of this caliber in a long time. I was shaking and felt my heart pounding at various points in the film. I am amazed with the director Vadmir who did House of Sand and Fog. He has a unique style of bringing about various elements to convey his message. The cinematography was beautiful and the score was fabulous. James Horner that has done many different works can add another spectacular masterpiece to his list of credits. Eva Ammuri is beautiful and plays a role that is unlike any role anyone has seen from her. Evan Rachel Wood gives another emotional nail biting performance of a troubled teen. She was phenomenal in Thirteen and has come into her own as an adult for the role of Diane. Uma Thurman has never looked better than she did in this film. Young Gabrielle Brennan is the next Dakota Fanning and is a joy to speak with. She has such a wit about her and open to what life has to offer. I can't stop raving about this film as I am completely blown away by the talent and film. The story hits home for so many people and everyone can gain something from it. I can not wait to see it again as I want to re-watch and look for things I missed the first time. Go see the film, it is well worth the 1.5 hours and will have you on the edge of your seat.\n\nSCREENS:\n &lt;a href=&quot;\nhttp://image.bayimg.com/daaijaadh.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/daaijaadh.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://image.bayimg.com/daailaadh.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/daailaadh.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://image.bayimg.com/daainaadh.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/daainaadh.jpg&lt;/a&gt;\n\n\nSeed and enjoy folks!!!","torrent":{"xt":"urn:btih:f9335450c156a57ca0d3d3621996b95d20a10eaa","amp;dn":"The+Life+Before+Her+Eyes+LIMITED+DVDRip+XviD-iMBT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9335450c156a57ca0d3d3621996b95d20a10eaa","infoHashBuffer":{"type":"Buffer","data":[249,51,84,80,193,86,165,124,160,211,211,98,25,150,185,93,32,161,14,170]},"announce":[],"urlList":[]}}