{"title":"How to Change the World - Social Entrepreneurs and the Power of","uid":7937358,"size":734174,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f991b0c73606fb2b9265646945aea5de26301a49&amp;dn=How+to+Change+the+World+-+Social+Entrepreneurs+and+the+Power+of+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"KatQwerty","files":3,"time":1355894888,"description":"\n\n\nHow to Change the World provides vivid profiles of social entrepreneurs. The book is an In Search of Excellence for social initiatives, intertwining personal stories, anecdotes, and analysis. Readers will discover how one person can make an astonishing difference in the world.\n \n \nThe case studies in the book include Jody Williams, who won the Nobel Peace Prize for the international campaign against landmines she ran by e-mail from her Vermont home; Roberto Baggio, a 31-year old Brazilian who has established eighty computer schools in the slums of Brazil; and Diana Propper, who has used investment banking techniques to make American corporations responsive to environmental dangers.\n \n \nThe paperback edition will offer a new foreword by the author that shows how the concept of social entrepreneurship has expanded and unfolded over the last few years, including the Gates-Buffetts charitable partnership, the rise of Google, and the increased mainstream coverage of the subject. The book will also update the stories of individual social entrepreneurs that appeared in the cloth edition.\n \n \n","torrent":{"xt":"urn:btih:f991b0c73606fb2b9265646945aea5de26301a49","amp;dn":"How+to+Change+the+World+-+Social+Entrepreneurs+and+the+Power+of+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f991b0c73606fb2b9265646945aea5de26301a49","infoHashBuffer":{"type":"Buffer","data":[249,145,176,199,54,6,251,43,146,101,100,105,69,174,165,222,38,48,26,73]},"announce":[],"urlList":[]}}