{"title":"Mickey Hart - Supralingua (1998) [FLAC]","uid":15601993,"size":592544587,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f9f0f81c09d9d9b064ad0020d4b9ea3ec5e22453&amp;dn=Mickey+Hart+-+Supralingua+%281998%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Earthling1","files":31,"time":1471667675,"description":"AllMusic Review by Stephen Thomas Erlewine\r\n\r\nEver since the early '90s, when he released the acclaimed Drumming at the Edge of Magic book and the book/record set, Planet Drum, Mickey Hart was nearly as well-known as a world music aficionado as he was a member of the Grateful Dead. World music was an obsession of his for many years, but those two projects thrust both his interests and himself into the national spotlight, making him a figurehead for the genre. Once the Dead disbanded in the mid-'90s, he was able to devote more time to his world music projects, resulting first in the fine Mystery Box, then Supralingua. Basically, Supralingua is a continuation of the direction he began with Planet Drum, boasting a similar selection of polyrhythmic, multicultural pieces. There aren't really any songs on the record -- just extended grooves, where even the vocals fit into the gigantic, everlasting drum beats. To some, this can be quite monotonous, to others utterly mesmerizing -- there's no middle ground, really, and it all depends on whether the strength of the grooves and their inherent mysticism outweigh the formless compositions. Still, it's hard to argue that Supralingua isn't a successful extension of the ideas Hart began with Planet Drum, even if it isn't as compelling as Mystery Box","torrent":{"xt":"urn:btih:f9f0f81c09d9d9b064ad0020d4b9ea3ec5e22453","amp;dn":"Mickey+Hart+-+Supralingua+%281998%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9f0f81c09d9d9b064ad0020d4b9ea3ec5e22453","infoHashBuffer":{"type":"Buffer","data":[249,240,248,28,9,217,217,176,100,173,0,32,212,185,234,62,197,226,36,83]},"announce":[],"urlList":[]}}