{"title":"Earth (2007) - DTS - dutch subs","uid":4143946,"size":4682522976,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:fd1ce043256448a0d759545957cc686e0aace65c&amp;dn=Earth+%282007%29+-+DTS+-+dutch+subs+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rolfpoland","files":31,"time":1208632864,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0393597/synopsis&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0393597/synopsis&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.loveearth.com/uk/film&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.loveearth.com/uk/film&lt;/a&gt;\n\n\nEnglish:\n\nDVD:\n\nTitel: Earth [2007] (Pal)\nAge: 6 years and older\nMenu: yes\nExtra&amp;#039;s: yes\nSound: 5.1 - DTS - English\nSubs: Dutch only (on/off)\nDisc Format: DVD 5\nFormat: Video_ts\nCover: Dutch cover include\nComression program: Dvd rebuilder prof 10cce\n\n\nEARTH represents the last chance to see some of our planets most beautiful animals and a first encounter with spectacular locations that have never before been filmed. Alastair Fothergill, Director\n\nFive years in the making, EARTH follows the influence of the sun on life on the planet. The critical and international success of Deep Blue proved that audiences were eager to be immersed in the natural history of our world. Now EARTH takes audiences on an unforgettable journey around the planet, using the sun as our guide, and three engrossing characters to tell its story. Narrated by Patrick Stewart and with music composed and conducted by George Fenton, EARTH offers us a chance to recognise and celebrate the beauty of our planet; whilst at the same time it serves as a timely reminder of the ecological fragility of our planet and the creatures that live on it.\n\nOur three main characters: polar bear, elephant and humpback whale, show the challenges faced by creatures whose lives are dominated by a migratory existence in a world that is fast changing. The natural history of our planet has never been filmed on such a scale before. EARTH uses resources and technology on an unprecedented scale, to reveal rarely observed animal behaviours.\n\nThese are three incredible journeys; full of beauty, but also rife with danger. EARTH combines rare action unimaginable scale impossible locations and intimate moments among our planets bestloved wildest and most elusive creatures. To an irresistible eternal rhythm, the EARTH moves through the seasons, all life bending to the power of the sun.\n\n\nNederlands (dutch):\n\nDVD Gegevens:\nTitel: Earth [2007] (Pal)\nLeeftijd: Vanaf 6 jaar\nMenu: Ja \nExtra&amp;#039;s: Ja \nGeluid: 5.1 - DTS - Engels\nSubs: Nederlands\nDisc Format: DVD 5\nFormaat: Video_ts\nCover: Nederlandse cover zit er bij\nCompressie: Dvd rebuilder prof 10cce\n\nSuper goeie kwaliteit met alles er op en er aan\n\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/44974&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/44974&lt;/a&gt;\n\nGroot Brittannie / Duitsland\nDocumentaire\n96 minuten\n\ngeregisseerd door Alastair Fothergill en Mark Linfield\nmet de stem van Patrick Stewart\n\nIn de documentaire &quot;Earth&quot; wordt een tocht van Noordpool naar Zuidpool gemaakt en benadrukt daarbij de strijd om te overleven. &quot;Earth&quot; confronteert ons door middel van indrukwekkende beelden en landschappen, uitgelicht door een oogverblindende zon, met de harde realiteit van het leven op onze planeet. De documentaire volgt hiertoe een ijsberenfamilie, een kudde olifanten en twee bultrug walvissen in hun vaste leefomgeving en toont de invloed van seizoenswisselingen daarop. Het wordt duidelijk hoe de opwarming van de aarde de overlevingskansen van vele diersoorten bedreigt. Het lukt de makers om in gebieden te filmen waar nog nooit eerder filmopnames zijn gemaakt. Zo wordt er gefilmd op ijzingwekkende hoogte op de Mount Everest.\n","torrent":{"xt":"urn:btih:fd1ce043256448a0d759545957cc686e0aace65c","amp;dn":"Earth+%282007%29+-+DTS+-+dutch+subs+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd1ce043256448a0d759545957cc686e0aace65c","infoHashBuffer":{"type":"Buffer","data":[253,28,224,67,37,100,72,160,215,89,84,89,87,204,104,110,10,172,230,92]},"announce":[],"urlList":[]}}