{"title":"Downton Abbey 2x02x03 DVB Spanish by tony","uid":6903627,"size":1049697726,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:fe15bd3d1dacb8f2b9cf7e97878e9fd767394113&amp;dn=Downton+Abbey+2x02x03+DVB+Spanish+by+tony&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"carambolas","files":4,"time":1324493015,"description":"Si quieres mas series, peliculas, juegos, etc... tanto por descarga directa como por torrent. visitanos:\n                                                                                   &lt;a href=&quot;\nhttp://www.tonytorrent.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tonytorrent.com&lt;/a&gt;\n\nLa serie ha sido uno de los ÃƒÂ©xitos indiscutibles de la ficciÃƒÂ³n en las islas en 2010, uniendo los cÃƒÂ³digos del culebrÃƒÂ³n con ese subgÃƒÂ©nero en sÃƒÂ­ mismas que son las historias en grandes casas de campo inglesas. La serie de ITV se centra en la propiedad de Lord Grantham y en las intrigas por ver quiÃƒÂ©n herederÃƒÂ¡ el tÃƒÂ­tulo, las tierras y el dinero. La familia del seÃƒÂ±or la completan su esposa, que es una rica heredera estadounidense, sus tres hijas y la condesa viuda de Grantham, madre del lord, y en la casa tambiÃƒÂ©n seguimos las peripecias de los criados, cuyas cabezas son Carson, el mayordomo, y la seÃƒÂ±ora Hughes, que es el ama de llaves. Entre ellos tambiÃƒÂ©n hay intrigas y secretos de lo mÃƒÂ¡s diverso, y la acciÃƒÂ³n se desplaza fluidamente entre el mundo de arriba de las escaleras y el de debajo.\nUna cosa que juega a su favor es que las tramas se inicien en 1912, una ÃƒÂ©poca llena de cambios sociales y polÃƒÂ­ticos, y la serie va, ademÃƒÂ¡s, a toda velocidad. En una elipsis en medio de un capÃƒÂ­tulo han podido pasar meses y, de un episodio a otro, un aÃƒÂ±o entero, pero el trabajo de contarnos rÃƒÂ¡pidamente quÃƒÂ© ha pasado en ese periodo de tiempo estÃƒÂ¡ muy logrado y ni se nota. Y a pesar de esos giros de guiÃƒÂ³n muy de telenovela, hay mÃƒÂ¡s sutileza y pequeÃƒÂ±os detalles aquÃƒÂ­ y allÃƒÂ¡ que dibujan mejor a los personajes y que enriquecen todo el conjunto. Y tambiÃƒÂ©n es posible reÃƒÂ­rse mucho con algunos de sus personajes (la cocinera, por ejemplo, o la madre de Lord Grantham, una siempre grande Maggie Smith).","torrent":{"xt":"urn:btih:fe15bd3d1dacb8f2b9cf7e97878e9fd767394113","amp;dn":"Downton+Abbey+2x02x03+DVB+Spanish+by+tony","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe15bd3d1dacb8f2b9cf7e97878e9fd767394113","infoHashBuffer":{"type":"Buffer","data":[254,21,189,61,29,172,184,242,185,207,126,151,135,142,159,215,103,57,65,19]},"announce":[],"urlList":[]}}