{"title":"Yellowcard - Midget Tossing (1997) [FLAC]","uid":9023822,"size":234826689,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:fe185e3cec31fd421bf8df7b617da20e27cde415&amp;dn=Yellowcard+-+Midget+Tossing+%281997%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1381327109,"description":"\n  Yellowcard - Midget Tossing (1997) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Punk-Pop, Alternative, Emo\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bit Rate: ~ 900 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  01 2 Quarts\n  02 Possessions\n  03 Sue\n  04 American't\n  05 Up Hill Both Ways\n  06 Me First\n  07 For the Longest Time\n  08 Get Off the Couch\n  09 Interlewd\n  10 Someday\n  11 Goodbye\n\n  Midget Tossing is Yellowcard's debut album, released in 1997 by Takeover Records. It is out of print. The songs &quot;Sue&quot; and &quot;Uphill Both Ways&quot; both appeared on Yellowcard's following album, Where We Stand. The lyrics of the song For the Longest Time originate from Billy Joel's The Longest Time.\n\n  The punk-inspired quintet Yellowcard formed in Jacksonville, Florida, in 1997 but didn't solidify their lineup until a move to Southern California in early 2000. Comprised of vocalist/guitarist Ryan Key (who had briefly played with Cali-based Craig's Brother), vocalist/violinist Sean Mackin, guitarist Ben Harper, drummer Longineu Parsons, and bassist Warren Cooke, the band officially debuted on wax in 2001 with One for the Kids (Lobster) and returned a year later with the Underdog EP for Fueled by Ramen. The group had a really big year in 2003, replacing Cooke with Pete Mosely (of Inspection 12), signing with Capitol, issuing Ocean Avenue on the label, and heading out for a series of Warped Tour dates with the recently added Mosely replaced by Alex Lewis. Fall and winter found Yellowcard hitting clubs with acts like Matchbook Romance and Less Than Jake.\n\n  In late 2004, Ocean Avenue was certified double platinum by the RIAA, and singles such as &quot;Way Away,&quot; &quot;Only One,&quot; and the title track continued to impact MTV and Top 40 radio for the rest of the year. The same year, Lewis was given his walking papers when Mosely approached the band about rejoining. Yellowcard's sophomore effort, Where We Stand, was reissued in June 2005, and Lights and Sounds was released in early 2006. Though ultimately not as well received by fans as prior albums, upon its first week of release, Lights and Sounds entered the Billboard 200 at number five and earned the number one spot on the Alternative Album chart, quickly gaining momentum on the 2.5-million-selling Ocean Avenue. Meanwhile, founding member Harper (who also runs Takeover Records) left the group amid some band controversy and was replaced by Staring Back guitarist Ryan Mendez.\n\n  The band returned to the studio later that year and got to work on its fifth full-length, Paper Walls, which was released in July 2007. In 2008 the bandmembers announced they would be going on an indefinite hiatus, leaving Capitol Records. After recharging their batteries for a couple of years, Yellowcard signed with Hopeless Records and in 2011 released When You're Through Thinking, Say Yes. In 2012, Yellowcard returned with their eighth studio album, Southern Air. Featuring guest appearances from All Time Low's Alex Gaskarth, Hey Monday's Cassadee Pope, and We Are the In Crowd's Taylor Jardine, the album included the singles &quot;Surface of the Sun,&quot; &quot;Awakening,&quot; and &quot;Here I Am Alive.&quot; Ahead of the tenth anniversary of Ocean Avenue, the band announced that an acoustic reinterpretation of the album would be issued in August 2013 and that a celebratory world tour would follow.","torrent":{"xt":"urn:btih:fe185e3cec31fd421bf8df7b617da20e27cde415","amp;dn":"Yellowcard+-+Midget+Tossing+%281997%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe185e3cec31fd421bf8df7b617da20e27cde415","infoHashBuffer":{"type":"Buffer","data":[254,24,94,60,236,49,253,66,27,248,223,123,97,125,162,14,39,205,228,21]},"announce":[],"urlList":[]}}