{"title":"Seizure - A medical thriller - Robin Cook","uid":5225797,"size":1787697,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fe63c7b6a70d7bdb592b90496c83eb3380af4529&amp;dn=Seizure+-+A+medical+thriller+-+Robin+Cook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"iownabmw","files":1,"time":1261114881,"description":"Seizure is the 2003 novel by American author Robin Cook.\n\nSenator Ashley Butler is a quintessential Southern demagogue whose support of traditional American values includes a knee-jerk reaction against virtually all biotechnologies. When he's called to chair a subcommittee introducing legislation to ban new cloning technology, the senator views his political future in bold relief; and Dr. Daniel Lowell, inventor of the technique that will take stem cell research to the next level, sees a roadblock positioned before his biotech startup.\n\nThe two seemingly opposite personalities clash during the senate hearings, but the men have a common desire. Butler's hunger for political power far outstrips his concern for the unborn; and Lowell's pursuit of gargantuan personal wealth and celebrity overrides any considerations for patients' well-being. Further complicating the proceedings is the confidential news that Senator Butler has developed Parkinson's disease-leading the senator and the researcher into a Faustian pact. In a perilous attempt to prematurely harness Lowell's new technology, the therapy leaves the senator with the horrifying effects of temporal lobe epilepsy-seizures of the most bizarre order.\n\nTorn from the headlines, Seizure is a cautionary tale for a time where biotechnology pulls us into a promising yet frightening new world.","torrent":{"xt":"urn:btih:fe63c7b6a70d7bdb592b90496c83eb3380af4529","amp;dn":"Seizure+-+A+medical+thriller+-+Robin+Cook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe63c7b6a70d7bdb592b90496c83eb3380af4529","infoHashBuffer":{"type":"Buffer","data":[254,99,199,182,167,13,123,219,89,43,144,73,108,131,235,51,128,175,69,41]},"announce":[],"urlList":[]}}