{"title":"The Quest","uid":7857481,"size":809136109,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:fe6f3a5e1a6b084fb831a8ba9ebc23a00a07ccf5&amp;dn=The+Quest&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cloak-and-dagger","files":-1,"time":1353809907,"description":"In this gripping account of the quest for the energy that our world needs, Daniel Yergin continues the riveting story begun in his Pulitzer Prize-winning book, The Prize. A master storyteller as well as a leading energy expert, Yergin shows us how energy is an engine of global political and economic change. It is a story that spans the energies on which our civilization has been built and the new energies that are competing to replace them. From the jammed streets of Beijing to the shores of the Caspian Sea, from the conflicts in the Mideast to Capitol Hill and Silicon Valley, Yergin takes us into the decisions that are shaping our future.\n\nThe drama of oil-the struggle for access, the battle for control, the insecurity of supply, the consequences of use, its impact on the global economy, and the geopolitics that dominate it-continues to profoundly affect our world.. Yergin tells the inside stories of the oil market and the surge in oil prices, the race to control the resources of the former Soviet empire, and the massive mergers that transformed the landscape of world oil. He tackles the toughest questions: Will we run out of oil? Are China and the United States destined to come into conflict over oil? How will a turbulent Middle East affect the future of oil supply?\n\nYergin also reveals the surprising and sometimes tumultuous history of nuclear and coal, electricity, and the &quot;shale gale&quot; of natural gas, and how each fits into the larger marketplace. He brings climate change into unique perspective by offering an unprecedented history of how the field of climate study went from the concern of a handful of nineteenth- century scientists preoccupied with a new Ice Age into one of the most significant issues of our times.\n\nHe leads us through the rebirth of renewable energies and explores the distinctive stories of wind, solar, and biofuels. He offers a perspective on the return of the electric car, which some are betting will be necessary for a growing global economy.\n\nThe Quest presents an extraordinary range of characters and dramatic stories that illustrate the principles that will shape a robust and flexible energy security system for the decades to come. Energy is humbling in its scope, but our future requires that we deeply understand this global quest that is truly reshaping our world.","torrent":{"xt":"urn:btih:fe6f3a5e1a6b084fb831a8ba9ebc23a00a07ccf5","amp;dn":"The+Quest","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe6f3a5e1a6b084fb831a8ba9ebc23a00a07ccf5","infoHashBuffer":{"type":"Buffer","data":[254,111,58,94,26,107,8,79,184,49,168,186,158,188,35,160,10,7,204,245]},"announce":[],"urlList":[]}}