{"title":"National Geographic - The Sinking of the Belgrano dual audio.Spa","uid":4527176,"size":748148271,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:fe8f5dca16032642b007178c28830972d61b56d8&amp;dn=National+Geographic+-+The+Sinking+of+the+Belgrano+dual+audio.Spa&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zecarlos","files":3,"time":1227399179,"description":"Warning: dual audio, English and Spanish.\n\nIt was one of the most bitter controversies of the Falklands war: the sinking of the ageing Argentine cruiser the General Belgrano, with the loss of 323 lives by a British submarine as it steamed out of the British maritime exclusion zone. It was regarded by some as a war crime.\n\nNow, in comments that appear to exonerate the actions of the British commander of the Falklands Task Force, Admiral Sandy Woodward, and Margaret Thatcher, Prime Minister at the time, the commander of the Belgrano has broken a 21-year silence. He admits he had not only been commanded to attack the British fleet wherever he encountered it but was also &amp;#039;anxious to pull the trigger&amp;#039;.\n\nCaptain HÃƒÂ©ctor Bonzo also admits that, far from retreating from the British Task Force as he sailed west with two accompanying destroyers, his change of direction was a temporary manoeuvre. \nSunk by a British submarine on 2 May 1982, the demise of the Argentine battleship remains controversial to this day, not least for the trial and subsequent acquittal of Ministry of Defence civil servant Clive Ponting, who leaked details of attempts to mislead a Select Committee examing the sinking to Labour MP Tam Dalyell.\n\nCritics of the action ask why Thatcher condemned to death 323 sailors by ordering the sinking of a vessel outside the exclusion zone and sailing away from the Falklands. They also ask why the ship was sunk at all when the British Government had been made aware of Peruvian efforts to find a peaceful solution to the crisis caused by the Argentine invasion of the Falklands. ","torrent":{"xt":"urn:btih:fe8f5dca16032642b007178c28830972d61b56d8","amp;dn":"National+Geographic+-+The+Sinking+of+the+Belgrano+dual+audio.Spa","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe8f5dca16032642b007178c28830972d61b56d8","infoHashBuffer":{"type":"Buffer","data":[254,143,93,202,22,3,38,66,176,7,23,140,40,131,9,114,214,27,86,216]},"announce":[],"urlList":[]}}