{"title":"Express Burn  v 4.08","uid":4239435,"size":562233,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ffdda4dcdab8e8e429cc8452b7bd919f532fca83&amp;dn=Express+Burn++v+4.08&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"captainelliotspencer","files":1,"time":1213464463,"description":"                      Express Burn  \n\nBurn CDs, DVDs or Blu-ray Discs with Express Burn Plus\nExpress Burn Plus is a program that lets you create and burn audio CDs, data CDs, video DVDs, data DVDs or data Blu-ray discs under Windows or Mac OS X.\n\nWith Express Burn Plus you can record an audio CD, video DVD or data CD/DVD/Blu-ray quickly and easily by dragging the files you want onto the Express Burn Plus icon and clicking Burn. You can also use Express Burns easy to use interface to navigate to your files and add files or folders as you please. The software does the rest, including converting the files if required.\n\nIt also has more advanced features like the ability to create and record ISO images and support for many more file formats. Express Burn Plus is also the fastest CD/DVD writing program in the world using proprietary optimizing systems.\n\n-----------------------------------------\nFeatures:\n\n* Writes the following types of discs:\n          \n          o Data CDs (perfect for backup)\n          o Audio CDs (for traditional CD player)\n          o Mp3 CDs (larger capacity alternative to audio cds)\n          o Video DVDs (to be played on a standard DVD player - Windows Only)\n          o Data DVDs (4.5GB+ on a single DVD )\n          o Blu-Ray discs (25GB+). \n    \n* Supports multi session recording to CD (you can choose to add more music tracks at a later time).\n* Records CD Recordable (CDR) and CD Re-recordable (CDRW) discs.\n* Can seamlessly burn audio CDs with no pause between tracks.\n* Audio CDs are recorded with direct digital recording (so perfect audio quality is maintained).\n* Audio CD burning supports wav, mp3, wma, au, aiff, ra, ogg, flac, aac and a number of other audio file formats.\n* Burn ISO compliant data DVDs and Blue-ray discs (DVD-R, DVD-RW, DVD+R, DVD+RW, BD-R, BD-RE, BD-R DL, BD-RE DL).\n* Video DVD Authoring - video files will be re-encoded and made in to a standard DVD Movie disk, playable on a DVD player (Windows version only)\n* Video burning supports avi, mpg, vob, asf, wmv, mp4, ogm and all video formats that have a DirectShow based codec.\n* Burn video in a choice of widescreen or standard formats for video dvd authoring (Windows version only).\n* Record video files to PAL or NTSC (Windows version only).\n* Support Joliet and CDA formats.\n* Data CDs support multilevel folders and long file names.\n* Data CDs are fully ISO compliant with Joliet extension.\n* Includes command line operation for automation and integration with other programs.\n* Supports fast, right mouse click functionality for burning ISO images.\n* Simple, easy to use interface for day-to-day operation. \n\n\n1. Extract with Winrar.\n2. Install.\n3. Run keygen. \n[The keygen is actually for version 4.02 BUT it works with this  version aswell]\n4. Copy the text as displayed in the keygen to the registration box in express burn.\n5. The software will then be registered and will have full functionality.\n\n---------------------------------------\n\nEnjoy!!","torrent":{"xt":"urn:btih:ffdda4dcdab8e8e429cc8452b7bd919f532fca83","amp;dn":"Express+Burn++v+4.08","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ffdda4dcdab8e8e429cc8452b7bd919f532fca83","infoHashBuffer":{"type":"Buffer","data":[255,221,164,220,218,184,232,228,41,204,132,82,183,189,145,159,83,47,202,131]},"announce":[],"urlList":[]}}